Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: es, ro, sv

source: We're going to want to be more efficient with the network database's healing and maintenance algorithms - rather than constantly explore the keyspace for new peers - causing a significant number of network messages and router load - we can slow down or even stop exploring until we detect that there's something new worth finding (e.g. decay the exploration rate based upon the last time someone gave us a reference to someone we had never heard of). We can also do some tuning on what we actually send - how many peers we bounce back (or even if we bounce back a reply), as well as how many concurrent searches we perform.
es: Queremos ser más eficientes en la reparación de la base de datos de la red y los algoritmos de mantenimiento - en vez de explorar la red constantemente buscando nuevos pares - causando un gran número de mensajes y carga en el ruter - podemos frenar o incluso parar la búsqueda mientras no se detecte que hay algo nuevo por explorar (por ejemplo, ralentizar la tasa de exploración dependiendo de la última vez que algún par nos dio una referencia de algún otro par desconocido). También podemos mejorar lo que enviamos - cuantos pares recuperamos (o incluso si recuperamos una respuesta), también podemos mejorar cuantas búsquedas concurrentes hacemos.
ro: Vom dori să fim mai eficienți cu vindecarea bazei de date a rețelei și algoritmi de întreținere - în loc să exploreze constant spațiul cheie pentru noi colegii - provocând un număr semnificativ de mesaje de rețea și încărcare de router - noi poate încetini sau chiar opri explorarea până când detectăm că este ceva nou merită găsit (de exemplu, decăderea ratei de explorare în funcție de ultima dată pe cineva ne-a dat o referire la cineva despre care nu auzisem niciodată). Putem face și unele acordarea a ceea ce trimitem de fapt - câți colegi ne respingem înapoi (sau chiar dacă noi respingeți un răspuns), precum și câte căutări simultane efectuăm.
sv: Vi kommer vilja vara mer effektiva med nätverksdatabasens läkande och underhållande algoritmer - istället för att konstant utforska nyckelrymden efter nya noder - som orsakar ett stort antal nätverksmeddelanden och routerbelastning - vi kan sakta ner eller till och med stanna utforskningen tills vi finner något nytt värt att hitta (t.ex minska utforskningshastigheten baserat på den senaste gången någon gav oss en referens till någon vi aldrig hört talas om). Vi kan också göra några inställningar för vad vi faktiskt skickar - hur många noder vi skickar tillbaka (eller till och med om vi skickar tillbaka ett svar), såväl som hur många samtidiga sökningar vi utför.

source: Session Tag Tuning and Improvements
es: Mejoras en las Etiquetas de Sesión
ro: Ajustarea și îmbunătățirile etichetelor de sesiune
sv: Session Tag Inställning och Förbättring

source: The way the <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> algorithm works is by managing a set of random one-time-use 32 byte arrays, and expiring them if they aren't used quickly enough. If we expire them too soon, we're forced to fall back on a full (expensive) ElGamal encryption, but if we don't expire them quickly enough, we've got to reduce their quantity so that we don't run out of memory (and if the recipient somehow gets corrupted and loses some tags, even more encryption failures may occur prior to detection). With some more active detection and feedback driven algorithms, we can safely and more efficiently tune the lifetime of the tags, replacing the ElGamal encryption with a trivial AES operation.
es: La forma en que funciona el algoritmo <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> es administrando un conjunto de arrays de 32 bytes aleatorios de un solo uso, y desechándolos cuando no se usan los suficientemente rápido. Si los desechamos demasiado pronto, tenemos que crear otra vez un cifrado (muy caro) ElGamal, pero si no los desechamos a tiempo, tenemos que reducir su número o nos quedaremos sin memoria RAM (y si al destinatario de alguna forma se le corrompen y pierde algunas etiquetas, pueden ocurrir incluso más fallos en los cifrados). Con algoritmos con detección activa y de control, podemos ajustar de una forma más segura y eficientemente el tiempo de vida de una etiqueta, reemplazando el cifrado ElGamal con un algoritmo más trivial como AES.
ro: Modul în care algoritmul <a href="%(elgamalaes)s">ElGamal / AES + SessionTag</a> funcționează este prin gestionarea unui set de matrițe aleatorii cu o singură dată, cu 32 de octeți, și expiră dacă nu sunt folosite destul de repede. Dacă le expirăm prea curând, suntem forțati să cadă din nou pe o criptare ElGamal (scumpă) completă, dar dacă nu expirați-le suficient de repede, trebuie să le reducem cantitatea, astfel încât să nu facem rămâne fără memorie (și dacă destinatarul este cumva corupt și pierde unele etichete, pot apărea chiar mai multe eșecuri de criptare înainte de detectare). Cu careva algoritmi mai activi de detecție și feedback, putem asigura în siguranță și mai mult reglați eficient durata de viață a etichetelor, înlocuind criptarea ElGamal cu o operație AES banală.
sv: Sättet <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> algoritmen fungerar är genom att hantera ett set av slumpmässiga engångsanvändnings 32 bytes arrayer, och att låta deras tidsgiltighet rinna ut om dom inte används snabbt nog. Om vi låter deras tidsgiltighet rinna ut för snabbt så faller vi tillbaka till en full (dyr) ElGamal kryptering, men om vi inte låter deras tidsfrist rinna ut snabbt nog, så måste vi reducera deras kvantitet så att vi inte tar slut på minne (och om mottagaren på något vis blir korrupt och förlorar några taggar, så kan ännu fler krypteringsfel inträffa innan det hittas). Med lite mer aktiv diagnosticering och responsdrivna algoritmer, så kan vi säker och mer effektivt ställa in lifstiden av taggarna, som ersätter ElGamal-krypteringen med en enkel AES operation.

source: Additional ideas for improving Session Tag delivery are described on the <a href="%(elgamalaes)s#future">ElGamal/AES+SessionTag page</a>.
es: Algunas ideas adicionales para mejorar el envío de las Etiquetas de Sesión se describen en la <a href="%(elgamalaes)s#future">página de ElGamal/AES+SessionTag</a>.
ro: Idei suplimentare pentru îmbunătățirea livrării Etichetelor de sesiune sunt descrise pe document <a href="%(elgamalaes)s#future">Pagina ElGamal / AES + SessionTag</a>.
sv: Fler idéer för att förbättra Session Tag utdelningen beskrivs på <a href="%(elgamalaes)s#future">ElGamal/AES+SessionTag sidan</a>.

source: Migrate sessionTag to synchronized PRNG
es: Migrar las Etiquetas de sesión a PRNG sincronizado.
ro: Migrează sesiunea Tag către PRNG sincronizat
sv: Migrera sessionTag till synkroniserad PRNG

source: Right now, our <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> algorithm works by tagging each encrypted message with a unique random 32 byte nonce (a "session tag"), identifying that message as being encrypted with the associated AES session's key. This prevents peers from distinguishing messages that are part of the same session, since each message has a completely new random tag. To accomplish this, every few messages bundle a whole new set of session tags within the encrypted message itself, transparently delivering a way to identify future messages. We then have to keep track of what messages are successfully delivered so that we know what tags we may use.
es: Ahora mismo, nuestro algoritmo <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a> funciona etiquetando cada mensaje cifrado con un 'nonce' único de 32 bytes (una "etiqueta de sesión"), identificando el mensaje como un mensaje cifrado con la clave de sesión AES asociada. Esto previene que los pares distingan los mensajes que son parte de la misma sesión, ya que cada mensaje tiene una etiqueta nueva completamente aleatoria. Para llevar esto acabo, cada unos pocos mensajes se envuelven un nuevo conjunto de etiquetas de sesión dentro del mensaje cifrado, creando una forma transparente de identificar los mensajes futuros. Por lo tanto tenemos que llevar un control de cuales mensajes han llegado con éxito a su destino para saber que etiquetas debemos usar.
ro: În acest moment, algoritmul <a href="%(elgamalaes)s">ElGamal / AES + SessionTag</a> funcționează prin etichetarea fiecărui mesaj criptat cu un random unic 32 byte nonce (o „etichetă de sesiune”), identificând mesajul ca fiind criptat cu cheia sesiunii AES asociate. Acest lucru împiedică semenii să distingă mesaje care fac parte din aceeași sesiune, deoarece fiecare mesaj are o etichetă complet nouă aleatorie. Pentru a realiza acest lucru, fiecare câteva mesaje conțin un nou întreg set de etichete de sesiune din mesajul criptat în sine, în mod transparent livrarea unei modalități de identificare a mesajelor viitoare. Atunci trebuie să urmărim ce mesaje sunt livrate cu succes, astfel încât să știm ce etichete putem folosi.
sv: Just nu, så fungerar vår <a href="%(elgamalaes)s">ElGamal/AES+SessionTag</a>-algoritm genom att tagga varje krypterat meddelande med ett unikt slumpmässigt 32 bytes nonce (en "session tag"), som identifierar att meddelandet krypteras med den associerade AES-sessionsnyckeln. Detta hindrar noder från att urskilja meddelanden som är en del av samma session, eftersom varje meddelande har en helt ny slumpmässig tagg. För att uppnå detta, måste ett nytt set av sessionstaggar skickas med ett meddelande efter några få meddelanden, vilket transparent ger ett sätt att identifiera framtida meddelanden. Vi måste sedan hålla koll på vilka meddelanden som lyckats skickas så vi vet vilka taggar vi kan använda.

source: This works fine and is fairly robust, however it is inefficient in terms of bandwidth usage, as it requires the delivery of these tags ahead of time (and not all tags may be necessary, or some may be wasted, due to their expiration). On average though, predelivering the session tag costs 32 bytes per message (the size of a tag). As Taral suggested though, that size can be avoided by replacing the delivery of the tags with a synchronized PRNG - when a new session is established (through an ElGamal encrypted block), both sides seed a PRNG for use and generate the session tags on demand (with the recipient precalculating the next few possible values to handle out of order delivery).
es: Este sistema funciona bien y es muy robusto, aunque no es eficiente en el uso del ancho de banda, y necesita el envío de estas etiquetas antes de tiempo (y no todas las etiquetas serán necesarias, o se desperdician, debido al tiempo de expiración). De media, enviar con antelación las etiquetas de sesión cuesta 32 bytes por mensaje (el tamaño de una etiqueta). aunque como ha sugerido Taral, ese tamaño puede evitarse reemplazando el envío de etiquetas con un PRNG sincronizado - cuando una nueva sesión se establece (a través de un bloque cifrado ElGamal), ambos lados siembran un PRNG para generar las etiquetas de sesión cuando se necesite (con el destinatarios pre calculando los siguientes valores para poder manejar los envíos)
ro: Acest lucru funcționează bine și este destul de robust, însă este ineficient din punct de vedere de utilizare a lățimii de bandă, deoarece necesită livrarea acestor etichete înainte timp (și nu toate etichetele pot fi necesare sau unele pot fi pierdute din cauza expirarii lor). Totuși, în medie, predelectarea costă eticheta de sesiune 32 de octeți pe mesaj (dimensiunea unei etichete). După cum sugera Taral, totuși dimensiunea poate fi evitată înlocuind livrarea etichetelor cu una sincronizată PRNG - când se stabilește o nouă sesiune (printr-un cod ElGamal criptat bloc), ambele părți plantează un PRNG pentru utilizare și generează etichetele de sesiune la cerere (destinatarul precalculând următoarele câteva valori posibile să se ocupe de livrare fără comandă).
sv: Detta fungerar utmärkt och är tämligen robust, däremot är det ineffektivt i frågan om bandbreddsanvändning, eftersom det kräver att taggarna mottages i förväg (och alla taggar behövs kanske inte, vissa är onödiga, p.g.a. tidsbegränsningar). I det genomsnittliga fallet, kostar det 32 bytes (storleken av en tagg) att förleverera sessionstaggar per meddelande. Som Taral föreslog så, kan den storleken undvikas denom att ersätta skickande av taggarna med en synkroniserad PRNG - när en ny session etableras (genom ett ElGamal-krypterat block), båda sidorna seedar ett PRNG som används för att generera sessions taggarna på begäran (med mottagaren förberäknar de nästkommande möjliga värdna för att hantera mottagning i annan ordning).

source: Longer lasting tunnels
es: Tiempo de duración máximo de los túneles.
ro: Tuneluri de durată mai lungă
sv: Tunnlar som varar längre

source: The current default tunnel duration of 10 minutes is fairly arbitrary, though it "feels okay". Once we've got tunnel healing code and more effective failure detection, we'll be able to more safely vary those durations, reducing the network and CPU load (due to expensive tunnel creation messages).
es: El tiempo de duración actual de 10 minutes es bastante arbitrario, aunque parece que funciona bien. Una vez que tengamos el código de reparación de túnel y un sistema de detección de fallos más eficiente, podremos cambiar estas duraciones de forma más segura, reduciendo la carga en la CPU y en la red (debido al excesivo costo al crear los mensajes de los túneles).
ro: Cu toate acestea, durata actuală a tunelului implicită de 10 minute este destul de arbitrară se "simte bine". Odată ce avem cod de vindecare a tunelului și detectarea mai eficienta a eșecului, vom putea varia mai în siguranță aceste durate, reducând rețea și încărcarea procesorului (datorită mesajelor costisitoare de creare a tunelului).
sv: Standard-varaktigheten för tunnlar som är 10 minuter är ganska slumpmässig, men den "känns okej". Efter vi har tunnel-reparations kod och mer effektiv fel detektion, så kommer vi på ett säkrare vis kunna variera de varaktigheterna och reducera nätverks och CPU-belastning (från dyra tunnel-byggar meddelande).

source: This appears to be an easy fix for high load on the big-bandwidth routers, but we should not resort to it until we've tuned the tunnel building algorithms further. However, the 10 minute tunnel lifetime is hardcoded in quite a few places, so substantial effort would be required to change the duration. Also, it would be difficult to maintain backward compatibility with such a change.
es: Esto parece un fácil arreglo para la carga de la CPU y el gasto de ancho de banda en los ruters, pero no podemos usarlos hasta que hayamos afinado mucho mejor los algoritmos de creación de túneles. Aún así, el tiempo de vida de 10 minutos está incluido en varios sitios, con lo que hará falta bastante esfuerzo para cambiar esta duración. Además, será dificil mantener la compatibilidad con versiones anteriores tras este cambio.
ro: Aceasta pare a fi o soluție ușoară pentru încărcare mare pe routerele cu lățime mare de bandă, dar nu trebuie să recurgem la asta până nu am reglat mai departe algoritmii de construire a tunelului. Cu toate acestea, durata de viață a tunelului de 10 minute este codată în câteva locuri, astfel încât să fie nevoie de efort substanțial pentru modificarea duratei. De asemenea, ar fi dificil să se mențină compatibilitatea înapoi cu o astfel de modificare.
sv: Detta verkar vara en enkel lösning för hög belastning på routrar med mycket bandbredd, men vi borde inte använda den utvägen innan vi ställt int algoritmerna för att bygga tunnlar vidare. Dock, så är livstiden för tunnlar, 10 minuter, hårdkodad på ett antal platset, så en stor ansträngning hade krävts för att ändra livstident. Det hade också varit svårt att bibehålla bakåtkompabilitet med en sådan förändring.

source: Currently, since the network average tunnel build success rate is fairly high, there are no current plans to extend tunnel lifetime.
es: Actualmente, ya que el éxito en la creación de túneles de la red es bastante alto, no existen planes para aumentar el tiempo de vida de los túneles.
ro: În prezent, întrucât rata medie de succes a construirii tunelurilor din rețea este destul de mare, nu există planuri actuale de prelungire a duratei de viață a tunelului.
sv: Eftersom nätverkets genomsnittliga sannolikthet att lyckas bygga en tunnel för närvarande är ganska hög, så finns det för tillfället inga planer att förlänga tunnlars livstid.

source: Adjust the timeouts
es: Ajustar tiempo máximo de espera
ro: Reglați intervalele de timp
sv: Justera timeouterna

source: Yet another of the fairly arbitrary but "okay feeling" things we've got are the current timeouts for various activities. Why do we have a 60 second "peer unreachable" timeout? Why do we try sending through a different tunnel that a LeaseSet advertises after 10 seconds? Why are the network database queries bounded by 60 or 20 second limits? Why are destinations configured to ask for a new set of tunnels every 10 minutes? Why do we allow 60 seconds for a peer to reply to our request that they join a tunnel? Why do we consider a tunnel that doesn't pass our test within 60 seconds "dead"?
es: Otros truquitos arbitrarios que parece que "funcionan bien" usados son los tiempos de vida actuales de varias actividades. ¿Por qué tenemos 60 segundos para el tiempo de vida de "par inaccesible"?¿Por qué intentamos usar un diferente túnel que el LeaseSet nos avisa después de 10 segundos?¿Por qué las consultas a la base de datos está limitada por 60 o 20 segundos?¿Por qué están las destinaciones configuradas para preguntar por un nuevo grupo de túneles cada 10 minutos?¿Por qué permitimos a un par tardar 60 segundos en responder a la petición de unirse a un túnel?¿Por qué consideramos un túnel como "muerto" si no pasa nuestras pruebas en 60 segundos?
ro: Cu toate acestea, alte lucruri destul de arbitrare, dar „bine”, le avem intervale de timp curente pentru diverse activități. De ce avem un coleg de 60 de secunde "timeout" de neatins? De ce încercăm să trimitem prin alt tunel care a LeaseSet face reclame după 10 secunde? De ce sunt interogările bazei de date din rețea delimitat cu 60 sau 20 de limite? De ce sunt configurate destinațiile pentru a cere a nou set de tunele la fiecare 10 minute? De ce permitem 60 de secunde pentru un coleg răspundeți la solicitarea noastră de a se alătura unui tunel? De ce considerăm un tunel care nu ne trece testul în 60 de secunde „mort”?
sv: Ytterligare en av det ganska slumpmässiga sakerna som "känns okej" som vi har är de nuvarande timeouterna för olika aktiviteter. Varför har vi en 60 sekunders "onåbar nod"-timeout? Varför försöker vi skicka genom en annan tunnel som ett LeaseSet annonserar efter 10 sekunder? Varför är nätverksdatabas-förfrågningar begränsade mellan 60 och 20 sekunders gränser? Varför är mål inställda att fråga efter ett nytt set av tunnlar var 10:e minute? Varför väntar vi upp till 60 sekunder efter ett svar från en nod efter vi begärt att de går med i en tunnel? Varför tycker vi att en tunnel som inte klarar våra tester inom 60 sekunder är "död"?

source: Each of those imponderables can be addressed with more adaptive code, as well as tunable parameters to allow for more appropriate tradeoffs between bandwidth, latency, and CPU usage.
es: Todos estos imponderables pueden solucionarse con un código más adaptativo, al igual que con parámetros afinables que compensen el gasto entre el ancho de banda, latencia y el uso de CPU.
ro: Fiecare dintre aceste necondiționate poate fi adresat și cu un cod mai adaptiv ca parametri reglabili care să permită compensări mai adecvate între lățimea de bandă, latența și utilizarea procesorului.
sv: Var och en av dessa tankeställare kan lösas med mer adaptiv kod, men även med inställningsbara parametrear för att tillåta mer lämpliga utbyten mellan bandbredd, fördröjning och CPU-användning.

source: Full streaming protocol improvements
es: Mejoras en el protocolo de transmisión
ro: Îmbunătățirea completă a protocolului de streaming
sv: Förbättringar i det fulla streaming protokollet

source: Perhaps re-enable the interactive stream profile (the current implementation only uses the bulk stream profile).
es: Quizás usando de nuevo el perfil de transmisión interactivo (la implementación actual sólo usa el perfil de transmisión normal).
ro: Poate reactivă profilul fluxului interactiv ( implementarea curentă folosește doar profilul fluxului în vrac).
sv: Kanske återaktivera den interaktiva stream progilen (den nuvarande implementationen använder bara bulk stream profilen).

source: Client level bandwidth limiting (in either or both directions on a stream, or possibly shared across multiple streams). This would be in addition to the router's overall bandwidth limiting, of course.
es: Limitación del ancho de banda en el cliente (en una o las dos direcciones de una conexión, o posiblemente compartido entre varias conexiones). Esto será además del límite general de ancho de banda, por supuesto.
ro: Limitarea lățimii de bandă la nivel de client (în oricare sau ambele direcții ale unui flux, sau posibil împărtășit pe mai multe fluxuri). Acest lucru ar fi în plus față de limitarea generală a lățimii de bandă a routerului, desigur.
sv: Begränsningar av klient-nivå bandbredd (i antingen eller båda riktningarna av en stream, eller möjligtvis delat över flera streams). Detta skulle vara utöver routerns generella bandbredds-begränsningar, så klart.

source: Access control lists (only allowing streams to or from certain other known destinations).
es: Listas de control de acceso (sólo permitiendo conexiones desde o hacia otras destinaciones conocidas).
ro: Listele de control de acces (care permit doar fluxuri către sau din anumite destinații altor persoane cunoscute).
sv: Tillgångs kontroll-listor (bara tillåta streams till eller från vissa andra kända mål).

source: Web controls and monitoring the health of the various streams, as well as the ability to explicitly close or throttle them.
es: Control por web y monitorización del estado de varias conexiones, además de la posibilidad explícita de cerrarlas o regularlas.
ro: Controale web și monitorizarea stării de sănătate a diferitelor fluxuri ca abilitatea de a le închide sau accelera explicit.
sv: Webbkontroller och övervakning av hälsan av de olika streamarna, men även möjligheten att explicit stänga eller begränsa dom.

source: Additional ideas for improving the streaming library are described on the <a href="%(streaming)s#future">streaming library page</a>.
es: Varias ideas para mejorar la librería de straming se describen en la <a href="%(streaming)s#future">web de la librería de streaming</a>.
ro: Idei suplimentare pentru îmbunătățirea bibliotecii de streaming sunt descrise pe site <a href="%(streaming)s#future">pagina bibliotecii streaming</a>.
sv: Ytterligare idéer för att förbättra streaming biblioteket är beskrivna på <a href="%(streaming)s#future">streaming biobliotekets sida</a>.

source: Performance History
es: Historia de rendimiento.
ro: Istoricul performanțelor
sv: Prestanda historik

source: Notable performance improvements have been made using the techniques below. There is more to do, see the <a href="%(performance)s">Performance</a> page for current issues and thoughts.
es: Usando las técnicas de abajo se ha conseguido muchas mejoras en el rendimiento. Hay más por hacer, vea la web del <a href="%(performance)s">Rendimiento</a> para probelmas e ideas.
ro: Au fost realizate îmbunătățiri notabile ale performanței folosind tehnicile de mai jos. Mai sunt multe de făcut, consultați pagina<a href="%(performance)s">Performanță</a> pentru problemele și gândurile actuale.
sv: Bemärkningsvärda prestandaförbättringar har gjorts genom att använda teknikerna nedan. Det finns mer att göra, se <a href="%(performance)s">Prestanda</a> sidan för nuvarande problem och tankar.
