Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: es, ro, sv

source: Alternative I2P clients
es: Clientes I2P alternativos
ro: Clienți alternative I2P
sv: Alternativa I2P-klienter

source: The main I2P client implementation uses Java. If for some reason you can't use Java on your device, there are alternative implementations developed by community members.
es: La principal implementación de cliente I2P usa Java. Si por alguna razón no puede usar Java en su dispositivo, hay implementaciones alternativas desarrolladas por los miembros de la comunidad.
ro: Principala implementare a clientului I2P utilizează Java. Dacă pentru unii motiv pentru care nu puteți utiliza Java pe dispozitivul dvs., există implementări alternative dezvoltat de membrii comunității.

source: <a href="%(i2pd)s">i2pd</a> is a I2P client implementation in C++. As of early 2016, i2pd is became stable enough to be used in production, and since summer 2016 it fully implements all I2P APIs.
es: <a href="%(i2pd)s">i2pd</a> es una implementación de cliente I2P en C++. Desde principios de 2016, i2pd se ha vuelto lo suficientemente estable para ser usado en producción, y desde el verano de 2016 implementa todas las APIs de I2P por completo.
ro: <a href="%(i2pd)s">i2pd</a> este o implementare a clientului I2P în C ++. La începutul anului 2016, i2pd a devenit suficient de stabil pentru a fi utilizat în producție, iar din vara 2016 implementează integral toate API-urile I2P.

source: <a href="%(kovri)s">Kovri</a> is active i2pd fork developed for Monero cryptocurrency.
es: <a href="%(kovri)s">Kovri</a> es un derivado activo de i2pd para la criptomoneda Monero.
ro: <a href="%(kovri)s">Kovri</a> este o furcă activă i2pd dezvoltată pentru criptocurrency Monero.

source: <a href="%(go_i2p)s">Go-I2P</a> is I2P client developed using the <a href="%(golang)s">Go</a> programming language. The project is in early development.
es: <a href="%(go_i2p)s">Go-I2P</a> es un cliente I2P desarrollado usando el lenguage de programación <a href="%(golang)s">Go</a>. El proyecto está en fase inicial de desarrollo.
ro: <a href="%(go_i2p)s">Go-I2P</a> este un client I2P dezvoltat folosind <a href="%(golang)s">GO</a> limbaj de programare. Proiectul este în curs de dezvoltare.

source: Web Browser Configuration
es: Configuración del navegador web
ro: Configurare navigator web
sv: Webbläsar-konfiguration

source: Your web browser will need to be configured in order to browse eepsites and to utilize the outproxies available within I2P. Below are walkthroughs for some of the most popular browsers.
es: Su navegador web necesita ser configurado para poder navegar eepsites y para utilizar los outproxies disponibles en I2P. Debajo tiene un paso a paso para configurar los navegadores más populares.
ro: Browserul dvs. web va trebui să fie configurat pentru a naviga pe eepsite și către utilizați rezultatele disponibile în cadrul I2P. Mai jos găsiți câteva indicații cele mai populare browsere.
sv: Din webbläsare kommer behöva konigureras för att kunna surfa eepsidor och att kunna använda de utproxys som finns inom I2P. Nedan finns guider för några av de mest populära webbläsarna.

source: How to configure your browser
es: Como configurar su navegador
ro: Cum să configurați navigatorul
sv: Hur du ställer in din webbläsare

source: Outproxy Terms Of Service
es: Términos de servido del Outproxy
ro: Termeni de furnizare a serviciilor
sv: Användarvillkor För utproxyn

source: Internet Explorer 8 or Chrome
es: Internet Explorer 8 o Chrome
ro: Internet Explorer 8 sau Chrome
sv: Internet Explorer 8 eller Chrome

source: In the tools menu select the "Internet Options" line to open the settings. In the settings window choose the connections tab and click on LAN settings for the proxy port configuration.
es: En el menú de herramientas seleccione "Opciones de Internet" para abrir la configuración. En la ventana de configuración seleccione la pestaña de conexiones y pulse en configuración de LAN para configurar el puerto del proxy.
ro: În meniul Instrumente, selectați linia „Opțiuni Internet” pentru a deschide setările. În Fereastra setări alege fila conexiuni și faceți clic pe setările LAN pentru configurația portului proxy.
sv: I verktygsmenyn välj "Internet Alternativ"-raden för att öppna inställningarna. I det inställningsfönstret välj anslutnings-tabben och klicka på LAN inställningar för att nå proxyportskonfigurationen.

source: IE Internet Options
es: Opciones de Internet de IE
ro: Opțiuni internet IE
sv: IE Internet Alternativ

source: Now set the checkmark at "use a proxy server for your LAN" and at the "Bypass proxy server for local addresses". With a click on Advanced-button you open the window to open the ports. Enter the values like on the picture, IP 127.0.0.1 and port 4444 for HTTP, port 4445 for HTTPS. With clicks on OK you save the settings and your browser is set to use the I2P proxy. <b>Note/Privacy tip:</b> Set the FTP proxy to the same settings as the HTTP proxy.
es: Ahora marque "usar un servidor proxy para su LAN" y "Evitar el servidor proxy para direcciones locales". Con un clic en el botón Avanzadas mostrará la ventana para abrir los puertos. Introduzca los valores como en la imagen, IP 127.0.0.1, puerto 4444, para HTTP; y puerto 4445 para HTTPS. Haciendo clic en Aceptar guardará la configuración, y su navegador estará listo para usar el proxy I2P. <b>Nota/Consejo de privacidad:</b> Configure el proxy FTP con las mismas configuraciones que el proxy HTTP.
ro: Acum setați marcajul la „utilizați un server proxy pentru LAN-ul dvs.” și la „Bypass” server proxy pentru adrese locale ". Cu un clic pe butonul Advanced, deschideți fereastră pentru a deschide porturile. Introduceți valorile ca în imagine, IP 127.0.0.1 și portul 4444 pentru HTTP, portul 4445 pentru HTTPS. Cu clicuri pe OK salvați setări și browserul dvs. este setat să utilizeze proxy I2P. <b>Indicație / Sfat de confidențialitate</b>: Setați proxy FTP la aceleași setări ca proxy HTTP.
sv: Markera nu boxarna vid "använd en proxyserver för LAN" och vid "Använd inte proxy för lokala adresser". Med ett klick på Avancerat-knappen får du fram fönstret för att öppna portarna. Skriv in värden som dom på bilden, IP 127.0.0.1 och port 4444 för HTTP, port 4445 för HTTPS. Spara genom att klicka på OK. Browsern är nu inställd på att använda I2P-proxyn. <b>Obs/integritetstips:</b> Sätt FTP-proxyn på samma inställningar som HTTP-proxyn.

source: IE Proxy Settings
es: Configuración proxy en IE
ro: Configurări proxy IE
sv: IE Proxy Inställningar

source: From the Tools menu, select Options to bring up the Firefox settings panel. Click the icon labelled <em>Advanced</em>, then click on the <em>Network</em> tab. In the <em>Connections</em> section, click on the Settings button. You'll see a Window like the following:
es: Desde el menú de herramientas seleccione opciones y abra el menú de configuración de Firefox. Pulse en <em>Avanzado</em>, entonces pulse en la pestaña <em>Red</em>. En la sección de <em>Conexiones</em>, pulse el botón de Configuración. Se le mostrará una ventana como la siguiente:
ro: Din meniul Instrumente, selectați Opțiuni pentru a deschide panoul de setări Firefox. Faceți clic pe pictograma etichetată <em>Advanced</em>, apoi faceți clic pe <em>Network</em> tab. În secțiunea <em>Conexiuni</em>, faceți clic pe butonul Setări. veţi vedeți o fereastră ca următoarea:
sv: Från Verktygs-menyn, välj Alternativ för att öppna inställningspanelen i Firefox. Klicka på ikonen märkt <em>Avancerat</em>, klicka sedan på <em>Nätverk</em -tabben. I <em>Anslutningar</em>-delen, klicka på Inställnings-knappen. Du kommer se ett fönster likt det följande:

source: Firefox Network Options
es: Opciones de red de Firefox
ro: Opțiuni rețea Firefox
sv: Firefox Nätverks Inställningar

source: In the <em>Connection Settings</em> window, click the circle next to <em>Manual proxy configuration</em>, then enter 127.0.0.1, port 4444 in the HTTP Proxy field. Enter 127.0.0.1, port 4445 in the SSL Proxy field. Be sure to enter localhost and 127.0.0.1 into the "No Proxy for" box. <b>Note/Privacy tip:</b> Set the FTP proxy to the same settings as the HTTP proxy.
es: En la ventana <em>Configuración de la conexión</em>, haga clic en el círculo junto a <em>Configuración manual para proxy</em>, luego introduzca 127.0.0.1, puerto 4444, en el campo del Proxy HTTP. Introduzca 127.0.0.1, puerto 4445, en el campo Proxy SSL. Asegúrese de introducir localhost y 127.0.0.1 en el campo "Sin proxy para". <b>Nota/Consejo de privacidad:</b> Configure el proxy FTP con las mismas configuraciones que el proxy HTTP.
ro: În fereastra <em>Setări conexiune</em>, faceți clic pe cercul de lângă<em> Manual configurație proxy</em>, apoi introduceți 127.0.0.1, port 4444 în proxy HTTP camp. Introduceți 127.0.0.1, port 4445 în câmpul Proxy SSL. Asigurați-vă că introduceți localhost și 127.0.0.1 în caseta „Fără proxy pentru”. <b>Indicație / Sfat de confidențialitate:</b> Setați proxy FTP la aceleași setări ca proxy HTTP.
sv: I fönstret <em>Anslutningsinställningar</em>, klicka på cirkeln bredvid<em> Manuell Proxykonfiguration</em>, skriv sedan 127.0.0.1, port 4444 i fältet HTTP Proxy. Skriv in 127.0.0.1, port 4445 i fältet SSL Proxy. Glöm inte att skriva in localhost och 127.0.0.1 i rutan: "Ingen Proxy.

source: Firefox Proxy Settings
es: Configuración del Proxy de Firefox
ro: Configurări proxy Firefox
sv: Firefox Proxy Inställningar

source: From the <em>Settings</em> menu, select <em>Configure Konqueror</em>. In the Web Browsing group on the left side, select Proxy, then select the option "Use manually specified proxy configuration" on the right.
es: Desde el menú <em>Configuraciones</em>, seleccione <em>Configurar Konqueror</em>. En el grupo Navegación Web en el lado izquierdo, seleccione Proxy, luego seleccione la opción "Usar la configuración de proxy especificada manualmente" a la derecha.
ro: Din meniul <em>Setări</em>, selectați <em>Configurare Konqueror</em>. În Grup de Navigare Web din partea stângă, selectați Proxy, apoi selectați opțiunea „Utilizați proxy specificat manual configurare "din dreapta.
sv: Välj Konfigurera Konqueror från <em>Inställningsmenyn</em> Välj Proxy i Web Browsing-gruppen på vänster sida, välj sedan alternativet "Använd manuellt specificerad proxykonfiguration" till höger.

source: Konqueror Proxy Options
es: Opciones del Proxy de Konqueror
ro: Opțiuni proxy Konqueror
sv: Konqueror Proxy Inställningar

source: Enter 127.0.0.1 and port 4444 into the HTTP box. Enter 127.0.0.1 and port 4445 into HTTPS box. Enter <code>127.0.0.1,localhost</code> into the Exceptions box. Click Apply then OK to close the configuration window. <b>Note/Privacy tip:</b> Set the FTP proxy to the same settings as the HTTP proxy.
es: Introduzca 127.0.0.1 y puerto 4444 en el campo HTTP. Introduzca 127.0.0.1 y puerto 4445 en el campo HTTPS. Introduzca <code>127.0.0.1,localhost</code> en el campo Excepciones. Haga clic en Aplicar, y luego en Aceptar para cerrar la ventana de configuración. <b>Nota/Consejo de privacidad:</b> Configure el proxy FTP con las mismas configuraciones que el proxy HTTP.
ro: Introduceți 127.0.0.1 și port 4444 în caseta HTTP. Introduceți 127.0.0.1 și port 4445 în Caseta HTTPS. Introduceți <code>127.0.0.1, localhost</code> în caseta Excepții. Faceți clic pe Aplicare, apoi OK pentru a închide fereastra de configurare. <b>Indicație / Sfat de confidențialitate:</b> Setați proxy FTP la aceleași setări ca proxy HTTP.
sv: Fyll i 127.0.0.1 och port 4444 i HTTP-fältet. Fyll i 127.0.0.1 och port 4445 i HTTPS-fältet. Fyll i <code>127.0.0.1,localhost</code> i Undantagsrutan. Tryck på Verkställ och sen OK för att stänga konfigurationsfönstret. <b>Obs/integritetstips:</b> Sätt FTP-proxyn till samma inställningar som HTTP-proxyn.

source: Remember: I2P was not designed for creating proxies to the outer Internet. Instead, it is meant to be used as an internal network.
es: Recuerde: I2P no fue diseñado para crear proxies de salida al Internet. En su lugar está diseñado para ser usado como una red interna.
ro: Amintiți-vă: I2P nu a fost proiectat pentru crearea de proxy pe Internetul exterior. În schimb, este menit să fie utilizat ca rețea internă.
sv: Kom ihåg: I2P är inte designat för att skapa proxys till det vanliga internet. Istället är det avsett att användas som ett internt nätverk.

source: <p><b>The I2P project itself does not run any proxies to the Internet.</b> The only outproxy is a service from the privacy solutions project. Consider donating to them for a continued stable service. Higher bandwidth will increase with the founding of the organization. Maybe more outproxies too.</p> <a href="http://privacysolutions.no" target="_blank">http://privacysolutions.no</a>
es: <p><b>El propio proyecto I2P no mantiene ningún servidor proxy hacia Internet.</b> El único proxy de salida es un servicio del proyecto Privacy Solutions. Considere realizarles una donación para la continuidad y estabilidad del servicio. El ancho de banda se incrementará con el incremento de los fondos de la organización. Quizá también habrá más proxys de salida.</p> <a href="http://privacysolutions.no" target="_blank">http://privacysolutions.no</a>
ro: <p><b>Proiectul I2P în sine nu rulează proxy pe Internet.</b> Singurul rezultat este un serviciu din proiectul soluțiilor de confidențialitate. Luați în considerare donarea acestora pentru un serviciu continuu stabil. Lățimea de bandă mai mare va crește odată cu fondarea organizației. Poate și mai multe neplăceri.</p> <a href="http://privacysolutions.no" target="_blank">http://privacysolutions.no</a>
sv: <p><b>I2P projektet självt driver inga proxies ut mot internet.</b> Den enda utproxy som finns är en tjänst från projektet Privacy Solutions. Överväg gärna att donera till dem för en fortsatt stabil service. Högre bandvidd kommer att öka med donationer till organisationen. Kanske även fler outproxies.</p> <a href="http://privacysolutions.no" target="_blank">http://privacysolutions.no</a>

source: By default, I2P comes with two outproxies configured: <code>%(http)s</code> and <code>%(https)s</code>. Even the domain names are different, it's the same outproxy you hit. (multi-homed/keyed for better performance)
es: Por defecto, I2P viene configurado con dos proxys de salida: <code>%(http)s</code> y <code>%(https)s</code>. Aunque los nombres de dominio son diferentes, se alcanza el mismo proxy de salida. (residenciado/referenciado de forma múltiple para mejor rendimiento)
ro: În mod implicit, I2P vine cu două outproxies configurate:<code>%(http)s</code> și <code>%(https)s</code>. Chiar și numele de domeniu sunt diferite, este același outproxy pe care l-ai lovit. (multi-homed/keyed pentru o performanță mai bună)
sv: Som förval kommer I2P med två konfigurerade utproxies: <code>%(http)s</code> och <code>%(https)s</code>. Även domännamnen är annorlunda, det är samma utproxy du träffar (multi-homed/keyed för bättre prestanda)

source: Filtering is active on these outproxies (for example, mibbit and torrent tracker access is blocked). Eepsites that are accessible via .i2p addresses are also not allowed via the outproxies. As a convenience, the outproxy blocks ad servers.
es: El filtrado está activo en estos proxys de salida (por ejemplo, el acceso a Mibbit y a rastreadores (trackers) de torrents está bloqueado). Los eepsites, que son accesibles a través de direcciones .i2p, tampoco están permitidos a través de los proxys de salida. Convenientemente el proxy de salida bloquea los servidores de publicidad.
ro: Filtrarea este activă pe aceste rezultate (de exemplu, mibbit și torrent accesul trackerului este blocat). Eepsites care sunt accesibile prin adresele .i2p nu sunt permise nici prin outproxies. Ca comoditate, outproxy blochează serverele publicitare.
sv: Filtrering är aktiverat på dess utproxies (t ex är mibbit och torrentbevakare blockerade). Eepsidor som är tillgängliga via .i2p-adresser är inte heller tillåtnga via outproxies. Som en service blockerar utproxy också annonsservrar.

source: <a href="https://www.torproject.org">Tor</a> is good application to use as an outproxy to the Internet.
es: <a href="https://www.torproject.org">Tor</a> es una buena aplicación para usar como proxy de salida hacia Internet.
ro: <a href="https://www.torproject.org">Tor</a> este o aplicație bună pentru a fi folosit ca și outproxy pentru Internet.
sv: <a href="https://www.torproject.org">Tor</a> är ett bra program att använda som en utproxy till internet.

source: Glossary
es: Glosario
ro: Glosar
sv: Ordlista

source: This page lists often-used terminology when discussing I2P and cryptography.
es: Esta página muestra la terminología usada cuando se habla de I2P y cifrados.
ro: Această pagină listează terminologia folosită frecvent atunci când discută despre I2P și criptografie.
sv: Denhär sidan listar terminologi som ofta används när I2P och kryptografi diskuteras.

source: Hall Of Fame
es: Pódium

source: Big thanks go to the following people who have donated to I2P!
es: ¡Muchas gracias a las siguientes personas que han donado a I2P!
ro: Mulțumiri mari mergeți următorilor oameni care au donat I2P!
sv: Stort tack till följande personer som donerat till I2P!

source: If you have made a donation, please send an email to <a href="mailto:%(echelon)s">echelon</a> with your name or nick (and optionally homepage) so we can list you here.
es: Si ha hecho una donación , por favor envíe un email a <a href="mailto:%(echelon)s">echelon</a> con su nombre o nick (y opcionalmente su página web) para que podamos listarle aquí.
ro: Dacă ați făcut o donație, vă rugăm să trimiteți un e-mail la <a href="mailto:%(echelon)s">echelon</a> cu numele sau nick-ul (și, opțional, pagina principală), astfel încât să vă putem enumera aici.
sv: Om du har gjort en donation, skicka ett e-post till <a href="mailto:%(echelon)s">echelon</a> med ditt namn eller nick (och om du vill hemsida) så vi kan lista dig här.

source: Intro
es: Introducción
ro: introducere

source: The Invisible Internet Project
es: El proyecto de Internet Invisible
ro: Proiectul Internet Invizibil

source: I2P is an anonymous network, exposing a simple layer that applications can use to anonymously and securely send messages to each other. The network itself is strictly message based (a la <a href="%(ip)s">IP</a>), but there is a library available to allow reliable streaming communication on top of it (a la <a href="%(tcp)s">TCP</a>). All communication is end to end encrypted (in total there are four layers of encryption used when sending a message), and even the end points ("destinations") are cryptographic identifiers (essentially a pair of <a href="%(pke)s">public keys</a>).
es: I2P es una red anónima, que presenta una capa simple que las aplicaciones pueden usar para enviarse mensajes entre si de forma anónima y segura. La propia red está estrictamente basada en mensajes (a la <a href="%(ip)s">IP</a>), pero hay una librería disponible para permitir comunicación en streaming fiable sobre ella (a la <a href="%(tcp)s">TCP</a>). Toda comunicación está cifrada extremo a extremo (en total hay cuatro capas de cifrado usadas cuando se envía un mensaje), e incluso los puntos de los extremos ("destinos") son identificadores criptográficos (esencialmente un par de <a href="%(pke)s">claves públicas</a>).
ro: I2P este o rețea anonimă, care expune un strat simplu pe care aplicațiile îl pot sa folosesc pentru a-ți trimite mesaje în mod anonim și sigur. Rețeaua în sine este bazata strict pe mesaje (a la <a href="%(ip)s">IP</a>), dar există o bibliotecă disponibilă pentru a permite o comunicare în flux fiabilă deasupra acesteia (a la <a href="%(tcp)s">TCP</a>). Toate comunicările sunt criptate de la capăt la capăt (în total sunt patru straturi de criptare folosită la trimiterea unui mesaj) și chiar punctele finale („destinații”) sunt identificatori criptografici (în esență o pereche de <a href="%(pke)s">chei publice</a>).
sv: I2P är ett anonymt nätverk, som tillhandahåller ett enkelt lager, vilket program kan använda för att på ett säkert sätt skicka meddelande till varandra. Nätverket i sig självt är strikt meddelandebaserat (a la<a href="%(ip)s">IP</a>), men det finns ett bibliotek tillgängligt som tillåter strömmande kommunikation ovanpå detta lager (a la <a href="%(tcp)s">TCP</a>). All kommunikation krypteras ändpunkt till ändpunkt (sammanlagt används fyra lager krypteringar för att sända ett meddelande), och även slutpunkterna ("destinationerna") är kryptografiska identiteter (i huvudsak ett par <a href="%(pke)s">offentliga nycklar</a>).

source: How does it work?
es: ¿Cómo funciona?
ro: Cum funcționează?
sv: Hur fungerar det?

source: To anonymize the messages sent, each client application has their I2P "router" build a few inbound and outbound "<a href="%(tunnelrouting)s">tunnels</a>" - a sequence of peers that pass messages in one direction (to and from the client, respectively). In turn, when a client wants to send a message to another client, the client passes that message out one of their outbound tunnels targeting one of the other client's inbound tunnels, eventually reaching the destination. Every participant in the network chooses the length of these tunnels, and in doing so, makes a tradeoff between anonymity, latency, and throughput according to their own needs. The result is that the number of peers relaying each end to end message is the absolute minimum necessary to meet both the sender's and the receiver's threat model.
es: Para a anonimizar los mensajes enviados, cada aplicación cliente tiene su "ruter" I2P que crea unos cuantos <a href="%(tunnelrouting)s">túneles</a>" de entrada y salida - una secuencia de pares que pasan el mensaje en una dirección (hacia y desde el cliente, respectivamente ). A su vez, cuando un cliente quiere enviar un mensaje a otro cliente, el cliente envía ese mensaje a través de uno de sus túneles de salida hacia uno de los túneles de entrada del otro cliente, eventualmente alcanzando su destino.
ro: Pentru a anonimiza mesajele trimise, fiecare aplicație client are „routerul” I2P. construiți câteva „<a href="%(tunnelrouting)s">tunele</a>” de intrare și de ieșire - secvență de colegi care transmit mesaje într-o direcție (către și dinspre client, respectiv). La rândul său, când un client dorește să trimită un mesaj altui client, clientul transmite acel mesaj din unul dintre tunelurile sale de ieșire care vizează unul dintre tunelurile de intrare ale altui client, ajungând în cele din urmă la destinație. Fiecare participant la rețea alege lungimea acestor tuneluri și, în acest sens, face un schimb între anonimat, latență și randament în funcție de acestea nevoile proprii. Rezultatul este că numărul de colegi care se raportează la fiecare capăt la sfârșit mesajul este minimul absolut necesar pentru a îndeplini atât expeditorul, cât și mesajul modelul de amenințare al receptorului.
sv: För att anonymisera meddelanden som skickas, så får varje klient-program sin I2P-"router" att bygga några få ingående och utgående "<a href="%(tunnelrouting)s">tunnlar</a>" - en sekvens av noder som skickar meddelanden i en riktning (till och från klienten, respektive). När en klient vill skicka ett meddelande till en annan klient, så skickas meddelandet ut genom en av dess utgående tunnlar som är inriktad på en av den andra klientens ingående tunnlar, och till slut nås målet. Varje deltagare i nätverket väljer längden på dessa tunnlar och när det väljs så bestäms en balans mellan anonymitet, fördröjning och bandbredd enligt deras behov. Resultatet är att antalet noder som vidarebefodrar varje start-till-slut-meddelande är det absoluta minimum som krävs för att möta både avsändaren och mottagarens hotbild.
