Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: es, ro, sv

source: Contributors
es: Contribuidores
ro: Contribuitori
sv: Bidragare

source: fire2pe dev, console enhancements
es: Desarrollador de fire2pe, mejoras de la consola
ro: fire2pe dev, îmbunătățiri consolă
sv: fire2pe utvecklare, konsolförbättringar

source: desktopgui, dijjer port
es: entorno de escritorio, puerto dijjer

source: Debian/Ubuntu Packager and PPA maintainer
es: Encargado de los paquetes para Debian/Ubuntu y del PPA
sv: Debian/Ubuntu Packeterare och PPA underhållare

source: Routerconsole backend and UI work, website revamp, unit tests work
es: Trabajos en la consola del ruter y el interfaz gráfico, mejora de la web, y trabajos en los unit tests
sv: Routerkonsol backend och UI arbete, webbplats omskrivning, enhetstestsarbete

source: Help needed on many fronts!
es: Se necesita diversas formas de ayuda
ro: Ajutor necesar pe multe fronturi!
sv: Hjälp behövs på många fronter!

source: Past contributors
es: Participantes pasados
ro: Foști contribuitori
sv: Föredetta bidragare

source: I2PTunnel development, ministreaming library
es: Desarrollo de I2PTunnel, librería de ministreaming
ro: Dezvoltare I2PTunnel, bibliotecă ministreaming
sv: I2PTunnel utveckling, ministreaming biblioteket

source: Project lead, Syndie lead
es: Encargado del proyecto, encargado de Syndie
ro: Conducere de proiect, Syndie lead
sv: Projektledare, Syndie ledare

source: Project lead, Syndie lead, I2Phex, support guru
es: Encargado del proyecto, encargado de Syndie, I2Phex, soporte
ro: Lider de proiect, Syndie lead, I2Phex, guru de asistență
sv: Projektledare, Syndie ledare, I2Phex, support guru

source: iMule lead
es: Encargado de IMule
sv: iMule ledare

source: I2Phex work
es: Trabajo en I2Phex
sv: I2Phex arbete

source: Python SAM library, attack simulations
es: librería SAM en Python, simulaciones de ataques
ro: Python SAM biblioteca, simulări de atac
sv: Python SAM bibliotek, attacksimuleringar

source: i2pmail development
es: Desarrollo de i2pmail
ro: Dezvoltare i2pmail
sv: i2pmail utveckling

source: Syndie help
es: Ayuda de Syndie
ro: Ajutor Syndie
sv: Syndie hjälp

source: i2p mail,susimail and susidns apps
es: Mail de i2p, susimail y aplicaciones susidns
ro: i2p mail,susimail și susidns apps
sv: i2pmail, susimail och susidns appar

source: I2Phex (port of Phex to I2P)
es: I2Phex (versión de Phex para I2P)
ro: I2Phex (portul Phex la I2P)
sv: I2Phex (port av Phex till I2P)

source: addressbook,i2p-bt,syndie client
es: libreta de direcciones, i2p-bt,cliente syndie
ro: adresbook, i2p-bt, client syndie
sv: adressbok, i2p-bt, syndie klient

source: organize and develop the i2p-bt BitTorrent port
es: organización y desarrollo de la versión de Bittorrent i2p-bt
ro: organizează și dezvoltă portul BitTorrent i2p-bt
sv: organisera och utveckla i2p-bt BitTorrent porten

source: addressbook, i2p-bt, syndie client development
es: libreta de direcciones, i2p-bt, y desarrollo del cliente de syndie
ro: adresbook, i2p-bt, dezvoltarea clientului syndie
sv: adressbok, i2p-bt, syndie klient utveckling

source: encryption and signature routines, I2PIM
es: rutinas de cifrado y firma, I2P IM
ro: rutine de criptare și semnătură, I2PIM
sv: kryptering och signerings rutiner, I2PIM

source: SAM jython code, work on stasher (DHT) and v2v (VoI2P)
es: código jython de SAM, trabajo en stasher (DHT) y v2v (VoI2P)
ro: Cod SAM Jython, funcționează pe stasher (DHT) și v2v (VoI2P)
sv: SAM jyrhon kod, arbete på stasher (DHT) oxh v2v (VoI2P)

source: installer, systray, bogobot
es: instalador, bandeja de sistema, bogobot
ro: instalator, sistray, bogobot
sv: installerare, systray, bogobot

source: jbigi development, wiki migration, doc cleanup
es: desarrollo de jbigi, migración de la wiki, limpieza de la documentación
ro: dezvoltare jbigi, migrare wiki, curățare doc
sv: jbigi utveckling, wiki-migration, dokum. rensning

source: java debugging and client development on I2PTunnel and the router console
es: depuración de java y desarrollo del cliente en I2PTunnel y en la consola del ruter
ro: depanare java și dezvoltare client pe I2PTunnel și consola de router
sv: java felsökning och klient-utveckling för I2PTunnel och routerkonsolen

source: SAM perl module
es: Módulo perl de SAM
ro: Modul SAM perl
sv: SAM perl modul

source: i2psnark work
es: trabajo en i2psnark
ro: i2psnark de lucru
sv: i2psnark arbete

source: java cleanup
es: limpieza de java
ro: curățare java
sv: java rensning

source: docs. wiki migration
es: documentos, migración de la wiki
ro: Docs. migrare wiki
sv: dokum. wiki-migration

source: translations into French
es: traducción al francés
ro: traduceri în franceză
sv: översättning till Franska

source: C port of jcpuid
es: port en C de jcpuid
ro: C portul lui jcpuid
sv: C-port av jcpuid

source: C# SAM library, pants, fortuna integration
es: librería C# de SAM, integración de fortuna
ro: Biblioteca C # SAM, pants, integrare fortuna
sv: C# SAM bibliotek, pants, fortuna integration

source: i2p-bt tracker development
es: desarrollo del tracker i2p-bt
ro: Dezvoltare tracker i2p-bt
sv: i2p-bt bevakare utveckling

source: Console and website themes
es: Temas de la consola y la web
ro: Teme pentru console și site-uri web
sv: Konsol och webbplats tema

source: &hellip; and many others
es: &hellip; y muchas otros
ro: … și multe altele
sv: &hellip; och många andra

source: I2PCon 2015 was the first event of its kind. It had two short-term goals. First, to provide the general public with an event where knowledge about privacy could be obtained. Second, to further the I2P project and its community with technical discussions about cryptography, anonymity and I2P-centric topics.
es: I2PCon 2015 fue el primer evento de su clase. Tuvo dos metas a corto plazo. Primero, ofrecer al público general un evento donde se pudiera obtener conocimiento sobre privacidad. Segundo, para llevar más allá al proyecto I2P y su comunidad con debates técnicos sobre criptografía, anonimato y temas I2P-céntricos.
ro: I2PCon 2015 a fost primul eveniment de acest gen. Avea două obiective pe termen scurt. În primul rând, pentru a oferi publicului larg un eveniment în care ar putea fi obținute cunoștințe despre confidențialitate. În al doilea rând, promovarea proiectului I2P și a comunității sale cu discuții tehnice despre criptografie, anonimat și subiecte centrate pe I2P.
sv: I2PCon 2015 var det första evenemanget i sitt slag. Det hade två kortsiktiga målsättningar. För det första, att erbjuda allmänheten ett evenemang där man kunde få information om integritetsfrågor. För det andra, att främja projektet I2P och dess intressegrupp med tekniska diskussioner om kryptografi, anonymitet och ämnen som berör I2P.

source: A a larger and more long-term goal of this event was to build a commnutiy of privacy-conscious individuals. By connecting people who recognize the importance of privacy, we wanted to provide a forum where this community can grow.
es: Una meta mayor y a más largo plazo de este evento fue construir una comunidad de individuos con consciencia sobre privacidad. Al conectar personas que reconocen la importancia de la privacidad, quisimos ofrecer un foro donde esta comunidad pueda crecer.
ro: Un obiectiv mai mare și pe termen lung al acestui eveniment a fost construirea unei comuniune de persoane conștiente de confidențialitate. Prin conectarea oamenilor care recunosc importanța vieții private, am dorit să oferim un forum în care această comunitate să poată crește.
sv: Ett större och mer långsiktigt mål för evenemanget var att bygga en intressegrupp för integritetsmedvetna personer. Genom att koppla samman människor som inser vikten av integritet, ville vi tillhandahålla ett forum där denna grupp kan växa till.

source: The idea for this event was first spawned by our wonderful friends at <a href="https://torontocrypto.org/">Toronto Crypto</a>. The venue was provided by <a href="https://hacklab.to/">Hacklab.to</a>. The marketing was spearheaded by <a href="https://twitter.com/YrB1rd">@YrB1rd</a> and Siew. Without them this event would not have been possible.
es: La idea para este evento fue inicialmente concebida por nuestros maravillosos amigos de <a href="https://torontocrypto.org/">Toronto Crypto</a>. El punto de reunión fue proporcionado por <a href="https://hacklab.to/">Hacklab.to</a>. El marketing fue encabezado por <a href="https://twitter.com/YrB1rd">@YrB1rd</a> y Siew. Sin ellos este evento no habría sido posible.
ro: Ideea acestui eveniment a fost creată pentru prima dată de minunații noștri prieteni de la <a href="https://torontocrypto.org/">Toronto Crypto</a>. Locația a fost asigurată de <a href="https://hacklab.to/">Hacklab.to</a>. Marketingul a fost condus de <a href="https://twitter.com/YrB1rd">@YrB1rd</a> și Siew. Fără ei acest eveniment nu ar fi fost posibil.
sv: Idén till detta evenemang kom först från våra underbara vänner på <a href="https://torontocrypto.org/">Toronto Crypto</a>. Lokalen tillhandahölls av <a href="https://hacklab.to/">Hacklab.to</a>. Marknadsföringen leddes av <a href="https://twitter.com/YrB1rd">@YrB1rd</a> och Siew. Utan dem hade evenemanget inte varit möjligt att genomföra.

source: Slides and Video
es: Diapositivas y vídeo
ro: Diapozitive și video
sv: Presentationer och video

source: Slides are also available as an in-I2P torrent.
es: Las secuencias de diapositivas también están disponibles como un torrent en-I2P.
ro: Diapozitivele sunt de asemenea disponibile ca un torrent in-I2P.
sv: Presentationer finns också tillgängliga som i-I2P-torrent.

source: Note: Video links will be posted as they become available.
es: Nota: Los enlaces de vídeo se publicarán tan pronto como estén disponibles.
ro: Notă: Linkurile video vor fi postate pe măsură ce vor deveni disponibile.
sv: Observera: Videolönkar kommer postas när de blir tillgängliga.

source: Note that in-I2P torrents may also be available on the clearnet due to bridging by Vuze clients.
es: Observe que esos torrents en-I2P puede que también estén disponibles en la red abierta (clearnet) debido al establecimiento de puentes por los clientes Vuze.
ro: Rețineți că torrenturile in-I2P pot fi, de asemenea, disponibile pe clearnet din cauza împlinirii clienților Vuze.
sv: Notera att i I2P-torrenter också kan finnas tillgängliga på vanliga internet genom bryggning i Vuze-klienter.

source: Licenses
es: Licencias
ro: Licențe
sv: Licenser

source: All videos are by z3r0fox.
es: Todos los vídeos realizados por z3r0fox.
ro: Toate videoclipurile sunt realizate de z3r0fox.
sv: Alla videor är gjorda av z3r0fox.

source: License
es: Licencia
ro: Licență
sv: Licens

source: Slides by psi: Public domain.
es: Diapositivas realizadas por psi: Dominio público
ro: Diapozitive după psi: Domeniu public.
sv: Slides av psi: Public domain.

source: Slides by str4d and zzz:
es: Diapositivas realizadas por str4d y zzz:
ro: Glisează prin str4d și zzz:
sv: Slides av str4d och zzz:

source: Slides by others: Contact the author for license information.
es: Diapositivas realizadas por otros: Contacte con el autor para la información de licencia.
ro: Glisări de alții: contactați autorul pentru informații despre licență.
sv: Slides av andra: Kontakta upphovsmannen för licensinformation.

source: Speakers
es: Altavoces
ro: Oratori
sv: Talare

source: Colin Mahns has a strong interest in the use of anonymity and encryption technology to help preserve human rights in the digital age.
es: Colin Mahns tiene un fuerte interés en el uso de tecnología de información y cifrado para ayudar a preservar los derechos humanos en la era digital.
ro: Colin Mahns are un interes puternic în utilizarea tehnologiei de anonimat și criptare pentru a ajuta la păstrarea drepturilor omului în era digitală.
sv: Colin Mahns är mycket intresserad av anonymitets- och krypteringstekniker i syfte att bevara mänskliga rättigheter i en digital tidsålder.

source: David Dagon is a postdoc researcher at Georgia Tech focused on botnets, malware, network security, and DNS. His interest in I2P is centered on preserving user privacy, autonomous filtering, and anti-abuse.
es: David Dagon es un investigador de postdoctorado en Georgia Tech enfocado en botnets, malware, seguridad de red, y DNS. Su interés en I2P se centra en preservar la privacidad del usuario, el filtrado autónomo, y el anti-abuso.
ro: David Dagon este un cercetător postdoc la Georgia Tech axat pe botnets, malware, securitatea rețelei și DNS. Interesul său pentru I2P este centrat pe păstrarea vieții private a utilizatorilor, filtrarea autonomă și anti-abuz.
sv: David Dagon är postdoc-forskare vid Georgia Tech som fokuserar på botnets, malware, nätverkssäkerhet och DNS. Hans intresse i I2P kretsar kring bevarandet av anonymitet, automatisk filtrering och anti-abuse.

source: More info
es: Más información
ro: Mai multe informații
sv: Mer information

source: J is the head of Toronto Crypto.
es: J está al frente de Toronto Crypto.
ro: J este șeful Toronto Crypto.
sv: J leder Toronto Crypto.

source: Lance James is the founder of the Invisibile IRC Project, the predecessor to I2P, back in 2002. He founded his own cyber threat intelligence company in 2003. He's been focused on network security, malware research, and information security ever since. During 2011-2013, he was Director of Threat Intelligence for The Vigilant, which was acquired by Deloitte in 2013. He recently left Deloitte to do consulting through his company The James Group.
es: Lance James es el fundador del Invisible IRC Project, el predecesor de I2P, allá por 2002. Fundó su propia compañía de inteligencia de cyber amenazas en 2003. Desde entonces está enfocado en la seguridad de red, investigación de malware, y seguridad de la información. Durante 2011-2013, fue Director de Inteligencia en Amenazas para The Vigilant, que fue adquirida por Deloitte en 2013. Recientemente abandonó Deloitte para hacer consultoría a través de su compañía The James Group.
ro: Lance James este fondatorul Proiectului IRV Invisibile, predecesorul I2P, încă din 2002. Și-a fondat propria companie de informații despre amenințări cibernetice în 2003 De atunci, el este concentrat pe securitatea rețelei, cercetarea în domeniul malware și securitatea informațiilor. În perioada 2011-2013, a fost director al Threat Intelligence pentru The Vigilant, care a fost achiziționat de Deloitte în 2013. El a părăsit recent Deloitte să facă consultanță prin intermediul companiei sale The James Group.
sv: Lance James är grundaren av Invisible IRC Project, föregångaren till I2P 2002. Han grundade sitt eget företag i säkerhetsbranchen 2003. Han har fokuserat på nätverkssäkerhet malware-forskning, och informationssäkerhet sen dess. 2011-2013 var han 'Director of Threat Intelligence' för 'The Vigilant' som köptes upp av Deloitte 2013. Han lämnade nyligen Deloitte för bli konsult genom sitt eget företag 'The James Group'.

source: Nicholas D. is a member of Hacklab Toronto.
es: Nicholas D. es un miembro de Hacklab Toronto.
ro: Nicholas D. este membru al Hacklab Toronto.
sv: Nicholas D. är medlem av Hacklab Toronto.

source: Nicholas Johnston is a Professor of Information Security in Sheridan College's School of Applied Computing in the InfoSec Bachelor's degree program. His previous professional career was in digital forensics and investigations. He is also a contractor specializing in incident response. His research areas include secure software development and data analytics.
es: Nicholas Johnston es un Profesor de Seguridad de la Información en la Escuela de Computación Aplicada del Sheridan College en el programa de Bachelor's degree de InfoSec. Su carrera profesional previa fue en actividades forenses digitales e investigaciones. También es un contratista especializado en respuesta a incidentes. Sus áreas de investigación incluyen el desarrollo de software de seguridad y el análisis de datos.
ro: Nicholas Johnston este profesor de securitate a informațiilor la Școala de calcul aplicat a Colegiului Sheridan în programul de licență InfoSec. Cariera sa anterioară profesională a fost în criminalistică digitală și investigații. El este, de asemenea, un contractor specializat în răspunsul la incident. Domeniile sale de cercetare includ dezvoltarea sigură de software și analiza datelor.
sv: Nicholas Johnston är 'Professor of Information Security' vid Sheridan College's School of Applied Computing på programmet för InfoSec Bachelor's degree. Han har tidigare arbetat med digital bevisföring och utredning. Han är också konsult med tillbudshantering som specialitet. Hans forskningsfält inkluderar utveckling av säker programvara och data-analys.

source: Psi is an I2P developer.
es: psi es un desarrollador de I2P.
ro: Psi este un dezvoltator I2P.
sv: Psi är I2P-utvecklare.

source: Str4d is an I2P developer.
es: str4d es un desarrollador de I2P.
ro: Str4d este un dezvoltator I2P.
sv: Str4d är I2P-utvecklare.

source: Zzz is an I2P developer.
es: zzz es un desarrollador de I2P.
ro: Zzz este un dezvoltator I2P.
sv: Zzz är I2P-utvecklare.

source: Press
es: Prensa
ro: Apasă

source: Toronto Star article on Nicholas Johnston's talk
es: Artículo del Toronto Star sobre la charla de Nicholas Johnston.
ro: Articol din Toronto Star despre discuția lui Nicholas Johnston
sv: Toronto Stars artikel om Nichilas Johnstons föredrag

source: Day 1
es: Día 1
ro: Ziua 1
sv: Dag 1

source: Talk
es: Charla
ro: convorbire
sv: Tal

source: Presenter
es: Presentador
ro: Prezentator
sv: Talare

source: Video
es: Vídeo

source: Slides
es: Diapositivas
ro: Diapozitive
sv: Presentation

source: Day 2
es: Día 2
ro: Ziua 2
sv: Dag 2

source: Past years
es: Pasados años
ro: Anii trecuți
sv: Tidigare år

source: Future Performance Improvements
es: Mejoras futuras en el rendimiento
ro: Îmbunătățirile viitoare ale performanței
sv: Framtida Prestanda Förbättringar

source: August 2010
es: Agosto del 2010
sv: Augusti 2010

source: There are a few major techniques that can be done to improve the perceived performance of I2P - some of the following are CPU related, others bandwidth related, and others still are protocol related. However, all of those dimensions affect the latency, throughput, and perceived performance of the network, as they reduce contention for scarce resources. This list is of course not comprehensive, but it does cover the major ones that are seen.
es: Hay varias técnicas para mejorar el rendimiento de I2P - algunas tienen que ver con la CPU, otras con el ancho de banda y otras relacionadas con los protocolos. Sin embargo, todas estas mejoras afectan la latencia, la cantidad de datos enviados y el rendimiento de la red, mientras que reducen la competencia por los recursos escasos. Esta lista no está completa, pero abarca las más importantes que se conocen.
ro: Există câteva tehnici majore care pot fi făcute pentru a îmbunătăți percepția performanța I2P - unele dintre următoarele sunt legate de procesor, altele de lățimea de bandă , iar altele sunt în continuare legate de protocol. Cu toate acestea, toate acestea dimensiunile afectează latența, randamentul și performanța percepută a de rețea, deoarece reduc conținutul pentru resursele limitate. Această listă desigur nu este cuprinzătoare, dar le acoperă pe cele majore văzute.
sv: Det finns flera viktiga tekniker som kan utföras för att förbättra den uppfattade prestandan av I2P - vissa av de följande är CPU-relaterade, andra bandbredds-relaterade och andra är protokoll-relaterade. Dock, så påverkar alla de aspekterna fördröjning, kapacitet och uppfattad prestanda av nätverket, eftersom de minskar kampen om otillräckliga resurser. Denna listan är naturligtvis inte komplett, men den täcker de viktigaste som tekniker ses.

source: For past performance improvements see the <a href="%(history)s"> Performance History</a>.
es: Para ver las mejoras de rendimiento pasadas vea <a href="%(history)s"> historial de rendimiento</a>.
ro: Pentru îmbunătățiri ale performanței anterioare, consultați secțiunea <a href="%(history)s">Istoricul performanțelor</a>.
sv: För tidigare prestandaförbättringar se <a href="%(history)s">Prestanda Historiken</a>.

source: Better peer profiling and selection
es: Mejor selección de pares y sus perfiles.
ro: Mai bună profilare și selecție de la egal la egal
sv: Bättre nod-profilering och urval

source: Probably one of the most important parts of getting faster performance will be improving how routers choose the peers that they build their tunnels through - making sure they don't use peers with slow links or ones with fast links that are overloaded, etc. In addition, we've got to make sure we don't expose ourselves to a <a href="%(sybilpdf)s">Sybil</a> attack from a powerful adversary with lots of fast machines.
es: Probablemente, una de las partes más importantes para conseguir una mejora en el rendimiento será mejorar como los ruters elijen los pares a través de los que construyen los túneles - asegurándose que no utiliza pares con enlaces lentos o con enlaces rápidos pero sobrecargados. etc. Además, tenemos que asegurarnos que no nos exponemos a un ataque <a href="%(sybilpdf)s">Sybil</a> de un adversario con muchos recursos y con máquinas muy rápidas.
ro: Probabil una dintre cele mai importante părți ale obținerii unei performanțe mai rapide o va face să îmbunătățească modul în care routerele aleg colegii prin care își construiesc tunelurile - asigurându-vă că nu folosesc colegi cu legături lente sau cele cu legături rapide care sunt supraîncărcate etc. În plus, trebuie să ne asigurăm că nu ne expunem noi înșine la un atac <a href="%(sybilpdf)s">Sybil</a> de la un adversar puternic, cu o mulțime de mașini rapide.
sv: Troligvis kommer en av de viktigaste delarna för att få bättre prestanda vara att förbättra hur routrar väljer de noder de bygger sina tunnlar genom - genom att övertyga sig om att de inte använder noder med långsamma uppkopplingar eller sådana med snabba uppkopplingar men som är överbelastade, t.ex. Utöver det, så måste vi vara säkra på att vi inte utsätter oss själva för en <a href="%(sybilpdf)s">Sybil</a>-attack från en kraftfull motståndare med massor av snabba maskiner.

source: Network database tuning
es: Base de datos de la Red I2P
ro: Reglarea bazelor de date în rețea
sv: Inställning av nätverksdatas
