Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: es, ro, sv

source: With a limited set of destinations and a limited set of tunnels per destination, one I2P node only uses a limited set of tunnels across other I2P nodes. For example, if an I2P node is "hop1" in the small example above, we only see 1 participating tunnel originating from the client. If we sum up the whole I2P network, only a rather limited number of participating tunnels could be built with a limited amount of bandwidth all together. If one distributes these limited numbers across the number of I2P nodes, there is only a fraction of available bandwidth/capacity available for use.
es: Con un número limitado de destinaciones y un número limitado de túneles por destinación, un nodo I2P sólo utiliza un número limitado de túneles a través de otros nodos de I2P. Por ejemplo, si en el ejemplo de arriba un nodo I2P es "hop1", sólo tendríamos 1 túnel participante originado en el cliente. Si sumamos toda la red I2P, sólo un número limitado de túneles participantes pueden ser construidos con una cantidad limitada de ancho de banda. Si uno distribuye todo ese número limitado entre el número de nodos I2P, sólo hay disponible una fracción del ancho de banca/capacidad disponible para el uso.
ro: Cu un set limitat de destinații și un set limitat de tunele pe destinație, un nod I2P folosește doar un set limitat de tuneluri pe alte noduri I2P. De exemplu, dacă un nod I2P este "hop1" în exemplul mic de mai sus, vom vedea doar 1 tunel participant provenind de la client. Dacă însumăm întreaga rețea I2P, numai un număr destul de limitat de tunele participante ar putea fi construite cu o cantitate limitată de lățime de bandă împreună. Dacă se distribuie aceste numere limitate între numărul de noduri I2P, există doar o fracțiune de lățime de bandă / capacitate disponibilă pentru utilizare.
sv: Med ett begränsat set av destinationer och ett begränsat set av tunnlar per destination, använder en I2P-nod endast ett begränsat set tunnlar över andra I2P-noder. Om, t ex, en I2P-nod är "hopp1" i det lilla exemplet ovan, så ser vi endast 1 deltagande tunnel som utgår från klienten. Om vi summerar hela I2P-nätverket, så byggs bara ett ganska begränsat antal tunnlar med en begränsad bandbredd allt som allt. Om man distribuerar dessa begränsade mängder över antalet I2P-noder, så finns det bara en liten del av den existerande bandbredden tillgänglig.

source: To remain anonymous one router should not be used by the whole network for building tunnels. If one router does act as a tunnel router for ALL I2P nodes, it becomes a very real central point of failure as well as a central point to grab IPs and data from the clients. This is not good. I2P attempts to spread the load across a lot of I2P nodes because of this reason.
es: Para permanecer anónimos un ruter no debería usarse por toda la red para construir túneles, si un solo ruter funciona como túnel para TODOS los nodos de I2P se convierte en el centro de un problema, así como el punto central para obtener IPs e información de los clientes. Esto no es bueno. I2P intenta repartir la carga a través de muchos nodos I2P justo por esta razón.
ro: Pentru a rămâne anonim un router nu trebuie utilizat de întreaga rețea pentru construirea de tuneluri. Dacă un router acționează ca un router tunel pentru TOATE nodurile I2P, acesta devine un punct central de eșec foarte real, precum și un punct central pentru a apuca IP-uri și date de la clienți. Acest lucru nu este bun. I2P încearcă să răspândească încărcarea pe o mulțime de noduri I2P din acest motiv.
sv: För att förbli anonym bör en router inte användas av hela nätverket för att bygga tunnlar. Om en router verkligen är router för ALLA I2P-noder, så kommer den även att bli en mycket påtaglig centralpunkt för krascher, liksom en centralpunkt för att samla IP och data från klienter. Detta är inte bra. I2P försöker sprida lasten över många olika I2P-noder av just det här skälet.

source: Another point is the full mesh network. Each connection hop-hop utilizes one TCP or UDP connection on the I2P nodes. With 1000 connections, one sees 1000 TCP connections. That is quite a lot and some home and small office routers (DSL, cable,..) only allow a small number of connections (or just go mad if you use more than X connections). I2P tries to limit these connections to be under 1500 per UDP and per TCP type. This limits the amount of traffic routed across your I2P node as well.
es: Otro punto a tener en cuenta es la red mesh completa. Cada conexión salto-a-salto utiliza una conexión TCP o UDP en los nodos de I2P. Con 1000 conexiones uno ve 1000 conexiones TCP. Eso es bastante y algunos ruters domésticos o de oficina (DSL, cable...) sólo permiten un cierto número de conexiones ( o simplemente se vuelven locos si se usa un número mayor de X conexiones). I2P intenta limitar esas conexiones por debajo de 1500 para UDP y TCP. Esto limita también la cantidad de tráfico enrutado a través de su nodo I2P.
ro: Un alt punct este rețeaua de plasă completă. Fiecare conexiune hop-hop utilizează o conexiune TCP sau UDP pe nodurile I2P. Cu 1000 de conexiuni, se vede 1000 de conexiuni TCP. Acest lucru este destul de mult, iar unele routere de birou pentru casă și pentru birouri mici (DSL, cablu, ..) permit doar un număr mic de conexiuni (sau pur și simplu înnebuniți dacă utilizați mai mult de conexiuni X). I2P încearcă să limiteze aceste conexiuni pentru a fi sub 1500 per UDP și per tip TCP. Acest lucru limitează și cantitatea de trafic parcursă pe nodul dvs. I2P.
sv: En annan punkt är det kompletta meshnätverket. Varje anslutning hip-hopanvänder en TCP eller UDP-anslutning på I2P-noden. Med 1000 anslutningar ser man 1000 TCP-anslutningar. Det är en hel del och vissa hem- och 'small-office'-routrar (DSL, kabel,...) tillåter bara ett litet antal (eller blir tokiga om du använder mer än X anslutningar). I2P försöker begränsa dessa anslutningar till under 1500 per UDP och per TCP-typ. Detta begränsar även trafikmängden som routas över din I2P.

source: In summary, I2P is very complex and there is no easy way to pinpoint why your node is not used. If your node is reachable and has a bandwidth setting of >128 kbyte/sec shared and is reachable 24/7, it should be used after some time for participating traffic. If it is down in between, the testing of your I2P node done by other nodes will tell them: you are not reachable. This blocks your node for at least 24h on other nodes. So, the other nodes which tested you as down will not use your node for 24h for building tunnels. This is why your traffic will be lower after a restart/shutdown for a minimum of 24h.
es: En resumen, I2P es muy complejo y no hay una forma fácil de determinar con precisión por qué su nodo no se utiliza. Si su ruter es accesible y tiene mas de 128 kbyte/sec de ancho de banda compartido y está accesible 24/7, debería ser usado después de algún tiempo de tener tráfico participante. Si no esta activo siempre, las pruebas de otros nodos sobre su nodo I2P le dirá: no está accesible. Esto bloquea su nodo por al menos 24h para los otros nodos. Por lo cual los otros nodos que han testado su nodo cuando estaba caído no utilizarán su nodo para construir túneles durante 24h. Esto es por lo que su tráfico será menor después de un reinicio/apagado por lo menos durante 24h.
ro: În rezumat, I2P este foarte complex și nu există o modalitate ușoară de a identifica de ce nodul dvs. nu este utilizat. Dacă nodul dvs. este accesibil și are o setare de lățime de bandă> 128 kbyte / sec partajată și este accesibil 24/7, ar trebui să fie utilizat după ceva timp pentru traficul participant. Dacă este în intervalul intermediar, testarea nodului dvs. I2P efectuată de alți noduri le va spune: nu sunteți accesibil. Acest lucru vă blochează cel puțin nodul 24h pe alte noduri. Deci, celelalte noduri care v-au testat în jos nu vă vor folosi nodul pentru 24 de ore pentru construirea de tuneluri. Acesta este motivul pentru care traficul dvs. va fiți mai jos după o repornire / oprire pentru cel puțin 24 de ore.
sv: Sammanfattningsvis är I2P väldigt komplext och det finns inget enkelt sätt att precisera varför din nod inte används. Om din nod är nåbar och har en bandbreddsinställning av mer än 128 kbyte/s delat och är nåbar 24/7, skulle den efter någon tid användas för deltagande trafik. Om den är nere emellanåt så kommer testandet av din I2P-nod av andra noder att tala om för dem att du inte är nåbar. Detta blockerar din nod under minst 24 timmar för andra noder. Så de andra noderna som testade dig när du var nere kommer inte att använda din nod på 24 timmar för att bygga tunnlar. Detta är skälet till att din trafik kommer att vara lägre i minst 24 timmar efter en omstart/nedstängning.

source: Also: other I2P nodes needs to know your I2P router to test it for reachability and capacity. It takes time for other nodes to get known to your node. It will be faster if you use I2P and build more tunnels, e.g. use a torrent or www for some time.
es: Además: otros nodos I2P necesitan conocer su ruter I2P para probar la accesibilidad y capacidad. Toma tiempo que otros nodos lleguen a conocer su nodo. Será más rápido si utiliza I2P y crea más túneles, por ejemplo usando torrents o webs i2p durante algún tiempo.
ro: De asemenea: alte noduri I2P trebuie să-ți cunoască routerul I2P pentru a-l testa pentru disponibilitate și capacitate. Este nevoie de timp pentru ca alte noduri să fie cunoscute de nodul dvs. Va fi mai rapid dacă utilizați I2P și construiți mai multe tuneluri, de ex. folosiți un torrent sau www de ceva timp.
sv: Dessutom: andra I2P-noder behöver känna till din I2P-router för att testa för nåbarhet och kapacitet. Det tar tid för andra noder att get sig till känna för din nod. Det kommer att gå snabbare om du använder I2P och bygger mer tunnlar, t ex använda torrent eller www under en tid.

source: Performance Improvements
es: Mejoras en el rendimiento
ro: Imbunatatiri ale performantei
sv: Prestandaförbättringar

source: For possible future performance improvements see <a href="%(future)s">Future Performance Improvements</a>.
es: Para futuras mejoras en el rendimiento vea <a href="%(future)s">mejoras futuras en el rendimiento</a>.
ro: Pentru posibile îmbunătățiri viitoare a performanței, a se vedea <a href="%(future)s">Îmbunătățirile viitoare ale performanței</a>.
sv: För möjliga framtida prestandaförbättringar see <a href="%(future)s">Framtida Prestandaförbättringar</a>

source: Firefox Profile for Windows
ro: Profil Firefox pentru Windows

source: If you are using Windows, the recommended way of accessing I2P is using the <a href='%(profile)s'>Firefox profile</a>.
ro: Dacă utilizați Windows, modalitatea recomandată de accesare a I2P este folosirea <a href='%(profile)s'>Profil Firefox</a>.

source: If you do not wish to use that profile or are not on Windows, you need to configure your browser yourself. Read below on how to that.
ro: Dacă nu doriți să utilizați profilul respectiv sau nu sunteți pe Windows, trebuie să configurați-vă singur browserul. Citiți mai jos despre cum să faceți asta.

source: Instructions for Firefox 57 and above:
ro: Instrucțiuni pentru Firefox 57 și versiuni superioare:

source: From the Menu button in the top right, select <em>Preferences</em>. Scroll down until you see the <em>Network Proxy</em> section, as shown in the screenshot below. Click on <em>Settings</em>
ro: Din butonul Meniu din dreapta sus, selectați <em>Preferințe</em>. Derulați în jos până când vedeți secțiunea <em>Proxy de rețea</em>, așa cum se arată în secțiunea captură de ecran de mai jos. Faceți clic pe <em>Setări</em>

source: Firefox57 Network Options
ro: Opțiuni de rețea Firefox57

source: In the <em>Connection Settings</em> pop-up, select <em>Manual proxy configuration</em>. Set both the HTTP and SSL Proxy to address <code>127.0.0.1</code> with port <code>4444</code> as shown in the following screenshot.
ro: În fereastra pop-up <em>Setări de conexiune</em>, selectați <em>Proxy manual configurare</em>. Setați atât adresele HTTP cât și proxy SSL la adresă <code>127.0.0.1</code> cu portul <code>4444</code> așa cum se arată în cele ce urmează captură de ecran.

source: Firefox57 Connection Settings
ro: Firefox57 Setări de conectare

source: Firefox57 Connection Settings
ro: Setări de conexiune Firefox57

source: I2P is a project made completely by spare time enthusiasts. But a big project like I2P is not made from software alone, several servers, domain registrations, and coffees need to be paid to get a great result. People all over the world donated to I2P reach the state it is in currently. Here we do track those who gave us a name to be published in a I2P hall of fame.
ro: I2P este un proiect realizat complet de pasionații de timp liber. Dar un proiect mare de genul I2P nu este creat doar din software, trebuie să fie necesare mai multe servere, înregistrări de domenii și cafele fii plătit pentru a obține un rezultat excelent. Oamenii din întreaga lume doneaza I2P ajung la starea în care se află în prezent. Aici îi urmărim pe cei care ne-au dat un nume pentru a fi publicat într-o sală de faimă I2P.

source: The unsorted list of I2P donors in 15 years of I2P history,starting march 2004 til march 2019.
ro: Lista nesortată a donatorilor I2P în 15 ani de istorie I2P, începând cu martie 2004 până în martie 2019.

source: <a href="%(link)s">Fireside With Lei - Episode 18: Lance James. Success, Failures, Grief and Buddhism.</a> <a href="%(archive)s">(archive.org)</a> <a href="%(mp3)s">(mp3)</a> Robert Lei, December 31, 2018
ro: <a href="%(link)s">Fireside With Lei - Episodul 18: Lance James. Succes, eșecuri, durere și budism</a>. <a href="%(archive)s">(Archive.org)</a> <a href="%(mp3)s">(Mp3)</a> Robert Lei, 31 decembrie 2018

source: <a href="%(mhatta)s">Articles by I2P contributor Masayuki Hatta on Medium.com</a> 2019
ro: <a href="%(mhatta)s">Articole ale colaboratorului I2P Masayuki Hatta pe Medium.com</a> 2019

source: <a href="%(ctrl)s">Enabling both .onion and .i2p routing with Proxy Auto-Configuration</a> Daniel Aleksandersen, February 7 2019
ro: <a href="%(ctrl)s">Activarea traseului .onion și .i2p cu configurarea automată a proxy-ului</a> Daniel Aleksandersen, 7 februarie 2019

source: <a href="%(meeh)s">A curated list by I2P contributor meeh of I2P implementations, libraries, resources, projects, and shiny things</a> 2019
ro: <a href="%(meeh)s">O listă tratată de către contribuitorul I2P meeh al implementărilor I2P, bibliotecilor, resurselor, proiectelor și lucruri strălucitoare</a> 2019

source: Donations treasurer
ro: Trezorier de donații

source: manage donations
ro: gestionați donațiile

source: Compensation manager
ro: Director de compensare

source: Compensation management
ro: Managementul compensațiilor

source: The first conference dedicated to I2P was held in Toronto on August 15-16, 2015. See the link below for more information and links to slides and videos.
ro: Prima conferință dedicată I2P a avut loc la Toronto în perioada 15-16 august 2015. Consultați linkul de mai jos pentru mai multe informații și link-uri către diapozitive și videoclipuri.
