Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: es, ro, sv

source: Native math
es: Matemática nativa.
ro: Matematica nativă
sv: Native matte

source: implemented
es: implementado
ro: implementat
sv: implementerad

source: When I last profiled the I2P code, the vast majority of time was spent within one function: java.math.BigInteger's <a href="%(modpow)s">modPow</a>. Rather than try to tune this method, we'll call out to <a href="%(gmp)s">GNU MP</a> - an insanely fast math library (with tuned assembler for many architectures). (<i>Editor: see <a href="%(jbigi)s">NativeBigInteger for faster public key cryptography</a></i>)
es: Cuando examiné el código de I2P, la mayoría del tiempo se gastaba dentro de una función: java.math. En el <a href="%(modpow)s">modPow</a> de BigInteger. En vez de intentar mejorar este método, usamos <a href="%(gmp)s">GNU MP</a> - una librería matemática realmente rápida (con el ensamblador mejorado para varias arquitecturas). (<i>Editor: vea <a href="%(jbigi)s">NativeBigInteger for faster public key cryptography</a></i>)
ro: Când am profilat ultima dată codul I2P, marea majoritate a timpului a fost petrecută în interiorul singure funcției: java.math.BigInteger <a href="%(modpow)s">modPow</a>. În loc să încercați să ajustați această metodă, vă vom adresa <a href="%(gmp)s">GNU MP</a> - o bibliotecă matematică rapidă (cu montator reglat pentru multe arhitecturi). (<i>Editor: vezi <a href="%(jbigi)s">NativeBigInteger pentru o criptografie rapidă cu cheie publică</a></i>)
sv: När jag senast profilerade I2P koden, så spenderades majoriteten av tiden inom en funktion i java.math.BigInteger, <a href="%(modpow)s">modPow</a>. Hellre än att försöka finjustera denna metod, så kallar vi ut till <a href="%(gmp)s">GNU MP</a> - ett galet snabbt matte-bibliotek (med finjusterad assembler för många arkitekturer). (<i>Redaktör: se <a href="%(jbigi)s">NativeBigInteger för snabbare asymmetrisk kryptografi</a></i>)

source: ugha and duck are working on the C/JNI glue code, and the existing java code is already deployed with hooks for that whenever its ready. Preliminary results look fantastic - running the router with the native GMP modPow is providing over a 800&#37; speedup in encryption performance, and the load was cut in half. This was just on one user's machine, and things are nowhere near ready for packaging and deployment, yet.
es: ugha y duck están trabajando en el código de C/JNI, y el código java actual está desplegado con los 'ganchos' para cuando esté listo. Los resultados preliminares se ven fantásticos - ejecutar el ruter con GMP modPow nativo proporciona un aumento de velocidad del 800&#37; , y la carga se ha reducido ala mitad. Y esto sólo ha sido en la maquina de un solo usuario, y las cosas están casi listas para ser empaquetado y distribuidas.
ro: ugha și rața lucrează la codul de clei C/JNI și la codul java existent este deja implementat cu hooks pentru asta, ori de câte ori este gata. Rezultate preliminare arata fantastic - rularea routerului cu modPow-ul GMP autohton este de acord o viteză de 800&#37 în performanțele de criptare, iar sarcina a fost redusă la jumătate. Acest a fost doar pe mașina unui utilizator, iar lucrurile nu sunt aproape gata de ambalare și implementare, încă.
sv: ugha och duck arbetar på C/JNI länkkod, och den existerande javakoden är redan utrustad med hooks för det när det är färdigt. Preliminära resultat ser fantastiska ut - att köra routern med native GMP modPow ger över 800&#37; hastighetsökning i krypteringsprestanda, och lasten halverades. Detta var bara på en användares maskin, och saker och ting är långt ifrån färdiga för paketering och leverans än.

source: Garlic wrapping a "reply" LeaseSet
es: Envoltura Garlic par un LeaseSet de "respuesta"
ro: Usturoiul înfășurând un „răspuns” LeaseSet
sv: Lök inpackning av "svars" LeaseSet

source: implemented but needs tuning
es: implementado pero necesita mejoras
ro: implementat, dar are nevoie de reglare
sv: implementerad men behöver finjustering

source: This algorithm tweak will only be relevant for applications that want their peers to reply to them (though that includes everything that uses I2PTunnel or mihi's ministreaming lib):
es: Esta mejora en el algoritmo sólo afectará a las aplicaciones que quieran que los pares les responda (esto incluye todo lo que use I2PTunnel o la mini-librería de streaming de mihi):
ro: Acest tweak al algoritmului va fi relevant numai pentru aplicațiile care își doresc colegii să le răspundă (deși asta include tot ceea ce folosește I2PTunnel sau Mihi's ministreaming lib):
sv: Denna algoritm-finjustering kommer bara vara relevant för program som vill att deras noder ska svara dem (men det inkluderar allting som använder I2PTunnel eller mihis ministreaming-bibliotek):

source: Previously, when Alice sent Bob a message, when Bob replied he had to do a lookup in the network database - sending out a few requests to get Alice's current LeaseSet. If he already has Alice's current LeaseSet, he can instead just send his reply immediately - this is (part of) why it typically takes a little longer talking to someone the first time you connect, but subsequent communication is faster. Currently - for all clients - we wrap the sender's current LeaseSet in the garlic that is delivered to the recipient, so that when they go to reply, they'll <i>always</i> have the LeaseSet locally stored - completely removing any need for a network database lookup on replies. This trades off a large portion of the sender's bandwidth for that faster reply. If we didn't do this very often, overall network bandwidth usage would decrease, since the recipient doesn't have to do the network database lookup.
es: Anteriormente, cuando Alice enviaba un mensaje a Bob, cuando Bob respondía tenía que hacer una búsqueda en la base de datos de la red - enviando varias peticiones para obtener el LeaseSet de Alice. Si ya tiene el LeaseSet de Alice, puede simplemente enviar su respuesta inmediatamente - esto es (en parte) por qué normalmente toma más tiempo conectar con alguien por primera vez, pero posteriormente es más rápido. Actualmente - para todos los clientes - empaquetamos el LeaseSet del remitente en el mensaje Garlic que es enviado al destinatario, para que cuando vaya a responder, <i>siempre</i> tendrán el LeaseSet almacenado localmente - eliminando completamente la necesidad de hacer búsquedas en la base de datos de la red al responder. Esto ahorra un gran ancho de banda al remitente. Si no hiciésemos las búsquedas a menudo, el uso de ancho de banda disponible global de la red descendería, ya que el destinatario no necesita hacer la búsqueda en la base de datos de la red.
ro: Anterior, când Alice i-a trimis lui Bob un mesaj, când Bob i-a răspuns că trebuie să facă o căutare în baza de date a rețelei - trimitând câteva solicitări pentru a primi Alice LeaseSet curent. Dacă are deja actualul LeaseSet al lui Alice, poate în schimb sa trimite imediat răspunsul său - acesta este (o parte din) de ce durează de obicei puțin sa vorbeasca cu cineva prima dată când vă conectați, dar ulterior comunicarea este mai rapidă. În prezent - pentru toți clienții - ne împachetăm actualul LeaseSet al expeditorului în usturoiul care este livrat destinatarului, astfel încât, atunci când vor răspunde, vor avea întotdeauna LeaseSet local stocat - eliminând complet orice nevoie pentru o căutare în baza de date a rețelei la răspunsuri. Aceasta tranzacționează o mare parte din lățimea de bandă a expeditorului pentru acea răspuns mai rapidă. Dacă nu am face acest lucru foarte des, utilizarea totală a lățimii de bandă a rețelei ar scădea, deoarece destinatarul nu trebuie să efectueze căutarea în baza de date a rețelei.
sv: Tidigare, när Alice skickade Bob ett meddelande, när Bob svarade var han tvungen att göra ett uppslag i nätverksdatabasen - genom att skicka ut några förfrågningar för att få Alices nuvarande LeaseSet. Om han redan har Alices nuvarande LeaseSet, så kan han istället bara skicka sitt svar direkt - detta är (en del av) varför det typiskt tar lite längre tid att prata med någon första gången du ansluter, men efterföljande kommunikation är snabbare. För nuvarande - för alla klienter - packar vi in avsändarens nuvarande LeasSet i lök:en som skickas till mottagaren, så att när dom svarar, så kommer dom <i>alltid</i> ha ett LeaseSet sparat lokalt - vilket totalt förebygger alla behov av förfrågningar till nätverksdatabasen vid svar. Detta byter bort en stor del av avsändarens bandbredd för ett snabbare svar. Om vi inte gjorde detta ofta, så hade den genomsnittliga nätverksbandbredd minska, eftersom mottagaren inte måste göra förfrågningen mot nätverksdatabasen.

source: For unpublished LeaseSets such as "shared clients", this is the only way to get the LeaseSet to Bob. Unfortunately this bundling every time adds almost 100&#37; overhead to a high-bandwidth connection, and much more to a connection with smaller messages.
es: Para los LeaseSets no publicados como los "clientes compartidos", esta es la única forma de enviar el LeaseSet a Bob. Desafortunadamente al construirlo cada vez se añade al menos un 100&#37; de sobre gastos en una red con mucho ancho de banda, y mucho más en una red con mensajes más pequeños.
ro: Pentru LeaseSet-urile nepublicate, cum ar fi „clienții partajați”, aceasta este singura cale de a lua LeaseSet la Bob. Din păcate, acest pachet se adaugă de fiecare dată aproape 100% deasupra unei conexiuni cu lățime mare de bandă și mult mai mult o conexiune cu mesaje mai mici.
sv: För icke publicerade LeaseSets som "Delade Klienter", är detta enda sättet att få LeaseSettet til Bob. Olyckligtvis ökar denna packetering varje gång nästan 100&#37; overhead till en high-bandwidth anslutning, och mycket mer till anslutningar med mindre meddelanden.

source: Changes scheduled for release 0.6.2 will bundle the LeaseSet only when necessary, at the beginning of a connection or when the LeaseSet changes. This will substantially reduce the total overhead of I2P messaging.
es: Los cambios programados para la versión 0.6.2 empaquetará el LeaseSet sólo cuando sea necesario, al iniciar la conexión o cuando el LeaseSet cambie. Esto reducirá sustancialmente el gasto delos mensajes I2P.
ro: Modificările programate pentru lansarea 0.6.2 vor include pachetul LeaseSet doar atunci când este necesar, la începutul unei conexiuni sau când se schimbă LeaseSet. Acest lucru va reduce substanțial cheltuielile totale ale mesajelor I2P.
sv: Förändringar som är planerade för release 0.6.2 kommer skicka med LeaseSet bara när det behövs, vid början av en anslutning eller när LeaseSet:et förändras. Detta kommer rejält minska den totala overheaden av I2P meddelanden.

source: More efficient TCP rejection
es: Más eficiencia en las caídas y errores del protocolo TCP
ro: Respingerea TCP mai eficientă
sv: Effektivare TCP avslag

source: At the moment, all TCP connections do all of their peer validation after going through the full (expensive) Diffie-Hellman handshaking to negotiate a private session key. This means that if someone's clock is really wrong, or their NAT/firewall/etc is improperly configured (or they're just running an incompatible version of the router), they're going to consistently (though not constantly, thanks to the banlist) cause a futile expensive cryptographic operation on all the peers they know about. While we will want to keep some verification/validation within the encryption boundary, we'll want to update the protocol to do some of it first, so that we can reject them cleanly without wasting much CPU or other resources.
es: En este momento, todas las conexiones TCP hacen todas sus validaciones de pares ('peer') depués de ir a través de la negociación ('handshaking') Diffie-Hellman completa (cara) para negociar una clave de sesión privada. Esto significa que si el reloj de alguien está bastante desajustado, o sus NAT/firewall/etc no están apropiadamente configurados (o sólo están ejecutando una versión incompatible del router), van a causar consistentemente (aunque no constantemente, gracias a la lista de excluidos) una operación criptográfica cara y futil sobre todos los pares que conozcan. Aunque querremos mantener parte de las verificaciones/validaciones dentro del ámbito del cifrado, querremos actualizar el protocolo para que haga algunas de ellas primero, de forma que podamos rechazarlos limpiamente sin desperdiciar mucha CPU u otros recursos.
ro: În momentul de față, toate conexiunile TCP fac toate validarea colegilor lor după parcurgerea strângerii de mână completă (scumpă) a lui Diffie-Hellman pentru a negocia o cheia sesiunii private. Aceasta înseamnă că dacă ceasul cuiva este într-adevăr greșit sau NAT / firewall / etc sunt necorespunzător configurate (sau pur și simplu rulează o versiunea incompatibilă a routerului), vor merge în mod constant (deși nu în mod constant, datorită listei ban)) provoca o criptografie inutilă scumpă operațiune pe toți colegii despre care știu. În timp ce vom dori să păstrăm unele verificari/validari în limita de criptare, vom dori să actualizăm protocol pentru a face o parte din acesta mai întâi, astfel încât să le putem respinge curat fără a irosi mult procesor sau alte resurse.
sv: Alla TCP-anslutningar gör för tillfället all sin nod-validering efter att hela det fulla (dyra) Diffie-Hellman handslaget gått genom för att förhandla fram en privat sessionsnyckel. Detta betyder att om någons klocka är väldigt fel eller deras NAT/brandvägg/etc är felaktigt inställd (eller om de bara kör en icke-kompatibel version av routern), så kommer de konsekvent (men inte konstant, tack vare svartlistan) orsaka meningslösa dyra kryptografiska beräkningar på alla noder de känner till. Eftersom vi vill behålla en del verifiering/validering inom krypteringsgränsen, så kommer vi vilja uppdatera protokollet så att en del görs först, så att vi kan avvisa dom direkt, utan att slösa massor av CPU-tid eller andra resurser.

source: Adjust the tunnel testing
es: Ajustar las pruebas de túneles
ro: Reglați testarea tunelului
sv: Justera tunneltestning

source: Rather than going with the fairly random scheme we have now, we should use a more context aware algorithm for testing tunnels. e.g. if we already know its passing valid data correctly, there's no need to test it, while if we haven't seen any data through it recently, perhaps its worthwhile to throw some data its way. This will reduce the tunnel contention due to excess messages, as well as improve the speed at which we detect - and address - failing tunnels.
es: En vez de usar el esquema bastante aleatorio que tenemos ahora, deberíamos usar un algoritmo más consciente del contexto para probar los túneles. Por ejemplo, si ya conocemos sus datos de validación correctamente, no hay necesidad de probarlo, mientras que si no hemos visto ningún dato recientemente, quizás valga la pena enviarle algunos datos. Esto reducirá el parón en los túneles debido a un número de mensajes excesivo, a la vez que mejorará la velocidad en la detección de los túneles fallidos.
ro: În loc să mergem cu schema destul de aleatoare pe care o avem acum, ar trebui să folosim un algoritm mai conștient de context pentru testarea tunelurilor. de exemplu. dacă deja îl știm trecând corect datele valide, nu este nevoie să le testăm, deși dacă nu Am văzut recent date prin ea recent, poate merită să aruncă unele date cale. Acest lucru va reduce contenția tunelului din cauza excesului de mesaje, precum și îmbunătățește viteza cu care detectăm - și adresăm - tunelurile care nu au reușit.
sv: Istället för att använda den ganska slumpmässiga metod vi har nu, borde vi använda en mer kontext-medveten algoritm för att testa tunnlar. T.ex. om vi redan vet att den skickar giltig data korrekt, så finns inget behov för att testa den, men om vi inte har sett någon data genom den nyligen, så är det kanske meningsfullt att kasta lite data åt dess håll. Detta kommer minska tunnel tvister från överflödiga meddelanden, men även förbättra hastigheten med vilken vi hittar - och löser - misslyckade tunnlar.

source: Persistent Tunnel / Lease Selection
es: Túneles persistentes / Selección del LeaseSet
ro: Selecția persistentă a tunelului / închirierii
sv: Beständig Tunnel / Lease-val

source: Outbound tunnel selection implemented in 0.6.1.30, inbound lease selection implemented in release 0.6.2.
es: La selección del túnel de salida se implementó en la versión 0.6.1.30, la selección del túnel de entrada se implementó en la versión 0.6.2.
ro: Selecția tunelului de ieșire implementată în 0.6.1.30, selecție de închiriere la intrare implementat în versiunea 0.6.2.
sv: Utåtgående tunnel-val implementerades i 0.6.1.30, inåtgående lease-val implementerades i release 0.6.2.

source: Selecting tunnels and leases at random for every message creates a large incidence of out-of-order delivery, which prevents the streaming lib from increasing its window size as much as it could. By persisting with the same selections for a given connection, the transfer rate is much faster.
es: Seleccionar los túneles y leases aleatoriamente para cada mensaje crea un gran problema con el envío de mensajes desordenados, lo cual evita que la librería de streaming pueda aumentar el tamaño de su 'ventana' tanto como podría. Al persistir con las mismas selecciones para una conexión determinada, la velocidad de transferencia es mucho mayor.
ro: Selectarea tunelurilor și închirierilor la întâmplare pentru fiecare mesaj creează un număr mare incidența livrării în afara comenzii, ceea ce împiedică difuzarea fluxului crescându-și dimensiunea ferestrei cât a putut. Prin persistarea cu aceleași selecții pentru o conexiune dată, rata de transfer este mult mai rapidă.
sv: Att välja tunnlar och lease slumpmässigt för varje meddelande skapare en stor förekomst av meddelande som kommer fram ur ordning, vilket förhindrar streaming biblioteket från att öka dess fönsterstorlek så mycket som det kunde gjort. Genom att bibehålla samma val för en given anslutning, är överföringshastigheten mycket snabbare.

source: Compress some data structures
es: Comprimiendo algunas estructuras de datos
ro: Compresează unele structuri de date
sv: Komprimera vissa datastruktuerer

source: The I2NP messages and the data they contain is already defined in a fairly compact structure, though one attribute of the RouterInfo structure is not - "options" is a plain ASCII name = value mapping. Right now, we're filling it with those published statistics - around 3300 bytes per peer. Trivial to implement GZip compression would nearly cut that to 1/3 its size, and when you consider how often RouterInfo structures are passed across the network, that's significant savings - every time a router asks another router for a networkDb entry that the peer doesn't have, it sends back 3-10 RouterInfo of them.
es: Los mensajes I2NP y los datos que contiene están ya definidos en una estructura bastante compacta, aunque un atributo de la estructura del RouterInfo no lo está - "options" está en texto ASCII plano en el formato nombre = valor. Ahora mismo, se está rellenado con estadísticas publicadas - alrededor de 3300 bytes por par. Implementar la compresión GZip, lo cual es trivial, ahorraría 1/3 de su tamaño, y cuando se considera las veces que se pasan las estructuras RouterInfo a través de la red, es un gran ahorro - cada vez que un ruter pregunta a otro por una entrada en la netDb que el par no posee, envía de vuelta de 3-10 estructuras RouterInfo.
ro: Mesajele I2NP și datele pe care le conțin sunt deja definite într-un mod echitabil structură compactă, deși un atribut al structurii RouterInfo nu este - "opțiuni" este un nume ASCII simplu = maparea valorilor. Momentan, îl completăm cu acele statistici publicate - în jur de 3300 de octeți pe egal. Trivial la implementarea compresiei GZip ar reduce aproape la 1/3 dimensiunea sa și când ia în considerare cât de des sunt trecute structurile RouterInfo prin rețea, adică economii semnificative - de fiecare dată când un router solicită unui alt router o rețeaDb intrare pe care parerea nu o are, trimite înapoi 3-10 RouterInfo din ele.
sv: I2NP meddelanden och den datande innehåller är redan definierad i en ganska kompakt struktur, men ett av attributen i RouterInfo-strukturen är inte det - "alternativ" är ett vanligt ASCII-namn = värde-mappning. Just nu fyller vi det med den publicerade statistiken - runt 3300 byte per nod. Det är enkelt att implementera GZip-komprimering vilket skulle minska det till 1/3 av sin storlek och när du tänker på hur ofta RouterInfo-strukturer skickas över nätverket, så är det viktiga besparingar - varje gång en router frågar en annan router efter något ur nätverksdatabasen som mottagaren inte har, så skickar den tillbaka 3-10 RouterInfos till förfrågaren.

source: Update the ministreaming protocol
es: Actualizar el protocolo ministreaming
ro: Actualizați protocolul ministreaming
sv: Uppdatera ministreaming protokollet

source: replaced by full streaming protocol
es: reemplazar por un protocolo full streaming
ro: înlocuit cu protocolul de streaming complet
sv: ersatt av fullt streaming protokoll
