Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: es, ro, sv

source: <a href="%(link)s">I2P - Still alive! (pdf)</a> <a href="%(link2)s">(video)</a> echelon, 32C3 (You Broke the Internet Assembly), Hamburg, December 28, 2015
es: <a href="%(link)s">I2P - ¡Aún vive! (pdf)</a> <a href="%(link2)s">(vídeo)</a> echelon, 32C3 (You Broke the Internet Assembly), Hamburgo, 28 de diciembre de 2015
ro: <a href="%(link)s">I2P - Încă viu! (Pdf)</a> <a href="%(link2)s">(video)</a> echelon, 32C3 (You Broke the Internet Assembly), Hamburg, 28 decembrie 2015

source: Replacing Weary Crypto: Upgrading the I2P network with stronger primitives <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, Real World Crypto, Stanford, January 8, 2016
es: Reemplazar criptografía débil: Actualizar la red I2P con primitivas más robustas. <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d (desarrollador), Real World Crypto, Stanford, 8 de enero de 2016
ro: Înlocuirea Weary Crypto: Modernizarea rețelei I2P cu primitive mai puternice <a href="%(link)s">(Pdf)</a> <a href="%(link2)s">(ODP)</a> str4d, Crypto Real World, Stanford, 8 ianuarie 2016

source: Onions and Garlic: the protocols of I2P <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d, COMPSCI 460: Computer Networking, University of Wisconsin Whitewater, February 17, 2016
es: Onion y Garlic: Los protocolos de I2P <a href="%(link)s">(pdf)</a> <a href="%(link2)s">(odp)</a> str4d (desarrollador), COMPSCI 460: Computer Networking, University of Wisconsin Whitewater, 17 de febrero de 2016
ro: Ceapă și usturoi: protocoalele I2P <a href="%(link)s">(Pdf)</a> <a href="%(link2)s">(ODP)</a> str4d, COMPSCI 460: Rețele de calculatoare, Universitatea din Wisconsin Whitewater, 17 februarie 2016

source: The Invisible Internet Project - An overview and guide to the technology <a href="%(link)s">(mp4)</a> <a href="%(link2)s">(webm)</a> Andrew Savchenko (bircoph), FOSDEM, Brussel, February 4, 2018
es: The Invisible Internet Project - Una panorámica y guía por la tecnología <a href="%(link)s">(mp4)</a> <a href="%(link2)s">(webm)</a> Andrew Savchenko (bircoph), FOSDEM, Bruselas, 4 de febrero de 2018
ro: Proiectul de internet invizibil - o imagine de ansamblu și un ghid al tehnologiei <a href="%(link)s">(Mp4)</a> <a href="%(link2)s">(Webm)</a> Andrew Savchenko (bircoph), FOSDEM, Brussel, 4 februarie 2018

source: Tutorials
es: Tutoriales
ro: Tutoriale
sv: Guider

source: <a href="%(link)s">I2P Windows Tutorial</a> (Youtube Video) This guide will show you how to install I2P in Windows XP. By <a href="http://telecomix.org/">Telecomix</a>
es: <a href="%(link)s">I2P Windows Tutorial</a> (Youtube Video) Esta guía le mostrará cono instalar I2P en Windows. Por <a href="http://telecomix.org/">Telecomix</a>
ro: <a href="%(link)s">Tutorial Windows I2P</a> (Video YouTube) Acest ghid vă va arăta cum să instalați I2P în Windows XP. De <a href="http://telecomix.org/">Telecomix</a>
sv: <a href="%(link)s">I2P Windows Guide</a> (Youtube Video) Denhär guiden kommer visa dig hur man installerar I2P i Windows XP. Av <a href="http://telecomix.org/">Telecomix</a>

source: <a href="%(link)s">I2P Debian Tutorial</a> (Youtube Video) This will guide you through how to install I2P on a Debian Linux System. By <a href="http://telecomix.org/">Telecomix</a>
es: <a href="%(link)s">I2P Debian Tutorial</a> (Vídeo en Youtube) Esta guía le mostrará como instalar I2P en sistemas basados en Debian. Por <a href="http://telecomix.org/">Telecomix</a>
ro: <a href="%(link)s">I2P Debian Tutorial</a> (Video YouTube) Acest lucru vă va ghida cum să instalați I2P pe un sistem Linux Debian. De <a href="http://telecomix.org/">Telecomix</a>
sv: <a href="%(link)s">I2P Debian Guide</a> (Youtube Video) Denhär guiden kommer visa dig hur man installerar I2P på ett Debian Linux System. Av <a href="http://telecomix.org/">Telecomix</a>

source: <a href="%(link)s">How to set up anonymous site in I2P</a> (Youtube Video) How to set up an anonymous web site in I2P. By <a href="http://telecomix.org/">Telecomix</a>
es: <a href="%(link)s">How to set up anonymous site in I2P</a> (Vídeo en Youtube) Como configurar una web anónima en I2P. Por <a href="http://telecomix.org/">Telecomix</a>
ro: <a href="%(link)s">Cum să configurați un site anonim în I2P</a> (Video YouTube) Cum să configurați un site web anonim în I2P. De <a href="http://telecomix.org/">Telecomix</a>
sv: <a href="%(link)s">Hur du sätter igång en anonym webbplats i I2P</a> (Youtube Video) Hur du sätter igång en anonym webbplats i I2P. Av <a href="http://telecomix.org/">Telecomix</a>

source: <a href="%(link)s">I2P Tutorial Mac OS X</a> (Youtube Video) A tutorial on how to run i2p on Mac OS X and how to connect to irc.telecomix.i2p. By <a href="http://telecomix.org/">Telecomix</a>
es: <a href="%(link)s">I2P Tutorial Mac OS X</a> (Vídeo en Youtube) Un tutorial de como ejecutar I2P en os X y como conectar a irc.telecomix.i2p. Por <a href="http://telecomix.org/">Telecomix</a>
ro: <a href="%(link)s">I2P Tutorial Mac OS X</a> (Video YouTube) Un tutorial despre cum să rulați i2p pe Mac OS X și cum să vă conectați la irc.telecomix.i2p. De <a href="http://telecomix.org/">Telecomix</a>
sv: <a href="%(link)s">I2P Tutorial Mac OS X</a> (Youtube Video) En guide om hur man kör I2P på Mac OS X och hur man ansluter till irc.telecomix.i2p. Av <a href="http://telecomix.org/">Telecomix</a>

source: <a href="%(link)s">Felix Atari explains the basic principles of I2P</a> (Youtube Video) Agent Felix Atari of the Telecomix Crypto Munitions Bureau. By <a href="http://telecomix.org/">Telecomix</a>
es: <a href="%(link)s">Felix Atari explains the basic principles of I2P</a> (Vídeo en Youtube) Agent Felix Atari of the Telecomix Crypto Munitions Bureau. Por <a href="http://telecomix.org/">Telecomix</a>
ro: <a href="%(link)s">Felix Atari explică principiile de bază ale I2P</a> (Video YouTube) Agent Felix Atari al Biroului de muniții Crypto Telecomix. De <a href="http://telecomix.org/">Telecomix</a>
sv: <a href="%(link)s">Felix Atari förklarar de grundläggande principerna i I2P</a> (Youtube Video) Agent Felix Atari från Telecomix Crypto Munitions Bureau. Av <a href="http://telecomix.org/">Telecomix</a>

source: <a href="%(link)s">How to get onto I2P, the anonymous P2P Darknet (Windows Install)</a> (Youtube Video) This tutorial shows how to install and configure software needed to access I2P.
es: <a href="%(link)s">How to get onto I2P, the anonymous P2P Darknet (Windows Install)</a> (Vídeo en Youtube) Esta guía muestra como instalar y configurar las aplicaciones necesarias para acceder a I2P.
ro: <a href="%(link)s">Cum să accesați I2P, anonimul P2P Darknet (instalare Windows)</a> (Video YouTube) Acest tutorial arată cum să instalați și să configurați software-ul necesar pentru a accesa I2P.
sv: <a href="%(link)s">How kommer in i I2P, det anonyma P2P Darknet (Windows-installation)</a> (Youtube-video) Den här guiden visar du du installerar och konfigurerar mjukvaran som behövs för att komma åt I2P.

source: <a href="%(link)s">How to connect to I2P</a> (Youtube Video) How to install I2P on Ubuntu.
es: <a href="%(link)s">How to connect to I2P</a> (Vídeo en Youtube) Como instalar I2P en Ubuntu.
ro: <a href="%(link)s">Cum să vă conectați la I2P</a> (Video YouTube) Cum se instalează I2P pe Ubuntu.
sv: <a href="%(link)s">Hur du ansluter till I2P</a> (Youtube Video) Hur du installerar I2P på Ubuntu.

source: <a href="%(link)s">Installing the I2P darknet software in Linux</a> (Video) Adrian Crenshaw. January 2011
es: <a href="%(link)s">Installing the I2P darknet software in Linux</a> (Vídeo) Adrian Crenshaw. Enero 2011
ro: <a href="%(link)s">instalarea software-ului darknet I2P în Linux</a> (Video) Adrian Crenshaw. Ianuarie 2011
sv: <a href="%(link)s">Installera I2P darknet mjukvara i Linux</a> (Video) Adrian Crenshar. Januari 2011

source: <a href="%(link)s">Short garlic routing animation</a> (Youtube Video) Adrian Crenshaw.
es: <a href="%(link)s">Short garlic routing animation</a> (Vídeo en Youtube) Adrian Crenshaw.
ro: <a href="%(link)s">Animatie scurta de rutare a usturoiului</a> (Video YouTube) Adrian Crenshaw.
sv: <a href="%(link)s">Kort lök-routing animation</a> (Youtube Video) Adrian Cranshar.

source: Articles and Interviews
es: Artículos y entrevistas
ro: Articole și interviuri
sv: Artiklar och Intervjuer

source: Lance James (0x90) Interviewed by DistributedCity <a href="%(link1)s">Part 1</a> <a href="%(link2)s">Part 2</a> July 26, 2002.
es: Lance James (0x90) entrevistado por DistributedCity <a href="%(link1)s">Parte 1</a> <a href="%(link2)s">Parte 2</a> 26 de julio de 2002.
ro: Lance James (0x90) Intervievat de DistributedCity <a href="%(link1)s">Partea 1</a> <a href="%(link2)s">Partea 2</a> 26 iulie 2002.
sv: Lance James (0x90) intervjuad av DistributedCity <a href="%(link1)s">Del 1</a> <a href="%(link2)s">Del 2</a> 26 juli 2002.

source: Lance James (0x90) Interviewed by El País (original in Spanish) <a href="%(link)s">English translation</a> October 31, 2002.
es: Lance James (0x90) entrevistado por El País (original en español) <a href="%(link)s">Traducción al inglés</a> 31 de octubre de 2002.
ro: Lance James (0x90) Intervievat de El País (original în spaniolă) <a href="%(link)s">traducere in engleza</a> 31 octombrie 2002.
sv: Lance James (0x90) intervjuad av El País (originalet på spanska) <a href="%(link)s">Engelsk översättning</a> 31 oktober 2002.

source: <a href="%(link)s">2003 Business Week article referencing invisiblenet</a> September 14, 2003.
es: <a href="%(link)s">Artículo de 2003 del Business Week refiriéndose invisiblenet (red invisible)</a> 14 de septiembre de 2003.
ro: <a href="%(link)s">2003 Business Week articol care face referire la invisiblenet</a> 14 septembrie 2003.

source: <a href="%(link)s">Netzwelt.de article about being anonymous in the Internet</a> (German) November 2007.
es: <a href="%(link)s">Artículo del Netzwelt.de sobre como permanecer anónimos en Internet</a> (Alemán) Noviembre 2007.
ro: <a href="%(link)s">Articolul despre Netzwelt.de despre a fi anonim pe Internet</a> (Limba germana) Noiembrie 2007.
sv: <a href="%(link)s">Netzwelt.de artikel om att vara anonym på internet</a> (Tyska) November 2007.

source: <a href="%(link)s">zzz interviewed by gulli.com</a> March 2009 <a href="%(german)s">German translation</a>
es: <a href="%(link)s">zzz entrevistado por gulli.com</a> Marzo de 2009 <a href="%(german)s">Traducción al alemán</a>
ro: <a href="%(link)s">zzz intervievat de gulli.com</a> Martie 2009 <a href="%(german)s">Traducere din germană</a>
sv: <a href="%(link)s">zzz intervjuades av gulli.com</a> Mars 2009 <a href="%(german)s">Tysk översättning</a>

source: <a href="%(mp3)s">zzz interviewed on the InfoSec Daily Podcast Ep. 454 (mp3)</a> August 18, 2011 (link dead, seeded inside I2P at <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=14336">postman's tracker</a>)
es: <a href="%(mp3)s">zzz entrevistado en el InfoSec Daily Podcast Ep. 454 (mp3)</a> 18 de agosto de 2011 (enlace muerto, diseminado dentro de I2P por el <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=14336">tracker de postman</a>)
ro: <a href="%(mp3)s">zzz intervievat pe InfoSec Daily Podcast Ep. 454 (mp3)</a> 18 august 2011 (link mort, însămânțat în I2P la <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=14336">trackerul poștașului</a>)

source: <a href="%(link)s">I2P - Anonymity for the Masses</a>, Jonathan Cox, November 11, 2011.
es: <a href="%(link)s">I2P - Anonymity for the Masses</a>, Jonathan Cox, Noviembre 11, 2011.
ro: <a href="%(link)s">I2P - Anonimatul maselor</a>, Jonathan Cox, 11 noiembrie 2011.
sv: <a href="%(link)s">I2P - Anonymitet för Massorna</a>, Jonathan Cox, November 11, 2011.

source: <a href="%(mp3)s">zzz and Lance James interviewed on the InfoSec Daily Podcast Ep. 596 (mp3)</a> February 16, 2012 (link dead, seeded inside I2P at <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=15905">postman's tracker</a>)
es: <a href="%(mp3)s">zzz y Lance James entrevistados en el InfoSec Daily Podcast Ep. 596 (mp3)</a> 16 de febrero de 2012 (enlace muerto, diseminado dentro de I2P por el <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=15905">tracker de postman</a>)
ro: <a href="%(mp3)s">zzz și Lance James au intervievat pe InfoSec Daily Podcast Ep. 596 (mp3)</a> 16 februarie 2012 (link mort, însămânțat în I2P la <a href="http://tracker2.postman.i2p/index.php?view=TorrentDetail&id=15905">trackerul poștașului</a>)

source: <a href="%(mp3)s">Jeff and Str4d interviewed on the Brakeing Down Security Podcast Ep. 2015-010 (mp3)</a> Part 1, February 28, 2015
es: <a href="%(mp3)s">Jeff y Str4d (desarrolladores) entrevistados en el Brakeing Down Security Podcast Ep. 2015-010 (mp3)</a> Parte 1, 28 de febrero de 2015
ro: <a href="%(mp3)s">Jeff și Str4d au intervievat pe podcast-ul Brakeing Down Security Ep. 2015-010 (mp3)</a> Partea 1, 28 februarie 2015

source: <a href="%(mp3)s">Jeff and Str4d interviewed on the Brakeing Down Security Podcast Ep. 2015-011 (mp3)</a> Part 2, March 6, 2015
es: <a href="%(mp3)s">Jeff y Str4d (desarrolladores) entrevistados en el Brakeing Down Security Podcast Ep. 2015-011 (mp3)</a> Parte 2, 6 de marzo de 2015
ro: <a href="%(mp3)s">Jeff și Str4d au intervievat pe podcast-ul Brakeing Down Security Ep. 2015-011 (mp3)</a> Partea 2, 6 martie 2015

source: Other
es: Otro
ro: Altceva
sv: Andra

source: I2P mentioned in Netflix's "House of Cards" Season 2 Episode 2, February 14, 2014
es: I2P es mencionado en el episodio 2 de la temporada 2 de la serie "House of Cards" de Netflix, 14 de febrero de 2014.
ro: I2P menționat în „Casa cărților” din Netflix, sezonul 2 episodul 2, 14 februarie 2014
sv: I2P omnämnt i Netflix "House of Cards" Säsong 2 Episode 2, 14 februari 2014

source: I2P Project Members
es: Miembros del proyecto I2P
ro: Membri proiect I2P
sv: I2P Projekt Medlemmar

source: We are a small group of people spread around several continents, working to advance different aspects of the project and discussing the design of the network. <a href="%(volunteer)s">Get involved!</a>
es: Somos un pequeño grupo de personas repartidas por varios continentes, trabajando para mejorar diferentes aspectos del proyecto y discutir el diseño de la red.<a href="%(volunteer)s">¿Únete!</a>
ro: Suntem un grup mic de oameni răspândiți pe mai multe continente, lucrând pentru avansați diferite aspecte ale proiectului și discutând despre proiectul reţea. <a href="%(volunteer)s">Implicati-va!</a>
sv: Vi är en liten grupp av personer spridda runt om flera kontinenter, som arbetar för att förbättra olika aspekter av projektet och diskutera designen av nätverket. <a href="%(volunteer)s">Hjälp till!</a>

source: Admin
es: Administradores
ro: Administrator

source: Project Manager
es: Director del proyecto
ro: Administrator proiect
sv: Projekthanterare

source: point of contact of last resort
es: contacto como último recurso
ro: punctul de contact al ultimului recurs
sv: kontaktpunkt som sista utväg

source: Treasurer
es: Tesorero
sv: Bankör

source: PR manager
es: Administrador PR
ro: Administrator PR
sv: PR-hanterare

source: press contact, manages public relations and affairs
es: contacto con la prensa, relaciones públicas y negocios
ro: contact de presă, gestionează relațiile și afacerile publice
sv: presskontakt, hanterar offentliga relationer

source: Assistant PR manager
es: Subdirector de relaciones públicas
ro: Asistent PR manager
sv: Assisterande PR manager

source: Public speaking, public relations assistance
es: Auxiliar de relaciones públicas y portavocía
ro: În vorbire în public, asistență pentru relații publice
sv: Offentliga anföranden, public relations assistans

source: Public relations assistance
es: Asistente de relaciones públicas
ro: Asistență în relații publice
sv: PR-assistans

source: <a href="http://%(forum)s/">Forum</a> admin
es: Administrador del <a href="http://%(forum)s/">Foro</a>
ro: Administrator <a href="http://%(forum)s/">forum</a>

source: manage the public user forum
es: administrador del foro público
ro: gestionați forumul utilizatorilor publici
sv: hantera det offentliga användarforumet

source: Download mirrors admin
es: Administrador (admin) de servidores réplica de descargas
ro: Descarcă oglinzi admin
sv: Nedladdningsspeglar admin

source: manage the mirrors for the download files
es: administra los servidores réplica (mirrors) para los ficheros de descarga
ro: gestiona oglinzile pentru fișierele de descărcare
sv: hantera speglarna för de nedladdningsfilerna

source: Website mirrors admin
es: Administrador (admin) de sitios web réplica
ro: Site-ul web reflectă admin
sv: Admin för webbplatsspeglar

source: vacant
es: vacante
sv: ledig

source: manage the mirrors for the website
es: administra los servidores réplica (mirrors) para este sitio web
ro: gestiona oglinzile pentru site-ul web
sv: hantera speglarna för webbplatsen

source: <a href="%(monotone)s">Monotone</a> guru
es: Gurú de <a href="%(monotone)s">Monotone</a>
ro: Profesor <a href="%(monotone)s">monoton</a>

source: manage the public monotone repositories
es: administrador de los repositorios públicos de monotone
ro: gestionați depozitele monotone publice
sv: hantera de offentliga monotone förråden

source: Packager; Linux
es: Empaquetador; Linux
sv: Packeterare, Linux

source: Linux (Debian/Ubuntu) distribution packager
es: Mantenimiento de paquetes para distribuciones Linux (Debian/Ubuntu)
ro: Pachetar de distribuție Linux (Debian / Ubuntu)
sv: Linux (Debian/Ubuntu) distrubutions packeterare

source: Packager; Windows
es: Empaquetador; Windows
sv: Packeterare, Windows

source: Windows installer packager
es: Paquetes instaladores para Windows
ro: Pachetar de instalare Windows
sv: Paketerare för Windows installerare

source: Release Manager
es: Administrador de versiones
ro: Manager de versiuni
sv: Releaserhanterare

source: Builds and signs the releases
es: Compila y firma los paquetes
ro: Construiește și semnează lansările
sv: Bygger och signerar releaser

source: Release Manager Alternates
es: Sustitutos del administrador de versiones
ro: Eliberare supleantă Manager

source: Backup release managers
es: Hacer copia de seguridad de los administradores de versiones
ro: Managerii de versiuni de rezervă

source: Tails Maintainer
es: Mantenedor de Tails

source: Maintain the I2P package in Tails
es: Mantiene el paquete I2P en Tails
ro: Mențineți pachetul I2P în Tails

source: CI admin
es: Administrador de CI

source: Maintain the Continuous Integration infrastructure
es: Mantiene la infraestructura de integración continua (Continuous Integration)
ro: Menținerea infrastructurii de integrare continuă

source: Reseed admin
es: Administrador de la resiembra
sv: Återdistribueringsadministratör

source: Monitors, advises and recruits reseed hosts
es: Supervisa, asesora y adquiere hosts de resiembra
ro: Monitorizează, sfătuiește și recrutează gazdele cercetate
sv: Övervakare, rådgör och rekryterar ǻterdistribueringsvärdar

source: Security expert
es: Experto en seguridad
ro: Expert de securitate
sv: Säkerhetsexpert

source: threat model / crypto expert
es: modelos de amenazas / experto en cifrados
ro: model de amenințare / expert cripto
sv: hotbild / kryptoexpert

source: Manage the project bug tracker
es: Administrar el sistema de seguimiento de errores del proyecto
ro: Gestionați trackerul de bug de proiect
sv: Hantera projektets felspårare

source: manage the public project webservers
es: administrador de los servidores web públicos del proyecto
ro: gestiona webservers-urile de proiecte publice
sv: hantera det offentliga projektets webbserver

source: Translation admins
es: Admins (administradores) de traducción
ro: Administratori de traducere
sv: Admin för översättningar

source: User Advocate
es: Defensor del usuario
ro: Advocate utilizator
sv: Användares förespråkare

source: gather, prioritize, advocate for user needs
es: recogida, priorización y enfocado en las necesidades de los usuarios
ro: aduna, prioritizează, pledează pentru nevoile utilizatorilor
sv: samla, prioritera, förespråkare för användarbehov

source: Web Designer
es: Diseñador web
sv: Webbdesigner

source: manage the public project website content design
es: administrar el diseño de la web del proyecto
ro: gestionați designul conținutului site-ului public al proiectului
sv: hantera den offentliga projektetwebbplatsens design

source: <a href="%(website)s">Webserver</a> admin
es: Administración del <a href="%(website)s">Webserver</a>
ro: Administrator <a href="%(website)s">webserver</a>
sv: <a href="%(website)s">Webbserver</a> admin

source: <a href="%(website)s">Website</a> admin
es: administración de la <a href="%(website)s">Website</a>
ro: Administratorul <a href="%(website)s">site-ului</a>
sv: <a href="%(website)s">Webbplats</a> admin

source: manage the public project website content
es: administrador del contenido del la web del proyecto
ro: gestionează conținutul site-ului public al proiectului
sv: hantera den offentliga projektwebbplatsens innehåll

source: News Admin
es: Administrador de noticias
ro: Știri Admin
sv: Nyhetsadmin

source: manage router console news feed
es: administra la suscripción (feed) de noticias de la consola del router I2P
ro: gestionați fluxul de știri al consolei routerului
sv: hantera routerkonsolens nyhetsflöde

source: Backup News Admin
es: Administrador de respaldo de noticias

source: manage the backup news feed
es: administra la suscripción (feed) de respaldo de noticias
ro: gestionați fluxul de știri de rezervă
sv: hantera backup för nyhetsmatningen

source: Director of passion
es: Director de pasión
ro: Director al pasiunii
sv: Direktör för passion

source: community motivator
es: Motivador de la comunidad
ro: motivator al comunității
sv: community motiverare

source: Dev
es: Desarrolladores
sv: Utvecklare

source: Core Lead
es: Encargado del núcleo
ro: Conducere principală
sv: Kärn ledare

source: lead dev for the SDK and router
es: encargado del SDK y del router
ro: lead dev pentru SDK și router
sv: ledare utvecklare för SDK och router

source: <a href="http://%(postman)s/">I2P mail</a> lead
es: Encargado de <a href="http://%(postman)s/">I2P mail</a>
ro: Conducere <a href="http://%(postman)s/">mail I2P</a>
sv: <a href="http://%(postman)s/">I2P e-post</a> ledare

source: organize and develop the i2p mail system
es: organiza y desarrolla el sistema de mail de I2P
ro: organizarea și dezvoltarea sistemului de mail i2p
sv: organisera och utveckla e-post systemet för I2P

source: <a href="http://%(bote)s/">I2P-Bote</a> lead
es: Encargado de <a href="http://%(bote)s/">I2P-Bote</a>
sv: <a href="http://%(bote)s/">I2P-Bote</a> ledare

source: I2P-Bote plugin
es: Complemento de I2P-Bote
ro: Pluginul I2P-Bote
sv: I2P-Bote-insticksmodul

source: I2Phex Gnutella client
es: cliente de I2Phex Gnutella
sv: I2Phex Gnutella klient

source: Maintains the integrated Bittorrent client
es: Mantiene el cliente Bittorrent integrado
ro: Menține clientul Bittorrent integrat
sv: Underhåller den integrerade BitTorrent klienten

source: Syndie development
es: Desarrollo de Syndie
sv: Syndie utveckling

source: Susimail lead
es: Encargado de Susimail
sv: Susimail ledare

source: Susimail development
es: Desarrollo de Susimail
sv: Susimail utveckling

source: Android lead
es: Encargado de Android
sv: Android-ledare

source: Android development
es: Desarrollo de Android
sv: Android-utveckling

source: Console
es: Consola
ro: Consolă
sv: Konsol

source: Router console HTML/CSS design
es: Diseño del HTML/CSS de la consola del ruter
sv: Routerkonsol HTML/CSS design

source: SAM maintainer
es: Encargado de SAM
sv: SAM underhållare

source: Translators
es: Traductores
ro: Traducători
sv: Översättare

source: many many people!
es: ¡mucha mucha gente!
ro: multi multi oameni!
sv: många många människor!
