Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: es, ro, sv

source: The first time a client wants to contact another client, they make a query against the fully distributed "<a href="%(netdb)s">network database</a>" - a custom structured <a href="%(dht)s"> distributed hash table (DHT)</a> based off the <a href="%(kad)s">Kademlia algorithm</a>. This is done to find the other client's inbound tunnels efficiently, but subsequent messages between them usually includes that data so no further network database lookups are required.
es: La primera vez que un cliente quiere contactar con otro cliente, ambos hacen una consulta contra la, completamente distribuida, "<a href="%(netdb)s">base de datos de red</a>" - una <a href="%(dht)s">tabla de hash distribuida (DHT)</a> con estructura adaptada basada en el <a href="%(kad)s">algoritmo Kademlia</a>. Esto se hace para encontrar eficientemente los túneles entrantes de los otros clientes, pero los mensajes subsiguientes entre ellos normalmente incluyen esos datos, así que no se requieren ulteriores búsquedas en la base de datos de red.
ro: Prima dată când un client dorește să contacteze un alt client, face o interogare împotriva rețelei complet distribuite „ <a href="%(netdb)s">baza de date </a>"- o structură personalizată <a href="%(dht)s">tabel de hash distribuit (DHT)</a> bazat pe <a href="%(kad)s">Algoritmul Kademlia</a>. Acest lucru este făcut pentru a găsi în mod eficient tunelurile de intrare ale celuilalt client, dar mesaje ulterioare între ele, de obicei, include aceste date, astfel încât nu mai există căutări suplimentare în bazele de date din rețea sunt necesare.
sv: Första gången en klient vill kontakta en annan klient, gör den en förfrågan till en fullt distribuerad "<a href="%(netdb)s">nätverksdatabas </a>" - en specialkonfigurerad <a href="%(dht)s"> distribuerad hash table (DHT)</a> baserad på <a href="%(kad)s">Kademlia-algoritmen</a>.

source: More details about how I2P works are <a href="%(docs)s">available</a>.
es: Tiene <a href="%(docs)s">disponibles</a> mas detalles de como funciona I2P.
ro: Mai multe detalii despre modul în care funcționează I2P sunt <a href="%(docs)s">disponibile</a>.
sv: Mer detaljer om hur I2P fungerar finns <a href="%(docs)s">tillgängliga här</a>.

source: What can you do with it?
es: ¿Qué puede hacer con él?
ro: Ce poți face cu asta?
sv: Vad kan du göra med det?

source: Within the I2P network, applications are not restricted in how they can communicate - those that typically use UDP can make use of the base I2P functionality, and those that typically use TCP can use the TCP-like streaming library. We have a generic TCP/I2P bridge application ("<a href="%(i2ptunnel)s">I2PTunnel</a>") that enables people to forward TCP streams into the I2P network as well as to receive streams out of the network and forward them towards a specific TCP/IP address.
es: Dentro de la red I2P las aplicaciones no tienen restricciones en como pueden comunicarse - aquellas que normalmente usan UDP pueden usar las funcionalidades básicas de I2P, y aquellas aplicaciones que normalmente usan TCP pueden utilizar la librería 'tipo TCP de streaming'. I2P incluye una aplicación genérica de puente TCP/I2P ("<a href="%(i2ptunnel)s">I2PTunnel</a>") que permite enviar flujos TCP dentro de la red I2P, también recibir flujos TCP de fuera de la red y enviar estos a una dirección IP específica.
ro: În cadrul rețelei I2P, aplicațiile nu sunt restricționate în modul în care pot comunica - cei care utilizează de obicei UDP pot folosi I2P funcționalitatea de bază, iar cele care utilizează în mod obișnuit TCP pot utiliza streamingul asemănător TCP bibliotecă. Avem o aplicație de punte TCP / I2P generică ("<a href="%(i2ptunnel)s">I2PTunnel</a>") care permite oamenilor să transmită fluxuri TCP în rețeaua I2P precum și pentru a primi fluxuri din rețea și le transmite către o anumită adresă TCP / IP.
sv: Inom I2P-nätverket är program inte begränsade i hur de kan kommunicera - de som typiskt använder UDP kan den grundläggande funktionaliteten och de som typiskt använder TCP kan använda det TCP-lika streaming biblioteket. Vi har en generisk TCP/I2P brygg-applikations ("<a href="%(i2ptunnel)s">I2PTunnel</a>") som låter folk vidarebefodra TCP-strömmar in i I2P-nätverket och även mottaga strömmar från nätverket och vidarebefodra dom till en specifik TCP/IP adress.

source: I2PTunnel is currently used to let people run their own anonymous website ("eepsite") by running a normal webserver and pointing an I2PTunnel 'server' at it, which people can access anonymously over I2P with a normal web browser by running an I2PTunnel HTTP proxy ("eepproxy"). In addition, we use the same technique to run an anonymous IRC network (where the IRC server is hosted anonymously, and standard IRC clients use an I2PTunnel to contact it). There are other application development efforts going on as well, such as one to build an optimized swarming file transfer application (a la <a href="%(bittorrent)s">BitTorrent</a>), a distributed data store (a la <a href="%(freenet)s">Freenet</a> / <a href="%(mnet)s">MNet</a>), and a blogging system (a fully distributed <a href="%(livejournal)s">LiveJournal</a>), but those are not ready for use yet.
es: El I2PTunnel se usa actualmente para dejar que la gente ejecute sus propios sitios web anónimos ("eepsites") mediante la ejecución de un servidor web normal y apuntando hacia él un 'servidor' I2PTunnel, al que la gente pueda acceder anónimamente sobre I2P con un navegador web normal, ejecutando un proxy HTTP I2PTunnel ("eepproxy"). Además, usamos la misma técnica para ejecutar una red IRC anónima (donde el servidor IRC está alojado anónimamente, y los clientes IRC estándar usan un I2PTunnel para contactar con él). Hay otros esfuerzos de desarrollo de aplicaciones también en marcha, tales como uno para construir una aplicación optimizada de transferencia de ficheros en enjambre (estilo <a href="%(bittorrent)s">BitTorrent</a>), un almacenamiento de datos distribuido (estilo <a href="%(freenet)s">Freenet</a> / <a href="%(mnet)s">MNet</a>), y un sistema de blogs (un <a href="%(livejournal)s">LiveJournal</a> completamente distribuido), pero aún no están listas para su uso.
ro: I2PTunnel este folosit în prezent pentru a permite oamenilor să ruleze propriul lor site anonim ("eepsite") rulând un server web normal și indicând un "server" I2PTunnel la ea, care oamenii pot accesa anonim prin I2P cu un browser web normal rulând un proxy HTTP I2PTunnel ("eepproxy"). În plus, folosim la fel tehnica de a rula o rețea IRC anonimă (unde este găzduit serverul IRC anonim, iar clienții IRC standard folosesc un I2PTunnel pentru a-l contacta). Acolo sunt și alte eforturi de dezvoltare a aplicațiilor, cum ar fi unul la construirea o aplicației optimizată de transfer de fișiere (a la <a href="%(bittorrent)s">BitTorrent</a>), a magazin de date distribuit (a la <a href="%(freenet)s">Freenet</a> / <a href="%(mnet)s">MNet</a>) și un sistem de blogging (un sistem complet) distribuit <a href="%(livejournal)s">LiveJournal</a>), dar acestea sunt nu este încă pregătite pentru utilizare
sv: I2PTunnel används för närvarande till att låta användare köra sin egen anonyma webbplats ("eepsida") genom att använda en normal webbserver och peka en I2PTunnel 'server' mot den, som människor kan använda för att anonymt ansluta till över I2P med en normal webbläsare genom att köra en I2PTunnel HTTP proxy ("eepproxy"). Dessutom använder vi samma teknik för att köra ett anonymt IRC-nätverk (där IRC-servern hostas anonymt och vanliga IRC-klineter använder I2PTunnel för att kontakta den). Det finns andra program under utveckling som t ex en för att bygga en optimerad swarming file transfer program (a la <a href="%(bittorrent)s">BitTorrent</a>), en distribuerad datalagring (a la <a href="%(freenet)s">Freenet</a> / <a href="%(mnet)s">MNet</a>), och ett bloggsystem (en helt distribuerad <a href="%(livejournal)s">LiveJournal</a>), men dess är inte färdiga för användning än.

source: I2P is not inherently an "outproxy" network - the client you send a message to is the cryptographic identifier, not some IP address, so the message must be addressed to someone running I2P. However, it is possible for that client to be an outproxy, allowing you to anonymously make use of their Internet connection. To demonstrate this, the "eepproxy" will accept normal non-I2P URLs (e.g. "http://www.i2p.net") and forward them to a specific destination that runs a <a href="%(squid)s">squid</a> HTTP proxy, allowing simple anonymous browsing of the normal web. Simple outproxies like that are not viable in the long run for several reasons (including the cost of running one as well as the anonymity and security issues they introduce), but in certain circumstances the technique could be appropriate.
es: I2P no es inherentemente una red "outproxy" (que haga de proxy de salida) - el cliente al que usted envía un mensaje es un identificador criptográfico, no una dirección IP, así que el mensaje debe estar dirigido a alguien que se encuentre ejecutando I2P. Sin embargo es posible que esos clientes sean un proxy de salida, permitiéndole hacer un uso anónimo de sus conexiones a Internet. Para realizar esto, el "eepproxy" aceptará URLs normales no-I2P (ej.: "http://www.i2p.net") y los redirigirá a un destino específico que ejecuta un proxy HTTP <a href="%(squid)s">squid</a> (calamar), que permite la navegación anónima por la web normal de forma sencilla. Los proxys de salida simples como ese no son viables a largo plazo por varias razones (incluido el coste de ejecutar uno, así como los problemas de anonimato y seguridad que conllevan), pero en ciertas circunstancias la técnica podría ser apropiada.
ro: I2P nu este în mod inerent o rețea „outproxy” - clientul carui îl trimiteți un mesaj este identificatorul criptografic, nu o adresă IP, deci mesajul trebuie fii adresat cuiva care rulează I2P. Cu toate acestea, este posibil pentru acel client pentru a fi un outproxy, permițându-vă să folosiți anonim conexiune cu internetul. Pentru a demonstra acest lucru, "eepproxy" va accepta normal non-I2P Adrese URL (de exemplu, "http://www.i2p.net") și le trimiteți către o anumită destinație care rulează un proxy HTTP <a href="%(squid)s">squid</a>, permițând simplă navigare anonimă pe web normală. Outproxies simple ca acestea sunt nu este viabil pe termen lung din mai multe motive (inclusiv costul rulării una precum și problemele de anonimat și securitate pe care le introduc), dar în anumite circumstanțe tehnica ar putea fi adecvată.
sv: I2P är inte ett inherent "outproxy"-nätverk - klienten du skickar ett meddelande till är den kryptografiska identiteten, inte någon IP-adress, så meddelandet måste vara adresserat till någon som kör I2P. Emellertid, det är möjligt för en klient att vara en outproxy, och tillåta dig att anonymt nå deras internetuppkoppling. För att demonstrera detta, "eepproxyn" kommer att acceptera normala icke-I2P URLer (såsom "http://www.i2p.net") och vidarebefordra till en specifik destination som kör en <a href="%(squid)s">squid</a> HTTP proxy, vilken tillåter anonym browsing på det vanliga nätet. Sådana enkla outproxies är inte gångbara i det långa loppet av flera skäl (inklusive kostnaden och anonymitets- och säkerhetsfrågor), men i vissa fall kan tekniken vara lämplig.

source: The I2P development <a href="%(team)s">team</a> is an open group, welcome to all who are interested in <a href="%(volunteer)s">getting involved</a>, and all of the code is <a href="%(licenses)s">open source</a>. The core I2P SDK and the current router implementation is done in Java (currently working with both sun and kaffe, gcj support planned for later), and there is a <a href="%(sam)s">simple socket based API</a> for accessing the network from other languages (with a C library available, and both Python and Perl in development). The network is actively being developed and has not yet reached the 1.0 release, but the current <a href="%(roadmap)s">roadmap</a> describes our schedule.
es: El <a href="%(team)s">equipo</a> de desarrollo de I2P es un grupo abierto, todos los que estén interesados son bienvenidos a <a href="%(volunteer)s">involucrarse</a> en el proyecto, y todo el código es <a href="%(licenses)s">libre</a>. El núcleo de I2P y la implementación del ruter están en java (actualmente trabajando con sun y kaffe, el soporte para gjc está planeado para mas adelante), y hay un <a href="%(sam)s"> API simple</a> para acceder a la red desde otros lenguajes (con una librería C disponible, y con Python y Perl en desarrollo). La red está en estos momentos en desarrollo activamente y aún no ha alcanzado la versión 1.0, pero la actual <a href="%(roadmap)s">hoja de ruta</a> describe nuestro programa.
ro: <a href="%(team)s">Echipa</a> de dezvoltare I2P este un grup deschis, binevenit tuturor care sunt interesați să <a href="%(volunteer)s">se implice</a> și tot codul este <a href="%(licenses)s">open source</a>. SDK I2P de bază și implementarea curentă a routerului se face în Java (funcționează în prezent cu ambele sun and kaffe, gcj support planificat pentru mai târziu) și există un <a href="%(sam)s">API simplă bazată pe socket</a> pentru accesarea rețelei din alte limbi (cu o bibliotecă C disponibilă, și Python și Perl în) dezvoltare). Rețeaua este dezvoltată activ și nu a ajuns încă versiunea 1.0, dar <a href="%(roadmap)s">foaia de parcurs</a> actuală descrie programul nostru
sv: I2Ps utvecklar-<a href="%(team)s">team</a> är en öppen grupp, som välkomnar alla som är intresserade av att <a href="%(volunteer)s">hjälpa till</a>, all källkod är <a href="%(licenses)s">open source</a>. Kärnan av I2P SDK:n och den nuvarande routerimplementationen är gjord i Java (som för närvarande fungerar med både sun och kaffe, gcj-stöd planeras för senare) och det finns ett <a href="%(sam)s">simple socket baserat API</a> för att ge tillgång till nätverket från andra språk (med ett C bibliotek tillgängligt och både Python och Perl under utveckling). Nätverket är under aktiv utveckling och har inte ännu nått 1.0 releasen, men den nuvarande <a href="%(roadmap)s">utvecklingsplanen</a> beskriver vårt tidschema.

source: Presentations on I2P
es: Presentaciones sobre I2P
ro: Prezentări pe I2P
sv: Presentationer om I2P

source: Following are links to presentations, videos, and tutorials about I2P. Links to research papers on I2P are available <a href="%(papers)s">here</a>.
es: Los siguientes enlaces son presentaciones, vídeos y tutoriales sobre I2P. Los enlaces para investigación sobre I2P están disponibles <a href="%(papers)s">aquí</a>.
ro: Urmează link-uri către prezentări, videoclipuri și tutoriale despre I2P. Link-uri către lucrările de cercetare pe I2P sunt disponibile <a href="%(papers)s">aici</a>.
sv: Följande är länkar till presentationer, videor och guider om I2P. Länkar till akademiska artiklar om I2P är tillgängliga <a href="%(papers)s">här</a>.

source: To request an addition to this page, please send to %(email)s.
es: Para solicitar añadidos a esta web por favor envíelos a %(email)s.
ro: Pentru a solicita adăugarea la această pagină, vă rugăm să trimiteți la %(email)s.
sv: För att be om tillägg till den här sidan, skicka till %(e-post)s.

source: Newest links are at the bottom of each section.
es: Los enlaces más nuevos al final de cada sección.
ro: Cele mai noi legături se găsesc în partea de jos a fiecărei secțiuni.
sv: De nyaste länkarna är på botten av varje del.

source: Presentations
es: Presentaciones
ro: Prezentări
sv: Presentationer

source: IIP Presentation at CodeCon <a href="%(mp3)s">MP3 audio</a> <a href="%(transcript)s">transcript</a> Lance James (0x90), February 2002.
es: IIP Presentación en CodeCon <a href="%(mp3)s">MP3 audio</a> <a href="%(transcript)s">transcripción</a> Lance James (0x90), Febrero 2002.
ro: Prezentare IIP la CodeCon <a href="%(mp3)s">Audio MP3</a> <a href="%(transcript)s">transcriere</a> Lance James (0x90), februarie 2002.
sv: IIP Presentation op CodeCon <a href="%(mp3)s">MP3 ljud</a> <a href="%(transcript)s">transkript</a> Lance James (0x90), Februari 2002.

source: IIP Presentation at ToorCon <a href="%(mp3)s">MP3 audio</a> <a href="%(slides)s">slides</a> Lance James (0x90), September 2002.
es: IIP Presentación en ToorCon <a href="%(mp3)s">MP3 audio</a> <a href="%(slides)s">diapositivas</a> Lance James (0x90), Septiembre 2002.
ro: Prezentare IIP la ToorCon <a href="%(mp3)s">Audio MP3</a> <a href="%(slides)s">slide-uri</a> Lance James (0x90), septembrie 2002.
sv: IIP Presentation op ToorCon <a href="%(mp3)s">MP3 ljud</a> <a href="%(slides)s">slides</a> Lance James (0x90), Februari 2002.

source: <a href="%(video)s">To Be or I2P</a> (Youtube Video) An introduction into anonymous communication with I2P. <a href="%(pdf)s">To Be or I2P (PDF presentation)</a>, Jens Kubieziel, 24C3 Berlin, December 28, 2007.
es: <a href="%(video)s">To Be or I2P</a> (Youtube Video) Una introducción a las comunicaciones anónimas con I2P. <a href="%(pdf)s">To Be or I2P (PDF presentation)</a>, Jens Kubieziel, 24C3 Berlin, Diciembre 28, 2007.
ro: <a href="%(video)s">A fi sau I2P</a> (Video YouTube) O introducere în comunicarea anonimă cu I2P. <a href="%(pdf)s">To Be or I2P (prezentare PDF)</a>, Jens Kubieziel, 24C3 Berlin, 28 decembrie 2007.
sv: <a href="%(video)s">To Be or I2P</a> (Youtube Video) En introduktion till anonym communication med I2P <a href="%(pdf)s">To Be or I2P (PDF presentation)</a>, Jens Kubieziel, 24C3 Berlin, December 28, 2007.

source: <a href="%(video)s">Video of I2P talk at Chemnitz Linux Tag</a>, Lars Schimmer, March 14-15, 2009
es: <a href="%(video)s">Vídeo de charla I2P en Chemnitz Linux Tag</a>, Lars Schimmer, Marzo 14-15, 2009
ro: <a href="%(video)s">Videoclipul discuției I2P la Chemnitz Linux Tag</a>, Lars Schimmer, 14-15 martie 2009
sv: <a href="%(video)s">Video av I2P föreläsning på Chemnitz Linux Tag</a>, Lars Schimmer, Mars 14-15, 2009

source: HOPE New York July 17, 2010 - Brief overview of I2P by zzz, at the end of Adrian Hong's talk "Hackers for Human Rights". <a href="%(mp3)s">MP3 audio</a>
es: HOPE New York Julio 17, 2010 - Vista rápida sobre I2P by zzz, al final de la charla de Adrian Hong "Hackers for Human Rights". <a href="%(mp3)s">MP3 audio</a>
ro: HOPE New York 17 iulie 2010 - Scurtă privire de ansamblu a I2P de zzz, la finalul discuției lui Adrian Hong „Hackerii pentru drepturile omului”. <a href="%(mp3)s">Audio MP3</a>
sv: HOPE New York Juli 17, 2010 - Kort överblick över I2P av zzz, på slutet av Adrian Hong's föreläsning "Hackers for Human Rights". <a href="%(mp3)s">MP3 ljud</a>

source: <a href="%(link)s">Into the I2P Darknet: Welcome to Cipherspace</a> Adrian Crenshaw. Schmoocon Firetalk, January 2011
es: <a href="%(link)s">Into the I2P Darknet: Welcome to Cipherspace</a> Adrian Crenshaw. Schmoocon Firetalk, Enero 2011
ro: <a href="%(link)s">În Darknetul I2P: Bine ați venit la Cipherspace</a> Adrian Crenshaw. Schmoocon Firetalk, ianuarie 2011
sv: <a href="%(link)s">Into the I2P Darknet: Welcome to Cipherspace</a> Adrian Crenshaw. Schmoocon Firetalk, Januari 2011

source: <a href="%(link)s">Using techhnology to advance liberty</a> (Youtube Video) Eric Johnson. <a href="http://agora.io/etienne">Agora I/O Unconference</a>, March 27, 2011. I2P covered from 10:00 to 20:00 in the video.
es: <a href="%(link)s">Usando la tecnología para mejorar la libertad</a> (Youtube Vídeo) Eric Johnson. <a href="http://agora.io/etienne">Agora I/O Unconference</a>, Marzo 27, 2011. I2P desde 10:00 a 20:00 en el vídeo.
ro: <a href="%(link)s">Utilizarea tehnologiei pentru a avansa libertatea</a> (Video YouTube) Eric Johnson. <a href="http://agora.io/etienne">Agora I/O Unconference</a>, 27 martie 2011. I2P acoperit de la 10:00 la 20:00 în videoclip.
sv: <a href="%(link)s">Using techhnology to advance liberty</a> (Youtube Video) Eric Johnson. <a href="http://agora.io/etienne">Agora I/O Unconference</a>, Mars 27, 2011. I2P omtalas från 10:00 till 20:00 i videon.

source: <a href="%(link)s">Common Darknet Weaknesses</a> (Youtube Video) Adrian Crenshaw, <a href="http://aide.marshall.edu/">AIDE</a>, July 11-15, 2011.
es: <a href="%(link)s">Common Darknet Weaknesses</a> (Vídeo en Youtube) Adrian Crenshaw, <a href="http://aide.marshall.edu/">AIDE</a>, Julio 11-15, 2011
ro: <a href="%(link)s">Puncte slabe obișnuite</a> (Video YouTube) Adrian Crenshaw, <a href="http://aide.marshall.edu/">AIDE</a>, 11-15 iulie 2011.
sv: <a href="%(link)s">Common Darknet Weaknesses</a> (Youtube Video) Adrian Crenshaw, <a href="http://aide.marshall.edu/">AIDE</a>, Juli 11-15, 2011.

source: <a href="%(link)s">I2P / Tor Workshop Notes</a> Adrian Crenshaw. DEF CON 19, Las Vegas, August 6, 2011.
es: <a href="%(link)s">I2P / Tor Workshop Notes</a> Adrian Crenshaw. DEF CON 19, Las Vegas, Agosto 6, 2011.
ro: <a href="%(link)s">Note pentru atelierul I2P / To</a>r Adrian Crenshaw. DEF CON 19, Las Vegas, 6 august 2011.
sv: <a href="%(link)s">I2P / Tor Workshop Anteckningar</a> Adrian Crenshaw. DEF CON 19, Las Vegas, August 6, 2011.

source: <a href="%(live)s">Cipherspaces/Darknets: An Overview Of Attack Strategies - DEF CON Live version (Youtube Video)</a>, <a href="%(studio)s">"Studio" version (Youtube Video)</a>, <a href="%(slides)s">Slides (ppt)</a> Adrian Crenshaw. DEF CON 19, Las Vegas, August 7, 2011.
es: <a href="%(live)s">Cipherspaces/Darknets: An Overview Of Attack Strategies - DEF CON Vesión en vivo (Vídeo de Youtube)</a>, <a href="%(studio)s">versión de "estudio" (Youtube Video)</a>, <a href="%(slides)s">Slides (ppt)</a> Adrian Crenshaw. DEF CON 19, Las Vegas, Agosto 7, 2011.
ro: <a href="%(live)s">Cipherspaces / Darknets: o imagine de ansamblu asupra strategiilor de atac - DEF CON Versiune live (Youtube Video)</a>, <a href="%(studio)s">Versiunea „Studio” (Youtube Video)</a>, <a href="%(slides)s">Diapozitive (ppt)</a> Adrian Crenshaw. DEF CON 19, Las Vegas, 7 august 2011.

source: <a href="http://0x375.org/">Modern cipherspace ecosystems</a>, 0x375 0x06 (Thessaloniki Tech Talk Sessions), November 4, 2011.
es: <a href="http://0x375.org/">Modern cipherspace ecosystems</a> (Ecosistemas de espacio cifrado modernos), 0x375 0x06 (Thessaloniki Tech Talk Sessions (Charlas técnicas de Tesalónica)), 4 de noviembre de 2011.
ro: <a href="http://0x375.org/">Ecosisteme de criptare spațiale moderne</a>, 0x375 0x06 (Thessaloniki Tech Talk Sessions), 4 noiembrie 2011.
sv: <a href="http://0x375.org/">Modernt Cipherspace Ekosystem</a>, 0x375 0x06 (Thessaloniki Tech Talk Sessions), 4 November 2011.

source: <a href="%(link)s">I2P - The Anonymous Network</a> (Youtube Video) Blair Dick, University of Abertay, Dundee Ethical Hacking Society, January 25, 2012.
es: <a href="%(link)s">I2P - The Anonymous Network</a> (I2P - La red anónima) (Vídeo de Youtube) Blair Dick, Universidad de Abertay, Sociedad de hacking ético de Dundee, 25 de enero de 2012.
ro: <a href="%(link)s">I2P - Rețeaua anonimă</a> (Video YouTube) Blair Dick, Universitatea din Abertay, Dundee Ethical Hacking Society, 25 ianuarie 2012.
sv: <a href="%(link)s">I2P - The Anonymous Network</a> (Youtube Video) Blair Dick, University of Abertay, Dundee Ethical Hacking Society, 25 januari 2012.

source: <a href="%(link)s">I2PCon 2015</a> Toronto, August 15-16, 2015
es: <a href="%(link)s">I2PCon 2015</a> Toronto, 15-16 de agosto de 2015
ro: <a href="%(link)s">I2PCon 2015</a> Toronto, 15-16 august 2015
sv: <a href="%(link)s">I2PCon 2015</a> Toronto, augusti 15-16, 2015
