Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/about.po
Languages: es, ro, sv

source: Currently mihi's ministreaming library has a fairly simple stream negotiation protocol - Alice sends Bob a SYN message, Bob replies with an ACK message, then Alice and Bob send each other some data, until one of them sends the other a CLOSE message. For long lasting connections (to an IRC server, for instance), that overhead is negligible, but for simple one-off request/response situations (an HTTP request/reply, for instance), that's more than twice as many messages as necessary. If, however, Alice piggybacked her first payload in with the SYN message, and Bob piggybacked his first reply with the ACK - and perhaps also included the CLOSE flag - transient streams such as HTTP requests could be reduced to a pair of messages, instead of the SYN+ACK+request+response+CLOSE.
es: Actualmente la librería ministream de mihi tiene un protocolo de negociación bastante simple - Alice envía a Bob un mensaje SYN, Bob responde con un ACK, entonces Alice y Bob comparten información, hasta que uno le envíe a otro un mensaje CLOSE. Para conexiones de larga duración (por ejemplo a un servidor IRC), esta sobrecarga es despreciable, pero para situaciones de una sola repuesta (Una petición HTTP por ejemplo), es más del doble de los mensajes necesarios. Si, de otra forma, Alice hubiese adjuntado su primer payload con el mensaje SYN, y Bob hubiese adjuntado su primera respuesta en el ACK - e incluso incluyendo la etiqueta CLOSE - los envíos transitorios como las respuetas HTTP podrían reducirse a un par de mensajes, en vez del SYN+ACK+petición+respuesta+CLOSE.
ro: În prezent, biblioteca de ministreaming a mihi are o negociere de flux destul de simplă protocol - Alice îi trimite lui Bob un mesaj SYN, apoi Bob răspunde cu un mesaj ACK Alice și Bob își transmit reciproc câteva date, până când unul dintre ei îi trimite celuilalt a Mesaj ÎNCHIS Pentru conexiuni de lungă durată (de exemplu, la un server IRC), că aerul general este neglijabil, dar pentru situații simple de solicitare / răspuns (de exemplu, o cerere / răspuns HTTP), adică mai mult de două ori mai multe mesaje decât necesar. Dacă totuși, Alice și-a asigurat prima sarcină utilă cu SYN mesaj, iar Bob și-a exprimat prima replică cu ACK - și poate, de asemenea a inclus indicatorul CLOSE - fluxuri tranzitorii, cum ar fi cererile HTTP redus la o pereche de mesaje, în loc de SYN + ACK + cerere + răspuns + ÎNCHIS.
sv: För närvarande har mihis ministreamingbibliotek ett tämligen enkelt strömförhandlingsprotokoll - Alice skickar ett SYN-meddelande till Bob, Bob svarar med ett ACK-meddelande, sen skickar Alice och Bob varandra lite data, tills en av dem skickar den andre ett CLOSE-meddelande. För längre anslutningar (exempelvis till en IRC-server), är overheaden försumbar, men för enkla request/response engångssituationer (ett HTTP-utbyte t ex), så är det mer än dubbelt så många meddelanden än vad som är nödvändigt. Om emellertid Alice häftade sin första payload vid sitt SYN och Bob häftade sitt första svar vid sitt ACK - och kanske också inkluderade CLOSE-flaggan - så kunde tillfälliga strömmar som HTTP-requests reduceras till ett par meddelanden, i stället för SYN+ACK+request+response+CLOSE.

source: Implement full streaming protocol
es: Implementar el protocolo full streaming
ro: Implementați protocolul de streaming complet
sv: Implementera komplett streamingprotokoll

source: The ministreaming protocol takes advantage of a poor design decision in the I2P client protocol (I2CP) - the exposure of "mode=GUARANTEED", allowing what would otherwise be an unreliable, best-effort, message based protocol to be used for reliable, blocking operation (under the covers, its still all unreliable and message based, with the router providing delivery guarantees by garlic wrapping an "ACK" message in with the payload, so once the data gets to the target, the ACK message is forwarded back to us [through tunnels, of course]).
es: El protocolo ministreaming se aprovecha de una decisión en favor de un pobre diseño en el protocolo de cliente de I2P (I2CP) - la vulnerabilidad del "mode=GUARANTEED" (garantizado), que permite que lo que de otra forma sería sólo un protocolo basado en mensajes, no fiable, y que lo hace lo mejor que puede, sea utilizado para operaciones de bloqueo fiables (bajo las apariencias, todo será aún no fiable y basado en mensajes, con el router I2P proporcionando garantías de entrega al adjuntar un mensaje "ACK" `[acuse de recibo] dentro junto con la carga, de forma que una vez los datos llegan al objetivo, el mensaje ACK es reenviado de vuelta a nosotros [a través de túneles, por supuesto]).
ro: Protocolul de ministreaming profită de o decizie de proiectare deficitară în Protocolul client I2P (I2CP) - expunerea „mode = GARANȚIE”, permițând ce altfel ar fi un protocol fiabil, cu cel mai bun efort, bazat pe mesaje care trebuie utilizat pentru o funcționare fiabilă și de blocare (sub copertine, tot nu este sigur și bazat pe mesaje), routerul oferind garanții de livrare prin ambalarea usturoiului un mesaj "ACK" cu sarcina utilă, astfel încât odată ce datele ajung la țintă, Mesajul ACK este trimis înapoi către noi [prin tuneluri, desigur]).
sv: Ministreamingprotokollet drar nytta av ett dåligt designbeslut i I2P-klientprotokollet (I2CP) - blottandet av "mode=GUARANTEED", vilket tillåter vad som annars skulle vara ett opålitligt, bästa-försök, meddelandebaserat protokoll att användas i stället för en pålitligt blockerande operation (under ytan är det fortfarande helt opålitligt och meddelandebaserat, med routern som leverantör av garantier genom lök wrapping av "ACK"-meddelande tillsammans med datalasten, så när datan når målet returneras ACK-meddelandet till oss [genom tunnlar naturligvtis]).

source: As I've <a href="%(link)s">said</a>, having I2PTunnel (and the ministreaming lib) go this route was the best thing that could be done, but more efficient mechanisms are available. When we rip out the "mode=GUARANTEED" functionality, we're essentially leaving ourselves with an I2CP that looks like an anonymous IP layer, and as such, we'll be able to implement the streaming library to take advantage of the design experiences of the TCP layer - selective ACKs, congestion detection, nagle, etc.
es: Como ya he <a href="%(link)s">dicho</a>, permitir que el I2PTunnel (y la librería ministream) usen esta ruta es lo mejor que se pudo hacer, pero hay mecanismos más eficientes. Cuando eliminamos la funcionalidad "mode=GUARANTEED", estamos esencialmente dejando un I2CP que parece una capa IP anónima, y por eso, podremos ser capaces de implementar la librería de streaming para obtener ventajas de las experiencias de diseño de la capa TCP - ACKs selectivos, detección de congestión, etc.
ro: După cum <a href="%(link)s">am spus</a>, a avea I2PTunnel (și ministreaming lib ) merg pe această rută a fost cel mai bun lucru s-ar putea face, dar sunt disponibile mecanisme mai eficiente. Când vom scoate Funcționalitatea „mode = GARANȚIE”, ne lăsăm în esență un an I2CP care arată ca un strat IP anonim și, ca atare, vom putea implementați biblioteca de streaming pentru a profita de experiențele de proiectare ale stratul TCP - ACK-uri selective, detecție de congestionare, agitatie etc.
sv: Som jag <a href="%(link)s">sa</a>, att låta I2PTunnel (och ministreamingbiblioteket) ta den här riktningen var det bästa som kunde göras, men mer effektiva mekanismer är tillgängliga. När vi tar bort "mode=GUARANTEED" funktionaliteten, återstår i huvudsak en I2CP som ser ut som ett anonymt IP-lager, som sådant kommer vi att kunna implementera streamingbiblioteket till att dra fördel av TCP-lagrets designerfarenheter - selektiv ACK, överbelastningsdetektering etc.

source: Performance
es: Rendimiento
ro: Performanță
sv: Prestanda

source: How does I2P work, why is it slow, and why does it not use my full bandwidth?
es: ¿Cómo funciona I2P, por qué es lento, y por qué no utiliza todo el ancho de banda?
ro: Cum funcționează I2P, de ce este lent și de ce nu folosește lățimea de bandă completă?
sv: Hur fungerar I2P, varför är det långsamt, och varför använder det inte hela min bandbredd?

source: Probably one of the most frequent things people ask is "how fast is I2P?", and no one seems to like the answer - "it depends". After trying out I2P, the next thing they ask is "will it get faster?", and the answer to that is a most emphatic <b>yes</b>.
es: Probablemente una de las preguntas más frecuentes es ¿cómo de rápido es I2P?, y parece que a nadie le gusta la respuesta - "depende". Después de probar I2P, la siguiente cosa que preguntan es ¿será más rápido?, y la respuesta a eso es un enfático <b>sí</b>.
ro: Probabil unul dintre cele mai frecvente lucruri pe care oamenii le întreabă este „cât de repede este I2P?”, și nimeni nu pare să-i placă răspunsul - „depinde”. După ce am încercat I2P, următorul lucru pe care îl întreabă este „se va face mai repede?”, iar răspunsul la acesta este cel mai mult empatic <b>da</b>.
sv: Den vanligaste frågan är förmodligen "hur snabbt är I2P?", och ingen verkar gilla svaret - "det beror på". Efter att ha provate I2P är nästa sak dom frågar "kommer det att bli snabbare?", och svaret på det är ett uttryckligt <b>ja</b>.

source: I2P is a full dynamic network. Each client is known to other nodes and tests local known nodes for reachability and capacity. Only reachable and capable nodes are saved to a local NetDB (This is generally only a portion of the network, around 500-1000). When I2P builds tunnels, it selects the best resource from this pool. For example, a small subset of 20-50 nodes are only available to build tunnels with. Because testing happens every minute, the pool of used nodes changes every minute. Each I2P node knows a different part of the net, meaning that each router has a different set of I2P nodes to be used for tunnels. Even if two routers have the same subset of known nodes, the tests for reachability and capacity will likely show different results, as the other routers could be under load just as one router tests, but be free if the second router tests.
es: I2P es un red totalmente dinámica. Cada cliente es conocido por otros nodos y prueba los nodos conocidos localmente para comprobar su accesibilidad y su capacidad. Sólo los nodos accesibles y capaces son guardados en la NetDB local (Esto normalmente es sólo una parte de la red, sobre 500-1000). Cuando I2P construye túneles selecciona los mejores recursos de esta fuente. Por ejemplo, sólo unos 20-50 nodos están disponibles para construir túneles. Ya que las pruebas se hacen cada minuto la fuente de los nodos usados cambia cada minuto. Cada nodo I2P conoce una parte de la red total, haciendo que cada ruter tenga una lista diferente de nodos I2P para ser usados como túneles. Incluso si dos ruters tienen la misma subred de nodos conocidos las pruebas de accesibilidad y capacidad mostrarán diferentes resultados, ya que cuando un ruter hace las pruebas otros ruters pueden estar bajo carga, pero estar libre cuando es un segundo ruter el que hace las pruebas.
ro: I2P este o rețea dinamică completă. Fiecare client este cunoscut altor noduri și testează nodurile cunoscute locale pentru accesibilitate și capacitate. Doar nodurile accesibile și capabile sunt salvate într-un NetDB local (în general, este doar o porțiune a rețelei, aproximativ 500-1000). Când I2P construiește tuneluri, selectează cea mai bună resursă din acest pool. De exemplu, un mic subset de 20-50 de noduri sunt disponibile numai pentru a construi tunele cu. Deoarece testarea se întâmplă în fiecare minut, grupul de noduri folosite se schimbă în fiecare minut. Fiecare nod I2P cunoaște o parte diferită a plasei, ceea ce înseamnă că fiecare router are un set diferit de noduri I2P pentru a fi utilizate pentru tuneluri. Chiar dacă două routere au același subset de noduri cunoscute, testele privind accesibilitatea și capacitatea vor arăta probabil rezultate diferite, deoarece celelalte routere ar putea fi sub sarcină la fel ca testele unui router, dar să fie gratuite dacă al doilea test de router.
sv: I2P är ett helt dynamiskt nätverk. Varje klient är känd för andra noder och testar lokalt kända noder för nåbarhet och kapacitet. Endast nåbara och användbara noder sparas till en lokal NetDB (Vanligtvis bara en del av nätverket, runt 500-1000). När I2P bygger tunnlar, väljer den de bästa resurserna från denna pool. Till exempel, för att bygga tunnlar är endast ett litet urval av 20-50 noder tillgängliga. Eftersom den testas varje minut, skiftar poolens använda noder varje minut. Varje I2P-nod känner till olika delar av nätet, det betyder att varje router har olika set av I2P-noder att använda för tunnlar. Även om två routrar har samma delmängd av kända noder, kommer testerna för nåbarhet och kapacitet troligen att ge olika resultat, eftersom andra routers kan vara under belastning just när en router testar, men fria om en annan router testar.

source: The above describes why each I2P node has different nodes to build tunnels. Because every I2P node has a different latency and bandwith, tunnels (which are built via those nodes) have different latency and bandwidth values. And because every I2P node has different tunnels built, no two I2P nodes have the same tunnel sets.
es: El texto anterior explica porque cada nodo I2P usa diferentes nodos para construir sus túneles. Porque cada nodo I2P tienen una latencia y ancho de banda diferente, los túneles ( que se construyen con estos nodos) tienen valores diferentes de latencia y ancho de banda. Y ya que cada nodo I2P tiene diferentes nodos construidos, no hay dos nodos I2P con la misma configuración de túneles.
ro: Cele de mai sus descriu de ce fiecare nod I2P are noduri diferite pentru a construi tuneluri. Deoarece fiecare nod I2P are o latență și o bandă diferită, tunelurile (care sunt construite prin acele noduri) au valori diferite de latență și de lățime de bandă. Și pentru că fiecare nod I2P are tuneluri diferite construite, nu există două noduri I2P nu au aceleași seturi de tunel.
sv: Ovan beskriver varför varje I2P-nod använder olika noder för att bygga tunnlar. Eftersom varje I2P-nod har olika fördröjning och bandbredd, har tunnlarna (som byggs via dess noder) olika fördröjning och bandbredd. Och eftersom varje I2P-nod bygger olika tunnlar, så har inte något par av I2P-noder samma tunnelset.

source: A server/client is known as a "destination" and each destination has at least one inbound and one outbound tunnel. The default is 3 hops per tunnel. This adds up to 12 hops (aka 12 different I2P nodes) for a full roundtrip client-server-client.
es: Un servidor/cliente se conoce como "destinación" y cada destinación tiene al menos un túnel de entrada y otro de salida. Por defecto son 3 saltos por túnel. Esto suman 12 saltos (osea 12 diferentes nodos I2P) para una ida y vuelta completa cliente-servidor-cliente.
ro: Un server / client este cunoscut sub numele de „destinație” și fiecare destinație are cel puțin un tun de intrare și unul de ieșire. Valoarea implicită este de 3 hamei pe tunel. Aceasta adaugă până la 12 hamei (de asemenea 12 noduri I2P diferite) pentru un roundtrip complet client-server-client .
sv: En server/klient är känd som en "destination" och varje destination har åtminstone en ingående och en utgående tunnel. Förvalet är 3 hopp per tunnel. Det blir tillsammans 12 hopp (aka 12 olika I2P-noder) för en komplett tur och retur klient-server-klient.

source: Each data package is sent through 6 other I2P nodes until it reaches the server:
es: Cada paquete de datos es enviado a través de otros 6 nodos I2P hasta que alcanza el servidor:
ro: Fiecare pachet de date este trimis prin 6 alte noduri I2P până când ajunge la server:
sv: Varje datapaket sänds genom 6 andra I2Pnoder innan det når servern.

source: and on way back 6 different I2P nodes:
es: y de vuelta por 6 nodos I2P diferentes:
ro: și la întoarcere 6 noduri I2P diferite:
sv: och på vägen tillbaka 6 andra I2Pnoder:

source: As most traffic on I2P (www, torrent,...) needs ack packages until new data is sent, it needs to wait until a ack package returns from the server. In the end: send data, wait for ack, send more data, wait for ack,.. As the RTT (RoundTripTime) adds up from the latency of each individual I2P node and each connection on this roundtrip, it takes usually 1-3 seconds until a ack package comes back to the client. With some internals of TCP and I2P transport, a data package has a limited size and cannot be as large as we want it to be. Together these conditions set a limit of max bandwidth per tunnel of 20-50 kbyte/sec. But if ONLY ONE hop in the tunnel has only 5 kb/sec bandwidth to spend, the whole tunnel is limited to 5 kb/sec, independent of the latency and other limitations.
es: Como la mayoría del tráfico I2P (www, torrent, ...) necesita paquetes ack hasta que la nueva información es enviada, necesita esperar hasta que un paquete ack regrese del servidor. Al final: envía información, espera por ack, envía mas información, espera por ack... Y ya que el RTT (RoundTripTime) añade latencia por cada nodo individual I2P y por cada conexión de esta ida y vuelta, normalmente tarda de 1-3 segundos hasta que un paquete ack regresa al cliente. Además el funcionamiento interno del transporte de TCP y de I2P hacen que un paquete de información tenga un tamaño limitado y no pueda ser tan grande como desearíamos que fuese. Estas condiciones unidas crean un límite de ancho de banda por túnel de 20-50 kbyte/sec. Pero, si SÓLO un salto del túnel tiene solamente 5 kb/sec de ancho de banda para usar, el túnel completo estará limitado a 5 kb/sec, independientemente de las latencia y otras limitaciones.
ro: Deoarece majoritatea traficului pe I2P (www, torrent, ...) au nevoie de pachete ack până când sunt trimise date noi, trebuie să aștepte până când un pachet ack se întoarce de pe server. În final: trimiteți date, așteptați ack, trimiteți mai multe date, așteptați ack, .. Pe măsură ce RTT (RoundTripTime) se adaugă din latența fiecărui nod I2P individual și a fiecărei conexiuni de pe acest roundtrip, durează de obicei 1-3 secunde până când un pachet ack revine clientului. Cu unele interne ale transportului TCP și I2P, un pachet de date are o dimensiune limitată și nu poate fi la fel de mare pe cât ne dorim. Împreună, aceste condiții stabilesc o limită de lățime de bandă maximă pe tunel de 20-50 kbyte / sec. Dar, dacă NUMAI UN singur salt în tunel are doar o lățime de bandă de 5 kb / sec pentru a cheltui, întregul tunel este limitat la 5 kb / sec, independent de latența și alte limitări.
sv: Eftersom den mesta trafiken i I2P (www, torrent,...) behöver ack-paket tills ny data har blivit sänd, behöver den vänta tills ett ackpaket kommer tillbaka från serven. Till slut: skicka data, vänta på ack, skicka mer data, vänta på ack..... Allt eftersom RTT (RoundTripTime) ackumuleras från fördröjningen av varje individuell I2P-nod och varje anslutning på den här turen, tar det vanligtvis 1-3 sekunder tills ett ackpaket kommer tillbaka till klienten. På grund av en del interna restriktioner i TCP och I2P-transport, kan ett datapaket på grund av begränsad storlek inte vara så stor som vi skulle vilja. Tillsammans sätter dessa restriktioner en gräns för bandbredden per tunnel till 20-50 kbyte/sek. Men om BARA ETT hopp i tunneln endast har 5 kb/sek bandbredd att spendera, begränsas hela tunneln till 5 kb/sek, oberoende av fördröjning och andra begränsningar.

source: Due to encryption used and other setups in I2P (howto built up tunnels, latency, ...) it is quite expensive in CPU time to build a tunnel. This is why a destination is only allowed to have a max of 6 IN and 6 OUT tunnels to transport data. With a max of 50 kb/sec per tunnel, a destination could use roughly 300 kb/sec traffic combined ( in reality it could be more if shorter tunnels are used with low or no anonymity available). Used tunnels are discarded every 10 minutes and new ones are built up. This change of tunnels (and sometimes clients that shutdown hard due to usage of "shut down at once" or situations where there is power loss) does sometimes break tunnels and connections, as seen on the IRC2P Network in loss of connection (ping timeout) or on when using eepget.
es: Debido al cifrado usado y otras configuraciones de I2P (como se construyen los túneles, latencia, ...) se utiliza bastante tiempo de la CPU para crear un túnel. Esto es por lo que una destinación solo tiene permitido un máximo de 6 túneles de de entrada y 6 de salida para enviar información. Con un máximo de 50 kb/sec por túnel una destinación podría usar aproximadamente 300 kb/sec (en realidad podría ser más si se utilizan túneles más cortos con poco o ningún anonimato). Los túneles usados son eliminados cada 10 minutos y se crean unos nuevos. Estos cambios en los túneles (y a veces los clientes que apagan de golpe usando "apagar inmediatamente" o por caídas de corriente) a veces rompen los túneles y las conexiones, como se puede ver en las pérdidas de conexiones en el IRC2P (ping timeout) o cuando se está usando eepget.
ro: Datorită criptării utilizate și a altor setări în I2P (cum să construiți tuneluri, latență, ...), este destul de scump în timpul procesorului să construiți un tunel. Aceasta este de ce o destinație este permisă doar să aibă maxim 6 tunele IN și 6 OUT pentru a transporta date. Cu un maxim de 50 kb / sec pe tunel, o destinație ar putea utilizați aproximativ 300 kb / sec trafic combinat (în realitate ar putea fi mai mult dacă sunt utilizate tuneluri mai scurte cu anonimat scăzut sau nu există). Tunelurile folosite sunt aruncate la fiecare 10 minute și sunt construite altele noi. Această schimbare a tunelurilor (și uneori a clienților care se închid din greu datorită utilizării „închise simultan” sau a situațiilor în care există pierderi de energie) uneori rupe tuneluri și conexiuni, așa cum se vede în rețeaua IRC2P în pierderea conexiunii (ping timeout) sau pornit atunci când utilizați eepget.
sv: Beroende på den kryptering som används och andra inställningar i I2P (hur tunnlar byggs, fördröjning....) så är det kostsamt i CPU-tid att bygga en tunnel. Det är därför en destination endast tillåts ha max 6 tunnlar IN och 6 UT som transporterar data. Med ett maximum av 50 kb/sek per tunnel, kan en destination använda ca 300kb/sek av kombinerad trafik (i verkligheten kan det vara mer om kortare tunnlar med låg eller ingen anonymitet används) Använda tunnlar kastas bort var 10 minut och nya byggs upp i deras ställe. Detta byte av tunnlar (och ibland klienter som stänger ner abrupt eller situationer med strömförlust) bryter ibland tunnlar och anslutningar, som man kan se på IRC2P i form av förlorad kontakt (ping timeout) eller när man använder eepget.
