Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Fix UTF-8 console passwords, and partial fix for usernames
es: Repara las contraseñas de consola UTF-8, y aplica una arreglo parcial para los nombres de usuario
id: Perbaikan password console UTF-8, dan perbaikan parsial untuk username

source: Fix router family configuration form
es: Corrige el formulario de configuración de familias de routers I2P
id: Perbaikan formulir konfigurasi router family

source: Fix NTP sending random data in some fields that should be zero
es: Corrige un fallo de NTP (protocolo de tiempo de red) al enviar datos aleatorios en algunos campos que deberían ser cero
id: Perbaikan terhadap NTP mengirimkan data acak di beberapa formulir yang seharusnya berisi angka nol

source: More verification of received NTP packets
es: Mayor verificación de paquetes NTP recibidos
id: Lebih banyak verifikasi paket NTP yang diterima

source: Rework resource bundle generation for 20x speedup in build time (requires gettext version 0.19)
es: Remodelado de la generación de paquete de recursos para un incremento de velocidad de 20x en el tiempo de compilación (requiere gettext versión 0.19)
id: Pengubahan pembuatan bundle sumber daya untuk peningkatan kecepatan 20x di waktu pembangunan (memerlukan gettext versi 0,19)

source: ==================== I2P on Maven Central ====================
es: ==================== I2P en Maven Central ====================
id: ==================== I2P di Maven Central ====================

source: The I2P client libraries are now available on Maven Central!
es: ¡Las librerías de cliente I2P están ahora disponibles en Maven Central!
id: Library klien I2P sekarang tersedia di Maven Central!

source: We're nearly half-way into the APIs month of Summer Dev, and making great progress on a number of fronts. I'm happy to announce that the first of these is complete: the I2P client libraries are now available on Maven Central!
es: Estamos a cerca de la mitad de camino en el mes de las APIs del Summer Dev, y estamos haciendo un gran progreso en varios frentes. Me complace anunciar que el primero de estos se ha completado: ¡Las librerías de cliente I2P ahora están disponibles en Maven Central!
id: Kami hampir setengah jalan memasuki bulan API Summer Dev, dan membuat kemajuan besar di sejumlah bidang. Dengan senang hati saya umumkan bahwa yang pertama sudah selesai: library klien I2P sekarang tersedia di Maven Central!

source: This should make it much simpler for Java developers to use I2P in their applications. Instead of needing to obtain the libraries from a current install, they can simply add I2P to their dependencies. Upgrading to new versions will similarly be much easier.
es: Esto debería simplificar mucho a los desarrolladores de Java usar I2P en sus aplicaciones. En lugar de precisar obtener las librerías de una instalación actual, simplemente pueden añadir I2P a sus dependencias. De modo similar, actualizar a nuevas versiones será mucho más fácil.
id: Hal ini seharusnya mempermudah pengembang Java untuk menggunakan I2P dalam aplikasi mereka. Alih-alih perlu mendapatkan library dari pemasangan saat ini, mereka dapat menambahkan I2P ke dependensinya. Upgrade ke versi baru juga akan jauh lebih mudah.

source: How to use them ===============
es: Cómo usarlas ===============
id: Cara menggunakannya ===============

source: There are two libraries that you need to know about:
es: Hay dos librerías de las que precisa tener conocimiento:
id: Ada dua library yang perlu Anda ketahui:

source: The core I2P APIs; you can use these to send individual datagrams.
es: Las APIs centrales de I2P; puede usarlas para enviar datagramas individuales.
id: API inti I2P; Anda dapat menggunakan ini untuk mengirim masing-masing datagrams.

source: A TCP-like set of sockets for communicating over I2P.
es: Un juego de sockets estilo-TCP para comunicarse sobre I2P.
id: Soket-soket mirip TCP untuk berkomunikasi dengan I2P.

source: Add one or both of these to your project's dependencies, and you're good to go!
es: Añada una o ambas a las dependencias de su proyecto, ¡y ya estará listo para seguir!
id: Tambahkan satu atau kedua hal ini ke dependensi proyek Anda, dan Anda dapat memulai pengembangan!

source: Get hacking! ============
es: ¡A hackear! ===========
id: Lakukan hacking! ============

source: ======================== Summer Dev roundup: APIs ========================
es: ========================== Batida de Summer Dev: APIs ==========================
id: ======================== Rangkuman Summer Dev: APIs ========================

source: In the first month of Summer Dev, we have improved the usability of our APIs for Java, Android, and Python developers.
es: Durante el primer mes del Summer Dev (evento de desarrollo de verano), hemos mejorado la usabilidad de nuestras APIs para los desarrolladores de Java, Android y Python.
id: Pada bulan pertama Summer Dev, kami telah meningkatkan kegunaan API kami untuk pengembang Java, Android, dan Python.

source: Summer Dev is in full swing: we've been busy greasing wheels, sanding edges, and tidying the place up. Now it's time for our first roundup, where we bring you up to speed on the progress we are making!
es: Summer Dev está en pleno movimiento: Hemos estado ocupados engrasando las ruedas, puliendo las aristas, y adecentando el lugar. ¡Ahora es momento para nuestra primera batida, donde le plantearemos acelerar el progreso que estamos realizando!
id: Summer Dev sedang dalam kegiatan penuh: kami telah sibuk meminyaki roda, pengamplasan tepian, dan merapikan tempatnya. Sekarang saatnya untuk putaran pertama kami, di mana kami membawa Anda ke kecepatan pada kemajuan yang sedang kami buat!

source: Our goal for this month was to "blend in" - to make our APIs and libraries work within the existing infrastructure of various communities, so that application developers can work with I2P more efficiently, and users don't need to worry about the details.
es: Nuestra meta para este mes era el "amalgamado" - hacer que nuestras APIs y librerías funcionen dentro de la infraestructura existente de varias comunidades, de forma que los desarrolladores de aplicaciones puedan trabajar con I2P de forma más eficiente, y los usuarios no necesiten preocuparse por los detalles.
id: Tujuan kami untuk bulan ini adalah untuk "berbaur" - untuk membuat API dan library kami bekerja dalam infrastruktur yang ada dari berbagai komunitas, sehingga pengembang aplikasi dapat bekerja dengan I2P lebih efisien, dan pengguna tidak tahu detailnya.

source: Other progress --------------
es: Otros progresos --------------
id: Kemajuan lainnya --------------

source: psi has been creating an I2P test network using i2pd, and in the process has found and fixed several i2pd bugs that will improve its compatibility with Java I2P.
es: psi ha estado creando una red de prueba de I2P usando i2pd, y en el proceso ha encontrado y corregido varios fallos de i2pd que mejorarán su compatibilidad con Java I2P.
id: psi telah membuat jaringan uji coba I2P menggunakan i2pd, dan dalam prosesnya telah menemukan dan memperbaiki beberapa bug i2pd yang akan meningkatkan kompatibilitasnya dengan Java I2P.

source: Coming up: Apps month! ======================
es: Próximamente: ¡El mes de las Aplicaciones! =====================================
id: Berikutnya: bulan Aplikasi! ======================

source: There are several other projects that we will be talking with about their plans for I2P integration, and helping with design. Stay tuned!
es: Hay varios otros proyectos con lo que vamos a hablar acerca de sus planes para la integración de I2P, y estaremos ayudándoles con el diseño. ¡Permanezca atento!
id: Ada beberapa proyek lain yang akan dibicarakan dengan rencana integrasi I2P mereka, dan membantu desain. Tetap disini!

source: ============== 0.9.27 Release ==============
es: ============== Versión 0.9.27 ==============
id: ============== Rilis 0.9.27 ==============

source: 0.9.27 contains bug fixes
es: La 0.9.27 contiene correcciones de fallos
id: 0.9.27 memiliki perbaikan bug

source: 0.9.27 contains a number of bug fixes. The updated GMP library for crypto acceleration, which was bundled in the 0.9.26 release for new installs and Debian builds only, is now included in the in-network update for 0.9.27. There are improvements in IPv6 transports, SSU peer testing, and hidden mode.
es: 0.9.27 contiene varias correcciones de fallos. La librería GMP actualizada para aceleración de la criptografía, que fue empaquetada en la versión 0.9.26 sólo para nuevas instalaciones y versiones (builds) de Debian, ahora está incluida en la actualización desde el interior de la red para la 0.9.27. Hay mejoras en transportes IPv6, testeo de pares SSU, y modo oculto.
id: 0.9.27 memiliki beberapa perbaikan bug. Library GMP yang diperbarui untuk percepatan crypto, yang dibundel dalam rilis 0.9.26 untuk pemasangan baru dan versi Debian saja, sekarang dimasukkan ke pembaruan jaringan untuk 0.9.27. Ada peningkatan dalam IPv6 transport, pengujian peer SSU, dan hidden mode.

source: We updated a number of plugins during I2P Summer and your router will automatically update them after restart.
es: Hemos actualizado el número de plugins durante el I2P Summer (evento de verano) y su router I2P los actualizará automáticamente después de reiniciar.
id: Kami memperbarui sejumlah plugin selama I2P Summer dan router Anda akan memperbaruinya secara otomatis setelah restart.

source: GMP 6 (in-net updates)
es: GMP 6 (actualizaciones desde el interior de la red)
id: GMP 6 (pembaruan di dalam jaringan)

source: SSU Peer Testing for IPv6
es: Testeo de pares SSU para IPv6
id: SSU Peer Testing untuk IPv6

source: Add outproxy plugin support for SOCKS
es: Añade soporte para SOCKS al plugin outproxy
id: Tambahan plugin plugin untuk SOCKS

source: Enable desktop GUI (tray icon) on Windows
es: Habilita una interfaz gráfica de escritorio (icono de bandeja de sistema) en Windows
id: Mengaktifkan desktop GUI (ikon tray) di Windows

source: Fix reported GMP version when jbigi built as a shared library
es: Corrije la versión GMP notificada cuando jbigi se compiló como librería compartida
id: Perbaikan versi GMP yang dilaporkan saat jbigi dibangun sebagai shared library

source: Fix SSU peer test happening too frequently
es: Corrije la realización demasiado frecuente del test de pares SSU
id: Perbaiki mengujian peer SSU terlalu sering terjadi

source: Fix SSU peer test not terminating properly in some cases
es: Corrije la no adecuada conclusión en algunos casos del test de pares SSU
id: Perbaikan pengujian peer SSU tidak dihentikan dengan benar dalam beberapa kasus

source: Fix bote plugin not working in Debian/Ubuntu builds
es: Corrije el mal funcionamiento del plugin bote en versiones (builds) de Debian/Ubuntu
id: Perbaikan plugin bote yang tidak berfungsi di Debian / Ubuntu

source: Fix rare UPnP NPE when viewing /peers
es: Corrije una rara excepción de puntero nulo (NPE) de UPnP al ver /peers
id: Perbaikan NPN UPnP langka saat viewing/peer

source: Fix standalone i2psnark build and configuration
es: Corrije la versión individual de i2psnark y su configuración
id: Perbaikan standalone i2psnark build and configuration

source: Hidden mode improvements: Enable tunnel testing and use fast peers
es: Mejoras del modo oculto: Habilita testeo de túnel y usa pares rápidos
id: Perbaikan hidden mode: mengaktifkan pengujian tunnel dan gunakan fast peers

source: Fix possible CSRF in SusiMail
es: Corrige una vulnerabilidad contra potenciales ataques CSRF en SusiMail
id: Perbaikan CSRF yang mungkin terjadi di SusiMail

source: Fix i2psnark exception on bad configured announce URL
es: Corrije una excepción de i2psnark en torno a una URL de anunciamiento mal configurada
id: Perbaiki i2psnark exception pada announce URL yang dikonfigurasi dengan buruk

source: Fix layout issues on i2ptunnel registration page
es: Corrije problemas de diseño en la página de registro de i2ptunnel
id: Perbaikan masalah tata letak di halaman pendaftaran i2ptunnel

source: Fix streaming accept() hang when session disconnects
es: Corrige un fallo de accept() del transporte streaming cuando la sesión desconecta
id: Perbaikan streaming accept() yang menjadi hang saat session terputus

source: Split up the large /configclients web page into several
es: Divide la página web de gran tamaño /configclients en varias
id: Pisahkan halaman web besar /configclients menjadi beberapa

source: Add links to view complete router and wrapper log files
es: Añade enlaces para ver los ficheros de registro (log) del router y encapsulador como servicio (wrapper)
id: menambahkan link untuk melihat file log router dan wrapper yang lengkap

source: Block 'Proxy' header in i2ptunnel (HTTPoxy)
es: Bloquea la cabecera 'Proxy' en i2ptunnel (HTTProxy)
id: Blokir 'Proxy' di i2ptunnel (HTTPoxy)

source: Recognize Kaby Lake CPUIDs
es: Reconoce identificadores de CPU Kaby Lake
id: Mengenali CPUID milik prosesor Kaby Lake

source: ============== 0.9.28 Release ==============
es: ============== Versión 0.9.28 ==============
id: ============== Rilis 0.9.28 ==============

source: 0.9.28 contains bug fixes
es: La 0.9.28 contiene correcciones de fallos
id: 0.9.28 memiliki perbaikan bug

source: 0.9.28 contains fixes for over 25 Trac tickets, and updates for a number of bundled software packages including Jetty. There are fixes for the IPv6 peer testing feature introduced last release. We continue improvements to detect and block peers that are potentially malicious. There are preliminary fixes for Java 9, although we do not yet recommend Java 9 for general use.
es: La 0.9.28 contiene correcciones para más de 25 tickets de Trac, y actualizaciones para varios de los paquetes de software integrados, incluido Jetty. Hay correcciones para la característica de testeado del par IPv6 introducida en la última versión. Continuamos las mejoras para detectar y bloquear pares que son potencialmente maliciosos. Hay correcciones preliminares para Java 9, sin embargo aún no recomendamos Java 9 para uso general.
id: 0.9.28 berisi perbaikan untuk lebih dari 25 tiket Trac, dan update untuk sejumlah paket perangkat lunak paket termasuk Jetty. Ada perbaikan untuk fitur IPv6 peer testing yang diperkenalkan rilis terakhir. Kami melanjutkan perbaikan untuk mendeteksi dan memblokir peer yang berpotensi merusak. Ada perbaikan awal untuk Java 9, walaupun kami belum merekomendasikan Java 9 untuk penggunaan umum.

source: I2P will be at 33C3, please stop by our table and give us your ideas on how to improve the network. We will review our 2017 roadmap and priorities 2017 at the Congress.
es: I2P estará en el 33C3, por favor, haga una parada en nuestro puesto y cuéntenos sus ideas sobre cómo mejorar la red. Revisaremos nuestra hoja de ruta y prioridades para 2017 en este congreso.
id: I2P akan berada di 33C3, silakan mampir ke meja kami dan beri kami ide untuk memperbaiki jaringan I2P. Kami akan meninjau roadmap prioritas 2017 kami di Congress.

source: Fix version test for SSU IPv6 peer testing
es: Corrección del test de versión para el testeado de par vía SSU IPv6
id: Perbaikan SSU Peer Testing untuk IPv6

source: Fix generation of keys for SSL console
es: Corrección de la generación de claves para la consola SSL
id: Perbaiki pembuatan kunci untuk SSL console

source: Fix uploader limit in i2psnark
es: Corrige el límite para el gestor de subida en i2psnark
id: Perbaikan batas uploader di i2psnark

source: Fix susimail nonce error on login after logout
es: Corrige un error actual de susimail al iniciar sesión tras un cierre de sesión
id: Perbaikan kesalahan susimail nonce saat login setelah logout

source: Fixes for Java 9
es: Correcciones para Java 9
id: Perbaikan untuk Java 9

source: Allow Java 9 in packages
es: Permite Java 9 en los paquetes
id: Mengizinkan Java 9 di dalam paket

source: Add warning for Java 9, not yet recommended
es: Añade una advertencia de no recomendación para Java 9
id: Tambahan peringatan untuk Java 9, belum disarankan

source: Preliminary fixes for use with Tomcat 8
es: Correcciones preliminares para el uso con Tomcat 8
id: Perbaikan awal untuk penggunaan dengan Tomcat 8

source: Improved self-signed certificates
es: Certificados auto-firmados mejorados
id: Peningkatan sertifikat self-signed

source: Increase max IPv6 MTU (proposal #127)
es: Incremento del máximo MTU de IPv6 (propuesta #127)
id: Peningkatan maksimum IPv6 MTU (proposal #127)

source: Caching of serialized leasesets
es: Almacenamiento en caché de leasesets serializados
id: Caching leasesets serial

source: Peer selection updates
es: Actualizaciones de la selección de par
id: Pembaruan pilihan peer

source: Restrictions in peer selection for netdb verifies
es: Restricciones en la selección de par para verificaciones de netdb
id: Pembatasan seleksi peer untuk verifikasi netdb

source: New advanced netdb search form
es: Nuevo formulario de búsqueda avanzada de netdb
id: Formulir baru untuk pencarian netdb tingkat lanjut

source: Sybil tool enhancements
es: Mejoras de la herramienta Sybil
id: Peningkatan perangkat Sybil

source: Blocklist updates in news feed
es: Actualizaciones de la lista de bloqueo en el surtidor de novedades
id: Pembaruan blocklis di news feed

source: Support IPv6 in blocklist
es: Soporte IPv6 en la lista de bloqueo
id: Dukungan IPv6 di blocklist

source: Add Java version to jar manifests
es: Añade la versión de Java a los manifiestos de los jar
id: Tambahan versi Java ke jar manifest

source: Remove dead console home page links
es: Elimina los enlaces muertos a la página principal de la consola
id: Menghapus tautan yang tidak valid di console home page

source: Add initial news to bottom of full news page
es: Añade noticias iniciales al final de la página de noticias completas
id: Tambahan berita awal ke bagian bawah halaman berita lengkap

source: Fix periodic re-logging of dup log messages
es: Corrige el re-registrado de mensajes duplicados de registro (log)
id: Perbaikan pembuatan log dari pesan dup log yang terjadi secara berkala

source: Periodic saving of profiles and i2psnark DHT nodes
es: Guardado periódico de perfiles y nodos DHT de i2psnark
id: Penyimpanan profil yang node i2psnark DHT yang terjadi rutin

source: Catch rare UPnP exceptions
es: Identificación de excepciones UPnP raras
id: Menangkap UPnP exception langka

source: Add logout button to more susimail pages
es: Añade un botón de cierre de sesión a más páginas de susimail
id: Tambahkan yang lebih banyak untuk tombol logout di halaman susimail

source: Truncate history.txt in installers
es: Trunca history.txt en los instaladores
id: Pemotongan history.txt di installer

source: Use NTCP even before SSU minimums are met or SSU is broken
es: Usa NTCP incluso antes de que se alcancen los mínimos de SSU o de que SSU falle
id: Penggunaan NTCP bahkan sebelum minimum SSU terpenuhi atau jika SSU rusak

source: Reduce default tunnel build records to 4
es: Reduce a 4 por defecto los registros de creación de túnel
id: mengurangi tunnel default build record menjadi 4

source: Improved IPv6 address selection
es: Selección mejorada de dirección IPv6
id: Peningkatan pilihan alamat IPv6

source: Add force-firewalled IPv6 setting
es: Añade opción forzar-bloqueado-por-firewall para IPv6
id: Tambahan pengaturan IPv6 dengan kekuatan firewall

source: Improved handling of webapps that fail to start
es: Manejo mejorado de aplicaciones web que no logran inciarse
id: Meningkatkan penanganan webapps yang gagal untuk memulai

source: New configuration for test networks
es: Nueva configuración para redes de prueba
id: Konfigurasi untuk jaringan tes

source: Remove deprecated Sha256Standalone, Syndie 1.105 must upgrade
es: Elimina el obsoleto Sha256Standalone, Syndie 1.105 debe actualizarse
id: Menghapus Sha256Standalone usang, Syndie 1.105 harus diperbarui

source: Actually use a random nonzero byte in ElGamal, as specified
es: Uso efectivo de un byte distinto-de-cero aleatorio en ElGamal, tal cual está especificado
id: Benar-benar menggunakan satu byte bukan nol acak di ElGamal, sebagaimana ditentukan

source: Disallow RSA for netdb entries
es: Desautoriza RSA para entradas de la netdb
id: Melarang RSA untuk entri netdb

source: Add library jars to jar classpath for Debian builds
es: Añade jars de librería al classpath de jar para versiones Debian
id: Menambahkan library jar untuk jar classpath untuk Debian

source: Remove old systray code
es: Elimina el código antiguo de la bandeja de sistema
id: Menghapus kode systray lama

source: Fix low-memory warnings without wrapper
es: Corrige advertencias de memoria-baja sin encapsulado
id: Perbaikan peringatan memori rendah tanpa wrapper

source: Various code consolidation and cleanup
es: Distintas consolidaciones y limpieza de código
id: Berbagai konsolidasi kode dan pembersihan

source: New translations: Galician, Korean
es: Nuevas traducciones: Gallego, Coreano
id: Terjemahan baru: Galisia, Korea

source: New translations for some subsytems: Chinese (Taiwan)
es: Nuevas traducciones para algunos subsistemas: Chino (Taiwán)
id: Terjemahan baru untuk beberapa subsytems: Mandarin (Taiwan)

source: ============== 0.9.29 Release ==============
es: ============== Versión 0.9.29 ==============
id: ============== Rilis 0.9.29 ==============

source: 0.9.29 contains bug fixes
es: La 0.9.29 contiene correcciones de fallos
id: 0.9.29 memiliki perbaikan bug

source: 0.9.29 contains fixes for numerous Trac tickets, including workarounds for corrupt compressed messages. We now support NTP over IPv6. We've added preliminary Docker support. We now have translated man pages. We now pass same-origin Referer headers through the HTTP proxy. There are more fixes for Java 9, although we do not yet recommend Java 9 for general use.
es: La 0.9.29 contiene correcciones para numerosos tickets de Trac, incluyendo soluciones auxiliares para mensajes comprimidos corruptos. Ahora soportamos NTP sobre IPv6. Hemos añadido soporte preliminar para Docker. Ahora tenemos páginas man traducidas. Ahora pasamos las cabeceras Referer con 'same-origin' (mismo origen) a través del proxy HTTP. Hay más correcciones para Java 9, aunque aún no recomendamos Java 9 para uso general.
id: 0.9.29 berisi perbaikan untuk berbagai tiket Trac, termasuk workarounds untuk pesan terkompresi yang korup. Kami sekarang mendukung NTP melalui IPv6. Kami telah menambahkan dukungan awal Docker. Kami sekarang telah menerjemahkan halaman manual. Kami sekarang melewatkan same-origin Referer headers melalui proxy HTTP. Ada lebih banyak perbaikan untuk Java 9, walaupun kami belum merekomendasikan Java 9 untuk penggunaan umum.

source: Fixes for Java 9, still not recommended for general use
es: Correcciones para Java 9, que aún no se recomienda para uso general.
id: Perbaikan untuk Java 9, masih tidak direkomendasikan untuk penggunaan umum

source: NTP fixes for security and standards
es: Correcciones de NTP para seguridad y adhesión a estándares
id: perbaikan NTP untuk keamanan dan standar

source: NTP IPv6 support
es: Soporte NTP IPv6
id: Dukungan NTP IPv6

source: Don't display very old news in console
es: No muestra novedades muy antiguas en la consola
id: Tidak menampilkan berita yang sangat tua di console

source: Blocklist checking improvements
es: Mejoras de la comprobación de la lista de bloqueo
id: Peningkatan dalam pemeriksaan blocklist

source: Add preliminary Docker support
es: Añade soporte preliminar para Docker
id: Menambahkan dukungan awal untuk Docker

source: Add Referrer-Policy headers to console
es: Añade cabeceras Referrer-Policy a la consola
id: Tambahan header Referrer-Policy untuk console

source: Pass same-origin Referer headers through proxy
es: Pasa las cabeceras Referer 'same-origin' a través de proxy
id: Meluluskan header same-origin melalui proxy
