Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: RELEASE DETAILS
es: DETALLES DEL LANZAMIENTO
id: RINCIAN RILIS

source: Major Changes
es: Cambios más importantes
id: Perubahan Besar

source: Bug Fixes
es: Correcciones de errores
id: Perbaikan Bug

source: Other
es: Otro
id: Lainnya

source: SHA256 Checksums:
es: Sumas de comprobación SHA256:
id: Checksum SHA256:

source: Major changes
es: Cambios mayores
id: Perubahan besar

source: Wrapper Update
es: Actualización del Wrapper
id: Pembaruan Wrapper

source: Update Info
es: Información de la actualización
id: Info Pembaruan

source: Files are available on the `download page`_.
es: Los archivos están disponibles en la `página de descargas`_.
id: File sudah tersedia di `halaman unduhan`_.

source: `download page`
es: `Página de Descargas`
id: `halaman unduhan`

source: 0.9.2 Release
es: Versión 0.9.2
id: 0.9.2 Rilis

source: 0.9.2 includes extensive low-level changes to improve the performance and efficiency of the router. We have updated our UPnP library, to hopefully make UPnP work for more people. I2PSnark now has DHT support, but it is not yet enabled by default, as we plan to do more testing during the upcoming 0.9.3 development cycle.
es: 0.9.2 incluye muchos cambios de bajo nivel para la mejora y eficiencia del ruter. Hemos actualizado la librería UPnP, para hacer que UPnP funcione para mas gente. I2PSnark ahora soporta DHT, pero no está activo por defecto, ya que tenemos planeado hacer más pruebas durante la el próximo ciclo de desarrollo de 0.9.3
id: 0.9.2 mencakup perubahan pada tingkat rendah yang luas untuk meningkatkan kinerja dan efisiensi router. Kami telah memperbarui pustaka UPnP kami, dengan harapan untuk membuat UPnP dapat bekerja untuk lebih banyak orang. I2PSnark saat ini telah mendukung DHT tapi tidak diaktifkan secara default karena kami berencana untuk melakukan pengujian lebih banyak lagi selama siklus pengembangan 0.9.3 yang akan datang.

source: As usual, there's also lots of bug fixes in this release, so updating is recommended.
es: Como es habitual, hay muchos cambios y arreglos en esta versión, recomendamos actualizar.
id: Seperti biasa, ada banyak bug untuk diperbaiki pada rilis ini, jadi pembaruan sangat direkomendasikan.

source: SSU: Fix several problems in our UDP transport, to improve efficiency and reliability for connection setup. Also improve defenses against various types of bad input.
es: SSU: Arreglados varios problemas en el trasporte UDP, para mejorar la eficiencia y la fiabilidad en la conexión. También se han mejorado las defensas contra varios tipos de ataques por entradas malformadas.
id: SSU: Memperbaiki beberapa masalah pada transport UDP kami, untuk meningkatkan efisiensi dan kehandalan untuk setup koneksi. Juga meningkatkan pertahanan terhadap beragam jenis input yang buruk.

source: UPnP: Updated our library to fix several issues, should work for more routers now
es: UPnP: Librería actualizada para arreglar varios errores, ahora debería funcionar en más ruters.
id: UPnP: Memperbarui pustaka kami untuk memperbaiki beberapa masalah, akan bekerja pada lebih banyak router sekarang.

source: Transport: Improve performance in both our TCP and UDP transports, to benefit high-bandwidth routers
es: Transporte; Mejora del rendimiento en TCP y UDP, para aprovechar los ruters con mucho ancho de banda.
id: Transport: Meningkatkan kinerja pada kedua transport TCP dan UDP kami, untuk menikmati router dengan bandwidth tinggi

source: Crypto: The thresholds and number of ElGamal/AES Session Tags delivered are now much more flexible, which should lessen protocol overhead and reduce stalls caused by dropped tags.
es: Cifrado: Los umbrales y valores de las etiquetas de sesión ElGamal/AES ahora son mucho más flexibles, lo que debería hacer que hayan menos sobrecarga y reduzca los rodeos causados por las etiquetas caídas.
id: Crypto: Ambang batas dan jumlah ElGamal/AES Session Tags yang dikirimkan kini lebih fleksibel, yang seharusnya mengurangi overhead pada protokol dan mengurangi stall yang disebabkan oleh tags yang menurun.

source: I2PSnark: Add DHT support, not yet enabled by default, will do further testing and plan to enable by default in 0.9.3.
es: I2PSnark: Añadido soporte para DHT, no activado por defecto todavía, se harán más pruebas y se activará por defecto en la versión 0.9.3.
id: I2PSnark: Menambahkan dukungan DHT, tidak diaktifkan secara default, akan melakukan pengujian lebih lanjut dan berencana untuk mengaktifkannya secara default di 0.9.3.

source: Fix various issues affecting memory usage and performance on high-bandwidth routers
es: Arreglados varios problemas que afectaban al uso de memoria y al rendimiento de los ruters con un gran ancho de banda.
id: Perbaikan beragam masalah yang mempengaruhi penggunaan memori dan kinerja pada router dengan bandwidth tinggi

source: Fix problems in UDP for routers using a reduced-MTU connection, e.g. a VPN
es: Arreglado el problema en UDP para los ruters que usan una conexión MTU reducida, por ejemplo VPN
id: Perbaikan masalahn pada UDP untuk router yang menggunakan koneksi pengurangan MTU, misalnya VPN

source: Fix i2psnark bug that prevented a completion announcement to the tracker
es: Arreglado el problema de i2psnark que evitaba la finalización del anuncio en los trackers
id: Memperbaiki bug i2psnark yang mencegah sebuah penyelesaian pengumuman ke tracker

source: Fix a lock contention problem in i2ptunnel
es: Arreglado un problema de contención de bloqueos en el i2ptunnel
id: Memperbaiki masalah lock contention di i2ptunnel

source: Fix some OSX installation issues
es: Corregidos algunos problemas de instalación en OSX
id: Memperbaiki beberapa masalah instalasi OSX

source: Remove uses of direct byte buffers that may have been leaking
es: Eliminado el uso de byte buffers directos que podrían haber estado filtrando información
id: Menghapus penggunaan langsung byte buffer yang mungkin bocor

source: Reduce overhead in network messages
es: Reducida la sobrecarga en los mensajes de la red
id: Mengurangi overhead dalam jaringan pesan

source: Add "universal" theme support
es: Añadido soporte para el tema "universal"
id: Menambahkan dukungan tema "universal"

source: Theme updates
es: Actualizaciones en los temas
id: Pembaruan tema

source: Add a jbigi library for Raspberry Pi
es: Añadida una biblioteca jbigi para Raspberry Pi
id: Menambahkan sebuah library jbigi untuk Raspberry Pi

source: New Scala unit test framework
es: Nuevo sistema de unit test Scala
id: Kerangka unit tes Scala baru

source: Translation updates for Czech, Dutch, German, and Greek
es: Actualizaciones de las traducciones al checo, holandés, alemán y griego
id: Pembaruan Terjemahan untuk bahasa Ceko, Belanda, Jerman, dan Yunani

source: Update wrapper to 3.5.15 (new installs and PPA only)
es: Actualización del wrapper a la versión 3.5.15 (sólo para nuevas instalaciones y PPA)
id: Pembaruan wrapper ke 3.5.15 (hanya untuk instalasi baru dan PPA)

source: Update GeoIP data (new installs and PPA only)
es: Actualizar datos de geolocalización IP (Sólo PPA y nuevas instalaciones)
id: Perbaruan data GeoIP (hanya instalasi dan PPA baru)

source: 0.9.3 Release
es: Versión 0.9.3
id: 0.9.3 Rilis

source: 0.9.3 includes extensive low-level changes to the queueing of messages in the router. We implement the CoDel Active Queue Management (AQM) algorithm. We also unify the queueing and priority mechanisms in the transports to aid diagnosis and reduce network latency. Work continues on fixing UDP transport bugs and making UDP more resistant to attacks. There are more changes to improve the performance of the router and reduce its memory usage. Also, we enable i2psnark's DHT support, introduced last release, by default.
es: 0.9.3 incluye muchos arreglos de bajo nivel en la cola de mensajes en el ruter. Hemos implementado el algoritmo CoDel Active Queue Management (AQM). También hemos unificado los mecanismos de prioridades y colas en los transportes para ayudar al diagnóstico y reducir la latencia de la red. El trabajo continua arreglando el transporte UDP haciéndolo mas resistente a los ataques. Hay mas cambios para mejorar el rendimiento del ruter y reducir el uso de memoria. Además, hemos habilitado por defecto el suporte, introducido en la versión anterior, para DHT en i2psnark.
id: 0.9.3 termasuk perubahan tingkat rendah yang luas untuk antrian pesan di router. Kami menerapkan algoritma Active Queue Management (AQM) CoDel. Kami juga menyatukan mekanisme antrian dan prioritas di dalam transport untuk membantu diagnosis dan mengurangi latensi jaringan. Usaha terus dilakukan untuk memperbaiki bug UDP transport dan membuat UDP lebih tahan terhadap serangan. Ada lebih banyak perubahan untuk meningkatkan kinerja router dan mengurangi penggunaan memori. Selain itu, kami mengaktifkan dukungan i2psnark's DHT, yang diperkenalkan di rilis terakhir, secara default.

source: Priority queues
es: Listas de prioridades.
id: Antrian prioritas

source: I2PSnark DHT: Several bug fixes, enable by default.
es: DHT de I2PSnark: Solución de varios errores, activo por defecto.
id: I2PSnark DHT: beberapa perbaikan bug, diaktifkan secara default.

source: Several SSU fixes including memory leak, and better handling of routers behind firewalls that change UDP ports; additional defenses for malicious packets.
es: Varios arreglos en el SSU incluyendo la fuga de memoria, y mejor manejo de de los ruters detrás de cortafuegos que han cambiado sus puertos UDP; defensa extra contra paquetes maliciosos.
id: Beberapa perbaikan SSU termasuk kebocoran memori, dan penanganan yang lebih baik dari router yang berada di belakang firewall yang mengubah port UDP; Pertahanan tambahan untuk paket-paket yang berbahaya.

source: Fix piece selection (rarest-first) bugs in i2psnark
es: Solucionar fallos en la selección de porciones (las más raras primero) en i2psnark
id: Memperbaiki bug seleksi potongan (paling langka - pertama) di i2psnark

source: Fix bug causing multiple browsers to open at startup
es: Arreglo del error que causaba que se abriesen varios navegadores al iniciar.
id: Memperbaiki bug yang menyebabkan banyak peramban atau browser terbuka pada saat startup

source: Improvements in caching
es: Mejoras en almacenamiento en caché
id: Perbaikan dalam cache

source: Several synchronization fixes and lock contention reduction
es: Varios arreglos en la sincronización y reducción de la contención del bloqueo
id: Beberapa perbaikan sinkronisasi dan pengurangan lock contention

source: Major reduction in SSU buffers memory use
es: Gran reducción en el uso de buffers de memoria en SSU
id: Pengurangan besar di penggunaan buffer SSU

source: Fix streaming connection timeout back to 1 minute, was inadvertently changed to 5 minutes; set i2ptunnel server read timeout to 5 minutes, was unlimited
es: Revertir tiempo máximo de respuesta de la conexión a 1 minuto, fue cambiado inadvertidamente a 5 minutos; establecer el tiempo máximo de lectura del servidor i2ptunnel, era ilimitado.
id: Memperbaiki timeout koneksi streaming kembali ke 1 menit, yang pernah tanpa sengaja terubah ke 5 menit; menentukan server i2ptunnel read timeout sampai 5 menit, menjadi tidak terbatas

source: Improved defenses in i2ptunnel for "darkloris"
es: Defensas mejoradas en i2ptunnel para "darkloris"
id: Peningkatan pertahanan i2ptunnel untuk "darkloris"

source: More validation at torrent creation in i2psnark
es: Más verificación a la creación del torrent en i2psnark
id: Validasi lebih pada penciptaan torrent di i2psnark

source: Several parameter changes in SSU to improve throughput
es: Varios cambios de parámetro en SSU para mejorar el rendimiento
id: Beberapa perubahan parameter dalam SSU untuk meningkatkan throughput

source: New event log for major events including restarts; show multiple restart lines on graphs
es: Nuevo registro de eventos para eventos principales incluyendo reinicios; muestra múltiples líneas de reinicio en los gráficos.
id: Log peristiwa baru untuk event besar termasuk restart; menampilkan lebih banyak baris restart di grafik

source: Remove duplicate messages from logs
es: Eliminar mensajes duplicados de los registros
id: Menghapus pesan duplikat dari log

source: Don't respond to blocked streaming connections with a reset, just drop
es: No responder a conexiones de flujos multimedia (streaming) bloqueadas con un restablecimiento, simplemente desistir.
id: Tidak menanggapi koneksi streaming yang diblokir dengan reset, langsung di-drop

source: Remove all uses of inefficient SimpleTimer
es: Eliminar todos los usos del inficiente SimpleTimer
id: Menghapus semua penggunaan SimpleTimer yang tidak efisien

source: More checks for valid IPs and ports entered in console
es: Más verificaciones de IPs y puertos válidos introducidos en la consola
id: Memeriksa lebih untuk IP dan port yang valid yang dimasukkan di console

source: Fix bug that wasted a lot of entropy
es: Solucionar fallo que desperdiciaba mucha entropía
id: Memperbaiki bug yang menyia-nyiakan banyak entropi

source: Translation updates: Italian, Portuguese, Spanish, Swedish
es: Actualizaciones de traducciones: italiano, portugués, español, y sueco
id: Pembaruan terjemahan: Italia, Portugis, Spanyol, Swedia

source: Add non-NIO configuration in jetty.xml, recommended for Java 5
es: Añadir configuración que NO es del tipo NIO a Jetty.xml, recomendado a partir de Java 5
id: Menambahkan konfigurasi non-NIO di jetty.xml, yang dianjurkan untuk Java 5

source: 0.9.4 Release
es: Versión 0.9.4
id: 0.9.4 Rilis

source: 0.9.4 includes a fix for a network capacity bug, introduced in 0.9.2, that was reducing network performance and reliability. It also includes major changes in the in-network update system, and adds the capability to update via in-network torrents.
es: 0.9.4 incluye un arreglo de la capacidad de la red, introducido en 0.9.2, que estaba reduciendo el rendimiento y fiabilidad de la red. Además incluye cambios en el sistema de actualización de la red, y añade la capacidad de actualizar a través de torrents de dentro de la red I2P.
id: 0.9.4 berisi perbaikan bug kapasitas jaringan, yang diperkenalkan di 0.9.2, yang mengurangi kinerja dan kehandalan jaringan. Juga mencakup perubahan besar dalam sistem pembaruan di jaringan, dan menambahkan kemampuan untuk update melalui dalam jaringan torrent.

source: We fixed several bugs in the i2psnark DHT implementation that was introduced last release. For those of you using console or http proxy passwords, we converted to the more-secure digest method and improved the security for console forms.
es: Hemos arreglado varios errores en los cambios introducidos de la última versión liberada. Para todos quienes usáis consola o proxy's http con contraseña, hemos aumentado y mejorado la seguridad para los formularios de consola
id: Kami memperbaiki beberapa bug di implementasi i2psnark DHT yang diperkenalkan di rilis terakhir. Bagi Anda yang menggunakan console atau http proxy password, kami mengubahnya ke metode digest yang lebih aman dan meningkatkan keamanan untuk console form.

source: For those of you already running development builds, your router should automatically update to 0.9.4-0 using the new in-network torrent facility. For those running 0.9.3-0, you will update normally using in-network HTTP, and we will have more information for you when we release 0.9.5.
es: Para aquellos que todavía ejecutan versiones de desarrollo, su ruter debería actualizarse automáticamente a la versión 0.9.4-0 usando la nueva vía a través de torrent. Para aquellos usando la versión 0.9.3-0, se actualizará normalmente usado HTTP, y tendremos más información sobre el tema cuando liberemos la versión 0.9.5.
id: Bagi Anda yang telah menjalankan development built, router Anda seharusnya secara otomatis update ke 0.9.4-0 menggunakan fasilitas baru di jaringan torrent. Untuk orang-orang yang menjalankan versi 0.9.3-0, Anda akan memperbarui seperti biasa menggunakan HTTP dalam jaringan, dan kami akan memiliki lebih banyak informasi untuk Anda ketika kami merilis versi 0.9.5.

source: Big rework of the update system; Preliminary support for updates via i2psnark
es: Gran trabajo supervisado para la actualización del sistema; soporte preliminar para actualizaciones vía i2psnark
id: Pembaruan besar di sistem pembaruan; Dukungan awal untuk update melalui i2psnark

source: Add per-destination outbound priorities
es: Añadir
id: Menambahkan prioritas keluar per-destinasi

source: Fix major bug that reduced SSU connection limits which reduced tunnel build success rates
es: Arreglado un error grave para reducir el límite de conexión SSU, el cual reducía las posibilidades de éxito al crear un tunel
id: Memperbaiki bug besar yang mengurangi batas koneksi SSU, yang mengurangi tingkat keberhasilan membangun tunnel

source: Fix bug with external I2CP that prevented some external apps from working
es: Corregido un error del panel de control i2P EXTERNO que impedía el funcionamiento de aplicaciones externas
id: Memperbaiki bug dengan I2CP eksternal yang mencegah beberapa aplikasi eksternal untuk berfungsi

source: Fixed several bugs in i2psnark DHT
es: Corregidos varios errorres en i2psnark DHT
id: Memperbaiki beberapa bug di i2psnark DHT

source: Fixed bug in i2psnark PEX that inflated peer counts
es: Corregido un error en ip2snark PEX que descuadraba los pares de cuentas
id: Memperbaiki bug di i2psnark PEX yang membesarbesarkan jumlah peer

source: Handle dropped I2CP messages better
es: Manejar mejor los mensajes I2CP descartados
id: Handle menolak pesan-pesan I2Cp secara lebih baik

source: Reduce overhead of I2CP messages
es: Reducir la sobrecarga de mensajes del panel de control I2P (I2CP)
id: Mengurangi overhead pesan I2CP

source: Enforce max size in transport outbound message queues
es: Se fija el tamaño máximo para el transporte de las colas de los mensajes de salida
id: Menegakkan ukuran maksimum di dalam antrian transport pesan keluar

source: Fixes for Windows eepget.bat (new installs and PPA only)
es: Correcciones para el archivo de Windows "eepget.bat" (sólo PPA y nuevas instalaciones)
id: Memperbaiki Windows eepget.bat (hanya untuk instalasi dan PPA baru)

source: Fix a bug that would drop messages of exactly 512 bytes in SSU
es: Arreglado un error que deshechaba los mensajes de 512 bytes en SSU
id: Memperbaiki bug yang akan menolak pesan tepat sebesar 512 byte di SSU

source: More performance improvements, memory reduction, and object churn reduction
es: Otras optimizaciones de rendimiento, reducción de memoria y de los objetos CHURN
id: Peningkatan kinerja lebih banyak, pengurangan penurunan memori dan objek churn

source: Better detection of network disconnections
es: Mejor detección de caídas y desconexión de red
id: Deteksi lebih baik untuk koneksi jaringan yang terputus

source: Further improvements in the SSU transport
es: Mejora en el transporte SSU
id: Penyempurnaan lebih jauh dalam transport SSU

source: Add console password form
es: Añadido formulario de contraseña en consola
id: Menambahkan formulir password di console

source: Convert http proxy and console from basic to digest authentication for added security
es: Se ha cambiado el proxy http y la consola para aceptar autenticación y se ha añadido más seguridad.
id: Mengkonversi http proxy dan console form basic ke otentikasi digest untuk keamanan tambahan

source: Improved verification of console form submissions, using jsp sessions. Cookies may now be required on forms, except when the console password is enabled
es: Mejorada la verificación de los formularios de la consola, usando sesiones jsp. Puede ser que ahora los formularios requieran cookies, excepto cuando la contraseña de la consola esté activada.
id: Meningkatkan verifikasi untuk penyerahan formulir consile, menggunakan sesi jsp. Cookie sekarang mungkin diperlukan untuk formulir, kecuali ketika password console diaktifkan

source: Initial work on new interfaces to manage applications started via clients.config
es: TRabajo inicial en nuevos interfaces pata manejar las palicaciones que se arranquen vía
id: Pembuatan antarmuka baru untuk mengatur aplikasi, dimulai melalui clients.config

source: Increase minimum peer port to 1024
es: Aumentar el número de puerto más bajo a 1024
id: Meningkatkan port peer minimum menjadi 1024

source: Increase granularity of bandwidth limiter for smoother transmissions
es: Aumentada el nivel de detalle del limitador del ancho de banda para obtener conexiones más suaves.
id: Meningkatkan granularity bandwidth limiter untuk transmisi lebih halus

source: Translation updates: Chinese, French, German, Italian, Polish, Portuguese, Swedish, and Ukrainian
es: Traducciones actualizadas: chino, francés, alemán, italiano, polaco, portugués, sueco y ucraniano
id: Pembaruan terjemahan: Mandarin, Perancis, Jerman, Italia, Polandia, Portugis, Swedia, dan Ukraina

source: Update wrapper to 3.5.16 (new installs and PPA only)
es: Wrapper actualizado a 3.5.16 (sólo en instalaciones nuevas y PPA)
id: Update wrapper ke 3.5.16 (hanya untuk install baru dan PPA)

source: New ARMv6 wrapper for Raspberry Pi
es: Nuevo wrapper ARMv6 para el
id: Wrapper ARMv6 baru untuk Raspberry Pi

source: 0.9.5 Release
es: Versión 0.9.5
id: 0.9.5 Rilis

source: 0.9.5 includes bug fixes and defenses for some issues and vulnerabilities that are being investigated by researchers at UCSB. We continue to work with them on additional improvements. This is a good opportunity to remind the community that while our network continues to grow rapidly, it is still relatively small. There may be multiple weaknesses or bugs that could compromise your anonymity. Help us grow the network by spreading the word and contributing where you can.
es: La versión 0.9.5 incluye arreglos de errores y defensas para algunos problemas y vulnerabilidades que están siendo estudiadas por investigadores en el UCSB. Seguimos trabajando con ellos en algunas mejoras. Esta es una buena oportunidad para recordar a la comunidad, que aunque la red crece rápido, todavía es relativamente pequeña. Podrían haber múltiples debilidades y errores que podrían comprometer su anonimato. Ayúdenos a hacer crecer la red difundiendo la palabra y contribuyendo donde pueda.
id: 0.9.5 mencakup perbaikan bug dan pertahanan untuk beberapa masalah dan kerentanan yang sedang diselidiki oleh para peneliti di UCSB. Kami terus bekerja dengan mereka untuk perbaikan tambahan. Ini adalah kesempatan yang baik untuk mengingatkan komunitas bahwa walaupun jaringan kami terus berkembang pesat, jaringan ini masih relatif kecil. Mungkin ada beberapa kelemahan atau bug yang dapat membahayakan anonimitas Anda. Bantu kami mengembangkan jaringan dengan menyebarkan berita dan berkontribusi di mana Anda dapat melakukannya.

source: In this upgrade cycle, a random 1%(pc)s of routers, (plus all routers running a development build) will attempt to update via the experimental in-network bittorrent with i2psnark. If this doesn't work, it should fall back to standard in-network HTTP update.
es: En esta actualización, un 1%(pc)s aleatorio de los routers I2P (más todos los routers I2P que ejecutan la versión de desarrollo) intentarán actualizarse a través del bittorrent experimental interno-a-la-red con i2psnark. Si no funciona, debe recurrir a la actualización HTTP interna-a-la-red estándar.
id: Dalam siklus upgrade ini, sejumlah 1%(pc)s router secara acak (ditambah semua router yang menjalankan development built) akan berusaha memperbarui melalui bittorrent di jaringan eksperimental dengan i2psnark. Jika ini tidak berhasil, ini kembali ke standar di pembaruan HTTP standar.

source: Defenses and Bug Fixes
es: Defensa y arreglo de errores.
id: Pertahanan dan Perbaikan Bug
