Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Startup should be faster on platforms such as Raspberry Pi. We've fixed several bugs, including some serious ones affecting low-level network messages.
es: El inicio debería ser más rápido en plataformas como Raspberry Pi. Hemos corregido varios errores, incluidos algunos graves que afectan a los mensajes de red de bajo nivel.

source: 0.9.42 with bug fixes
es: 0.9.42 con corrección de errores

source: 0.9.42 continues the work to make I2P faster and more reliable. It includes several changes to speed up our UDP transport. We have split up the configuration files to enable future work for more modular packaging. We continue work to implement new proposals for faster and more secure encryption. There are, of course, a lot of bug fixes also.
es: 0.9.42 sigue trabajando para que el I2P sea más rápido y fiable. Incluye varios cambios para acelerar nuestro transporte UDP. Hemos dividido los archivos de configuración para poder trabajar en el futuro con embalajes más modulares. Continuamos trabajando para implementar nuevas propuestas para una encriptación más rápida y segura. Hay, por supuesto, un montón de correcciones de errores también.

source: 0.9.43 with bug fixes
es: 0.9.43 con corrección de errores

source: In the 0.9.43 release, we continue work on stronger security and privacy features and performance improvements. Our implementation of the new leaseset specification (LS2) is now complete. We are beginning our implementation of stronger and faster end-to-end encryption (proposal 144) for a future release. Several IPv6 address detection issues have been fixed, and there of course are several other bug fixes.
es: En la versión 0.9.43, continuamos trabajando para mejorar la seguridad, la privacidad y el rendimiento. Nuestra implementación de la nueva especificación del conjunto de contratos de arrendamiento (LS2) ha finalizado. Estamos comenzando la implementación de una encriptación de extremo a extremo más fuerte y rápida (propuesta 144) para una futura versión. Varios problemas de detección de direcciones IPv6 han sido corregidos, y por supuesto hay otros errores corregidos.

source: 0.9.44 with bug fixes
es: 0.9.44 con corrección de errores

source: 0.9.44 contains an important fix for a denial of service issue in hidden services handling of new encryption types. All users should update as soon as possible.
es: 0.9.44 contiene una solución importante para un problema de denegación de servicio en la gestión de servicios ocultos de nuevos tipos de cifrado. Todos los usuarios deben actualizar lo antes posible.

source: The release includes initial support for new end-to-end encryption (proposal 144). Work continues on this project, and it is not yet ready for use. There are changes to the console home page, and new embedded HTML5 media players in i2psnark. Additional fixes for firewalled IPv6 networks are included. Tunnel build fixes should result in faster startup for some users.
es: La versión incluye el soporte inicial para la nueva encriptación de extremo a extremo (propuesta 144). Se sigue trabajando en este proyecto y aún no está listo para su uso. Hay cambios en la página de inicio de la consola y nuevos reproductores multimedia HTML5 incrustados en i2psnark. Se incluyen correcciones adicionales para redes IPv6 con cortafuegos. Las correcciones en la construcción del túnel deberían resultar en un inicio más rápido para algunos usuarios.
