Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Tunnels: Prevent zero-hop even when no active peers
id: Tunnels: Mencegah zero-hop bahkan ketika tidak ada peer yang aktif

source: Add support for notes in Addressbook
id: Menambah dukungan untuk notes di Addressbook

source: Rewrite and new translations for eepsite help page (new installs only)
id: Penulisan ulang dan penerjemahan baru di halaman bantuan eepsite (hanya untuk instalasi baru)

source: DNSoverHTTPS (disabled by default)
id: DNSoverHTTPS (dinonaktifkan secara default)

source: NTCP refactoring in prep for NTCP2
id: NTCP refactoring dalam persiapan untuk NTCP2

source: Move SusiMail logging to router logs
id: Pemindahan SusiMail logging ke router logs

source: SusiMail BCC-to-self feature replaced with Sent folder
id: Fitur SusiMail BCC-to-self digantikan folder Sent

source: Fix eepget handling of response line with no status text
id: Perbaikan eepget handling of response line dengan no status text

source: i2psnark UI cleanups
id: Pembersihan i2psnark UI

source: New Azerbaijani translation
id: Penerjemahan baru bahasa Azerbaijan

source: ============================ NTCP2 implementation details ============================
id: ============================ Detail penerapan NTCP2 ============================

source: I2P's new transport protocol implementation details
id: Detail penerapan transport protocol baru untuk I2P

source: `Source article`_ by orignal at habr.com
id: `Source article`_ oleh orignal di habr.com

source: I2P's transport protocols were originally developed around 15 years ago. Back then, the main goal was to hide the transferred data, not to hide the fact that one was using the protocol itself. Nobody thought seriously about protecting against DPI (deep packets inspection) and protocols censorship. Times change, and even though original transport protocols are still providing strong security, there was a demand for a new transport protocol. NTCP2 is designed to resist current censorship threats. Mainly, DPI analysis of packets length. Plus, the new protocol uses the most modern cryptography developments. NTCP2 is based on the `Noise Protocol Framework`_, with SHA256 as a hash function and x25519 as an elliptic curve Diffie-Hellman (DH) key exchange.
id: I2P transport protocols mulanya dikembangkan sekitar 15 tahun lalu. Waktu itu , tujuan utamanya menyembunyikan data terkirim, bukan menyembunyikan fakta protocol sedang digunakan. Tidak ada yang serius melindungi terhadap DPI (deep packets inspection) dan sensor protocol. Jaman sudah berubah, dan walau transport protocols yang asli masih menyediakan keamanan kuat, ada kebutuhan untuk transport protocol baru. NTCP2 didesain untuk melawan ancaman sensor. Terutama, analisis DPI terhadap panjang packets. Ditambah protokol baru menggunakan perkembangan kriptografi modern terbaru. NTCP2 didasarkan dari `Noise Protocol Framework`_, dengan SHA256 sebagai fungsi hash dan x25519 sebagai elliptic curve Diffie-Hellman (DH) key exchange.

source: Full specification of NTCP2 protocol can be `found here`_.
id: Spek penih protokol NTCP2 dapat dilihat `di sini`_.

source: New crypto ----------
id: Kripto baru ----------

source: NTCP2 requires adding the next cryptographic algorithms to an I2P implementation:
id: NTCP2 memerlukan menambah cryptographic algorithms berikutnya ke implementasi I2P:

source: Compared to our original protocol, NTCP, NTCP2 uses x25519 instead of ElGamal for DH function, AEAD/Chaha20/Poly1305 instead of AES-256-CBC/Adler32, and uses SipHash for obfuscating the packet's length information. The key derivation function used in NTCP2 is more complex, now using many HMAC-SHA256 calls.
id: Dibandingkan protokal lama NTCP, NTCP2 menggunakan x25519, bukan ElGamal untuk fungsi DH, menggunakan AEAD/Chaha20/Poly1305 bukan AES-256-CBC/Adler32, dan menggunakan SipHash untuk melakukan obfuscating informasi panjang packet. Key derivation function digunakan di NTCP2 lebih rumit, menggunakan banyak HMAC-SHA256 calls.

source: i2pd (C++) implementation note: All of the algorithms mentioned above, except SipHash, are implemented in OpenSSL 1.1.0. SipHash will be added to the coming OpenSSL 1.1.1 release. For compatibility with OpenSSL 1.0.2, which is used in most of the current systems, core i2pd developer `Jeff Becker`_ has contributed standalone implementations of missing cryptographic algorithms.
id: Catatan penerapan i2pd (C++): Semua algoritma disebut di atas, kecuali SipHash, diterapkan di OpenSSL 1.1.0. SipHash akan ditambahkan di rilis OpenSSL 1.1.1 mendatang. Untuk kompatibilitas dengan OpenSSL 1.0.2, yang digunakan banyak sistem modern, pengembang inti i2pd `Jeff Becker`_ telah memberikan implementaso algoritma kriptografi yang hilang.

source: RouterInfo changes ------------------
id: Perubahan RouterInfo ------------------

source: NTCP2 requires having a third (x25519) key in addition to existing two (the encryption and signature keys). It is called a static key and it has to be added to any of RouterInfo addresses as an "s" parameter. It is required for both NTCP2 initiator (Alice) and responder (Bob). If more than one address supports NTCP2, for example, IPv4 and IPv6, "s" is required to be the same for all of them. Alice's address is allowed to have just the "s" parameter without "host" and "port" set. Also, a "v" parameter is required, that is currently always set to "2".
id: NTCP2 memerlukan kunci ketiga (x25519) selain dua kunci lain (enkripsinya dan kunci signature). Ini bernama kunci statis atau static key dan harus ditambah ke salah satu alamat RouterInfo sebagai sebuah "s" parameter. Ini diperlukan oleh initiator (Alice) dan responder (Bob) dari NTCP2. Jika lebih dari satu alamat mendukung NTCP2, contohnya IPv4 and IPv6, "s" harus sama di semua alamat. Alamat Alice dibolehkan hanya memiliki "s" parameter tanpa "host" dan "port" disetel. Juga, sebuah "v" parameter dibutuhkan, yang saat ini selalu ditulis dengan angka "2".

source: NTCP2 address can be declared as a separate NTCP2 address or as an old-style NTCP address with additional parameters, in which case it will accept both NTCP and NTCP2 connections. Java I2P implementation uses the second approach, i2pd (C++ implementation) uses the first.
id: Alamat NTCP2 dapat diumumkan sebagai alamat terpisah NTCP2 atau sebagai alamat NTCP tipe lama dengan parameter tambahan, yang akan menerima koneksi NTCP dan NTCP2. Penerapan Java I2P menggunakan pendekatan kedua, i2pd (penerapan C++) menggunakan yang pertama.

source: If a node accepts NTCP2 connections, it has to publish its RouterInfo with the "i" parameter, which is used as an initialization vector (IV) for the public encryption key when that node establishes new connections.
id: Jika sebuah node menerima koneksi NTCP2, dia harus menyebarkan RouterInfo dengan "i" parameter, yang digunakan sebagai initialization vector (IV) untuk kunci enkripsi publik ketika node itu membuat koneksi baru.

source: Establishing a connection -------------------------
id: Membuat sambungan -------------------------

source: To establish a connection both sides need to generate pairs of ephemeral x25519 keys. Based on those keys and "static" keys they derive a set of keys for data transferring. Both parties must verify that the other side actually has a private key for that static key, and that static key is the same as in RouterInfo.
id: Untuk membuat sambungan atau koneksi, kedua pihak perlu membuat pasangan kunci ephemeral x25519. Berdasarkan kunci-kunci tadi dan kunci "statis", mereka membuat kumpulan kunci untuk transfer data. Kedua pihak harus memeriksa pasangannya benar-benar memiliki private key untuk setiap static key, dan static key tadi sama dengan di RouterInfo.

source: Three messages are being sent to establish a connection:
id: Tiga pesan dikirim untuk membuat sebuah koneksi:

source: A common x25519 key, called «input key material», is computed for each message, after which message encryption key is generated with a MixKey function. A value ck (chaining key) is kept while messages are being exchanged. That value is used as a final input when generating keys for data transferring.
id: Semuah common x25519 key, bernama «input key material», dibuat untuk setiap pesan, setelah message encryption key dibuat dengan MixKey function. Sebuah angka atau value ck (chaining key) disimpan sementara pesan-pesan dikirimkan. Angka tadi digunakan sebagai input terakhir ketika membuat kunci untuk transfer data.

source: MixKey function looks something like this in the C++ implementation of I2P:
id: MixKey function terlihat seperti ini di penerapan C++ I2P:

source: **SessionRequest** message is made of a public x25519 Alice key (32 bytes), a block of data encrypted with AEAD/Chacha20/Poly1305 (16 bytes), a hash (16 bytes) and some random data in the end (padding). Padding length is defined in the encrypted block of data. Encrypted block also contains length of the second part of the **SessionConfirmed** message. A block of data is encrypted and signed with a key derived from Alice's ephemeral key and Bob's static key. Initial ck value for MixKey function is set to SHA256 (Noise_XKaesobfse+hs2+hs3_25519_ChaChaPoly_SHA256).
id: **SessionRequest** message is made of a public x25519 Alice key (32 bytes), a block of data encrypted with AEAD/Chacha20/Poly1305 (16 bytes), a hash (16 bytes) and some random data in the end (padding). Padding length didefinisikan di blok data yang terenkripsi. Blok terenkripsi juga berisi panjangnya bagian kedua dari pesan **SessionConfirmed**. Satu blok data dienkripsi dan ditandatangani dengan sebuah kunci yang diturunkan dari ephemeral key milik Alice dan static key milik Bob. Initial ck value untuk MixKey function dibuat ke SHA256 (Noise_XKaesobfse+hs2+hs3_25519_ChaChaPoly_SHA256).

source: Since 32 bytes of public x25519 key can be detected by DPI, it is encrypted with AES-256-CBC algorithm using hash of Bob's address as a key and "i" parameter from RouterInfo as an initialization vector (IV).
id: Karena public x25519 key sepanjang 32 bytes dapat dideteksi oleh DPI, dia dienkripsi dengan AES-256-CBC algorithm menggunakan hash dengan alamat Bob sebagai kunci dan "i" parameter dari RouterInfo sebagai initialization vector (IV).

source: **SessionCreated** message has the same structure as **SessionRequest**, except the key is computed based on ephemeral keys of both sides. IV generated after encrypting/decrypting public key from **SessionRequest** message is used as IV for encrypting/decrypting ephemeral public key.
id: Pesan **SessionCreated** memiliki struktur yang sama dengan **SessionRequest**, kecuali kuncinya dibuat berdasarkan ephemeral keys milik kedua pihak. IV dibuat setelah enkripsi/dekripsi public key dari pesan**SessionRequest** digunakan sebagai IV untuk enkripsi/dekripsi ephemeral public key.

source: **SessionConfirmed** message has 2 parts: public static key and Alice's RouterInfo. The difference from previous messages is that ephemeral public key is encrypted with AEAD/Chaha20/Poly1305 using the same key as **SessionCreated**. It leads to increasing first part of the message from 32 to 48 bytes. The second part is also encrypted with AEAD/Chaha20/Poly1305, but using a new key, computed from Bob's ephemeral key and Alice's static key. RouterInfo part can also be appended with random data padding, but it is not required, since RouterInfo usually has various length.
id: Pesan **SessionConfirmed** memiliki dua bagian: public static key dan RouterInfo milik Alice. Bedanya dengan pesan-pesan sebelumnya adalahephemeral public key dienkripsi dengan AEAD/Chaha20/Poly1305 menggunakan kunci yang sama dengan **SessionCreated**. Ini menambah besarnya bagian pertama pesan dari 32 menjadi 48 bytes. Bagian kedua juga dienkripsi dengan AEAD/Chaha20/Poly1305, tapi menggunakan kunci baru, yang dibuat dari ephemeral key milik Bob dan static key milik Alice. RouterInfo part juga dapat di-append dengan random data padding, tapi tidak dibutuhkan, karena RouterInfo biasanya mempunyai panjang beragam.

source: Generation of data transfer keys --------------------------------
id: Pembuatan data transfer keys --------------------------------

source: If every hash and key verification has succeeded, a common ck value must be present after the last MixKey operation on both sides. This value is used to generate two sets of keys <k, sipk, sipiv> for each side of a connection. "k" is a AEAD/Chaha20/Poly1305 key, "sipk" is a SipHash key, "sipiv" is an initial value for SipHash IV, that is changed after each use.
id: Jika semua hash dan verifikasi kunci berhasil, sebuah common ck value seharusnya muncul setelah operasi MixKey terakhir di kedua pihak. Nilai atau value ini digunakan untuk membuat dua kunci <k, sipk, sipiv> untuk setiap sisi koneksi. "k" adalah kunci AEAD/Chaha20/Poly1305, "sipk" adalah kunci SipHash, "sipiv" adalah initial value untuk SipHash IV, yang diubah setiap penggunaan.

source: Code used to generate keys looks like this in the C++ implementation of I2P:
id: Kode yang digunakan untuk membuat kunci terlihat seperti ini di implementasi C++ I2P:

source: i2pd (C++) implementation note: First 16 bytes of the "sipkeys" array are a SipHash key, the last 8 bytes are IV. SipHash requires two 8 byte keys, but i2pd handles them as a single 16 bytes key.
id: i2pd (C++) implementation note: First 16 bytes of the "sipkeys" array are a SipHash key, the last 8 bytes are IV. SipHash memerlukan dua kunci 8 byte, tapi i2pd menanganinya sebagai satu kunci 16 bytes.

source: Data transferring -----------------
id: Transfer Data -----------------

source: Data is transferred in frames, each frame has 3 parts:
id: Data dikirim dalam frame, setiap frame memiliki 3 bagian:

source: - 2 bytes of frame length obfuscated with SipHash - data encrypted with Chacha20 - 16 bytes of Poly1305 hash value
id: - fram sepanjang 2 bytes dilakukan obfuscated dengan SipHash - data dienkripsi dengan Chacha20 - Poly1305 hash value sepanjang 16 bytes

source: Maximum length of data transferred in one frame is 65519 bytes.
id: Maksimum panjang data terkirim dalam satu frame is 65519 bytes.

source: Message length is obfuscated by applying the XOR function with two first bytes of the current SipHash IV.
id: Panjang pesan di-obfuscated dengan menerapkan XOR function dengan dua bytes pertama dari SipHash IV terkini.

source: Encrypted data part contains blocks of data. Each block is prepended with 3 bytes header, that defines block type and block length. Generally, I2NP type blocks are transferred, that are I2NP messages with an altered header. One NTCP2 frame can transfer multiple I2NP blocks.
id: Potongan data yang terenkripsi berisi blok data. Di awal setiap blok ditambah 3 bytes header, yang mendefinisikan tipe dan panjang blok. Umumnya, blok tipe I2NP ditransfer, yang berupa pesan-pesan I2NP dengan header yang diubah. Satu NTCP2 frame dapat mentransfer banyak blok I2NP.

source: Those are other data blocks used in the current NTCP2 implementation:
id: Itu adalah blok data lain yang digunakan dalam implementasi NTCP2 saat ini:

source: Summary -------
id: Ringkasan -------

source: The new I2P transport protocol NTCP2 provides effective resistance against DPI censorship. It also results in reduced CPU load because of the faster, modern cryptography used. It makes I2P more likely to run on low-end devices, such as smartphones and home routers. Both major I2P implementations have full support for NTCP2 and it make NTCP2 available for use starting with version 0.9.36 (Java) and 2.20 (i2pd, C++).
id: Protokol transport baru I2P NTCP2 menyediakan kekebalan efektif terhadap sensor DPI. Ini juga menghasilkan kurangnya beban CPU karena kriptografi yang digunakan lebih cepat dan modern. Ini membuat I2P lebih dapat dijalankan di alat berspesifikasi rendah, seperti smartphones dan home routers. Kedua implementasi utama I2P mendukung penuh NTCP2 dan menyediakan NTCP2 mulai dari versi 0.9.36 (Java) dan 2.20 (i2pd, C++).

source: 0.9.36 with NTCP2 and bug fixes
es: 0.9.36 con NTCP2 y reparación de errores
id: 0.9.36 memiliki perbaikan NTCP2 dan bug

source: 0.9.36 implements a new, more secure transport protocol called NTCP2. It is disabled by default, but you may enable it for testing. NTCP2 will be enabled in the next release.
id: 0.9.36 Menerapkan protokol transport baru yang lebih aman bernama NTCP2. Ini dinonaktifkan secara default, tapi Anda dapat mengaktifkannya untuk pengujian. NTCP2 akan diaktifkan di rilis berikutnya.

source: This release also contains a fix for installs on Windows 10, and several performance improvements.
id: Rilis ini juga berisi perbaikan untuk instalasi di Windows 10, dan beberapa peningkatan kinerja.

source: i2psnark: Add sequential order option
id: i2psnark: menambah opsi sequential order

source: NTCP2 (disabled by default, enable with advanced config i2np.ntcp2.enable=true)
id: NTCP2 (dinonaktifkan secara default, aktifkan dengan konfigurasi lanjutan i2np.ntcp2.enable=true)

source: Transport performance improvements
id: Peningkatan kinerja transport

source: Console: Catch rare session exception
id: Console: Menangkap rare session exception

source: Crypto: EdDSA constant-time fix
id: Crypto: perbaikan EdDSA constant-time

source: i2psnark: Handle deleted files on recheck/reopen
id: i2psnark: Pengaturan file terhapus saat recheck/reopen

source: i2psnark: Fix error stopping torrent when allocating
id: i2psnark: Perbaikan torrent terhenti ketika allocating

source: Installer: Fix wrapper selection on Windows 10
id: Installer: Perbaikan pemilihan wrapper di Windows 10

source: Streaming: Change behavior on read timeout
id: Streaming: Perubahan perilaku di read timeout

source: Console: Split netdb output into pages
id: Console: Pemisahan output netdb ke beberapa halaman

source: Debian: Add dependency on famfamfam-flag-png
id: Debian: Menambah dependency kepada famfamfam-flag-png

source: Debian: Check for missing libtaglibs at build time
id: Debian: Memeriksa libtaglib yang hilang pada waktu pembuatan

source: I2CP: Add option for forcing gzip on/off per-message
id: I2CP: Tambahkan opsi untuk memaksa gzip on/off per-pesan

source: i2psnark: Add icon for comments
id: i2psnark: Menambah icon untuk komentar

source: i2ptunnel: Change read timeout defaults to account for streaming changes
id: i2ptunnel: Mengubah batas waktu readout ke akun untuk perubahan streaming

source: JBigI: Detect processor change at at startup, reselect lib
id: JBigI: Deteksi perubahan prosesor saat startup, pilih ulang lib

source: Streaming: Performance improvements
id: Streaming: Peningkatan kinerja

source: Update GeoIPv6 data (new installs and PPA only)
id: Pembaruan data GeoIPv6 (hanya untuk pemasangan baru dan PPA)

source: 0.9.37 with NTCP2 enabled
es: 0.9.37 con NTCP2 activado
id: 0.9.37 dengan NTCP2 telah diaktifkan

source: Advanced Settings
es: Configuración avanzada
id: Pengaturan Lanjutan

source: Active Queue Management
es: Gestión de cola activa

source: Database
es: Base de datos

source: Streaming library refactoring
es: Refactorización de la librería streaming

source: ================================================================ Search Engine DuckDuckGo Awards Invisible Internet Project $5000 ================================================================
es: ============================================================================== El motor de búsqueda DuckDuckGo premia al Invisible Internet Project con 5000$ ==============================================================================

source: Housekeeping
es: Mantenimiento interno

source: Update details
es: Detalles de la actualización

source: Router Family
es: Familia del router I2P

source: APIs month ==========
es: Mes de la APIs =============

source: BOB database refactor
es: Refactorización de la base de datos de BOB

source: Introducer expiration (proposal 133)
es: Caducidad de introductor (propuesta 133)

source: Cryptographic primitives
es: Primitivas criptográficas

source: SusiMail: Encoder refactoring
es: SusiMail: Reestructuración del codificador

source: SusiMail: State tracking refactoring
es: SusiMail: Remodelado del rastreo de estado

source: Nice-to-have: Ticket triage ---------------------------
es: Deseable: Asignar preferencia de tickets ---------------------------

source: 0.9.38 with new setup wizard
es: 0.9.38 con el nuevo asistente de configuración

source: 0.9.38 includes a new first-install wizard with a bandwidth tester. We've added support for the latest GeoIP database format. There's a new Firefox profile installer and a new, native Mac OSX installer on our website. Work continues on supporting the new "LS2" netdb format.
es: 0.9.38 incluye un nuevo asistente de primera instalación con un probador de ancho de banda. Hemos añadido soporte para el último formato de base de datos GeoIP. Hay un nuevo instalador de perfiles de Firefox y un nuevo instalador nativo de Mac OSX en nuestro sitio web. Se sigue trabajando en el soporte del nuevo formato netdb "LS2".

source: This release also contains plenty of bug fixes, including several issues with susimail attachments, and a fix for IPv6-only routers.
es: Esta versión también contiene un montón de correcciones de errores, incluyendo varios problemas con los adjuntos susimail, y una solución para enrutadores sólo IPv6.

source: I2P Laboratory
es: Laboratorio I2P

source: 0.9.39 with performance improvements
es: 0.9.39 con mejoras en el rendimiento

source: 0.9.39 includes extensive changes for the new network database types (proposal 123). We've bundled the i2pcontrol plugin as a webapp to support development of RPC applications. There are numerous performance improvements and bug fixes.
es: 0.9.39 incluye amplios cambios para los nuevos tipos de bases de datos de red (propuesta 123). Hemos incluido el plugin i2pcontrol como webapp para soportar el desarrollo de aplicaciones RPC. Hay numerosas mejoras de rendimiento y correcciones de errores.

source: We've removed the midnight and classic themes to reduce the maintenance burden; previous users of those themes will now see the dark or light theme. There's also new home page icons, a first step in updating the console.
es: Hemos eliminado los temas de medianoche y clásicos para reducir la carga de mantenimiento; los usuarios anteriores de esos temas verán ahora el tema oscuro o claro. También hay nuevos iconos en la página de inicio, un primer paso para actualizar la consola.

source: 0.9.40 with new icons
es: 0.9.40 con nuevos iconos

source: 0.9.40 includes support for the new encrypted leaseset format. We disabled the old NTCP 1 transport protocol. There's a new SusiDNS import feature, and a new scripted filtering mechanism for incoming connections.
es: 0.9.40 incluye soporte para el nuevo formato cifrado de leaseset. Desactivamos el antiguo protocolo de transporte NTCP 1. Hay una nueva característica de importación de SusiDNS y un nuevo mecanismo de filtrado de scripts para las conexiones entrantes.

source: Tunnel Wizard
es: Asistente de túnel

source: 0.9.41 with bug fixes
es: 0.9.41 con corrección de errores

source: 0.9.41 continues the work to implement new features for proposal 123, including per-client authentication for encrypted leasesets. The console has an updated I2P logo and several new icons. We've updated the Linux installer.
es: 0.9.41 prosigue la labor de aplicación de las nuevas características de la propuesta 123, incluyendo la autenticación por cliente para conjuntos de contratos de arrendamiento encriptados. La consola tiene un logotipo I2P actualizado y varios iconos nuevos. Hemos actualizado el instalador de Linux.
