Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Low-latency onion-routing networks are vulnerable to traffic confirmation attacks, so it would be reasonable to ask whether improved performance equates to reduced privacy. Some latency can help privacy if applied correctly via random delays or batching (neither of which are currently employed by any general-purpose onion-routing network). However, if a tunnel has uniform overall latency, then traffic confirmation attacks should be just as viable with or without that latency; thus there should be little statistical difference when the latency is reduced uniformly.
es: Las redes de enrutamiento-onion de baja latencia son vulnerables a los ataques de confirmación de tráfico, así que sería razonable preguntarse si la mejora del rendimiento compensa la reducción de la privacidad. Algo de latencia puede ayudar a la privacidad si se aplica correctamente a través de retardos aleatorios o el uso de lotes (ninguno de los cuales se emplea actualmente para cualquier red de enrutamiento-onion de propósito general). Sin embargo, si un túnel tiene una latencia conjunta uniforme, entonces los ataques de confirmación de tráfico deben ser igual de viables con o sin esa latencia; de este modo debería haber poca diferencia estadística cuando la latencia se reduzca de manera uniforme.
id: Jaringan low-latency onion-routing memang rentan terhadap serangan konfirmasi lalu lintas, sehingga akan masuk akal untuk bertanya apakah peningkatan kinerja setara dengan pengurangan privasi. Beberapa tingkat latency dapat membantu privasi jika diterapkan dengan benar melalui penundaan acak atau batching (baik yang saat ini digunakan oleh jaringan onion-routing umum apapun). Namun, jika sebuat tunnel memiliki latensi keseluruhan yang uniform, serangan konfirmasi lalu lintas akan mungkin dilakukan dengan atau tidak dengan latensi; sehingga seharusnya ada sedikit perbedaan statistik ketika latensi dikurang secara sama antar tunnel.

source: ============== 0.9.31 Release ==============
es: ============== Versión 0.9.31 ==============
id: ============== Rilis 0.9.31 ==============

source: 0.9.31 with Console Updates
es: 0.9.31 con actualizaciones de consola
id: Versi 0.9.31 dirilis dengan pembaruan console

source: The changes in this release are much more noticeable than usual! We have refreshed the router console to make it easier to understand, improve accessibility and cross-browser support, and generally tidy things up. This is the first step in a longer-term plan to make the router console more user-friendly. We have also added torrent ratings and comments support to i2psnark.
es: ¡Los cambios en esta versión son mucho más notorios que habitualmente! Hemos actualizado la consola del router I2P para hacerlo más fácil de comprender, hemos mejorado la accesibilidad y el soporte entre-navegadores, y hemos acicalado las cosas en general. Este es el primer paso en un plan a largo-plazo para hacer la consola del router I2P más amable para el usuario. También hemos añadido soporte para valoraciones de torrents y comentarios en i2psnark.
id: Perubahan dalam rilis ini jauh lebih dirasakan daripada biasanya! Kami telah menyesegarkan router console untuk membuatnya lebih mudah dipahami, meningkatkan aksesibilitas dan dukungan cross-browser, dan umumnya membereskan hal-hal lain. Ini adalah langkah pertama dalam rencana jangka panjang untuk membuat router console menjadi lebih user-friendly. Kami juga telah menambahkan peringkat torrent dan dukungan komentar untuk i2psnark.

source: Console updates
es: Actualizaciones de consola
id: Pembaruan console

source: i2psnark ratings and comments
es: Valoraciones y comentarios en i2psnark
id: Peringkat dan komentar i2psnark

source: Fix compile error with Jetty 9.2.22
es: Corrige un error de compilación con Jetty 9.2.22
id: Memperbaiki kesalahan kompilasi dengan Jetty 9.2.22

source: Preserve CRT parameters for RSA private keys
es: Preserva los parámetros CRT (teorema chino de los restos) para claves privadas RSA
id: Melestarikan CRT parameter untuk kunci RSA pribadi

source: Fix AES NPE on 4-core Rasp. Pi
es: Corrige una NPE (excepción de puntero nulo) de AES en Raspberry Pi de 4-núcleos
id: Memperbaiki AES NPE pada 4-core Rasp. Pi

source: Fix NPE in GeoIP
es: Corrige una NPE en GeoIP
id: Memperbaikan NPE di GeoIP

source: Fix bencoding for scrape response in zzzot plugin
es: Corrige la bencoding (codificación de bittorrent) para la respuesta al scrape (petición de información al tracker) en el complemento zzzot
id: Perbaikan bencoding untuk scrape response di plugin zzzot

source: Fix display of default SusiDNS subscription
es: Corrige el mostrado de la suscripción SusiDNS predeterminada
id: Memperbaiki tampilan default dari langganan SusiDNS

source: Fix Debian apparmor profile
es: Corrige el perfil apparmor de Debian
id: Memperbaiki profil Debian apparmor

source: Improve handling of read-only i2psnark directory
es: Mejora el manejo del directorio i2psnark de sólo-lectura
id: Memperbaiki penanganan direktori i2psnark read-only

source: Hostname lookup caching improvements
es: Mejoras en el cacheado de la búsqueda de nombre de servidor
id: Peningkatan cache dari pencarian hostname

source: Move blockfile support from i2p.jar to addressbook.jar
es: Mueve el soporte de blockfile (sistema de nombres) de i2p.jar a addressbook.jar
id: Memindahkan dukungan blockfile dari i2p.jar ke addressbook.jar

source: Locale-independent Jetty directory listing
es: Listado del directorio Jetty independiente de la regionalización
id: Daftar direktori Jetty yang independent dari pengaturan lokal bahasa

source: ============== 0.9.32 Release ==============
es: ============== Versión 0.9.32 ==============
id: ============== Rilis 0.9.32 ==============

source: 0.9.32 with Console Updates
es: 0.9.32 con actualizaciones de consola
id: Versi 0.9.32 dirilis dengan pembaruan console

source: 0.9.32 contains a number of fixes in the router console and associated webapps (addressbook, i2psnark, and susimail). We have also changed the way we handle configured hostnames for published router infos, to eliminate some network enumeration attacks via DNS. We have added some checks in the console to resist rebinding attacks.
es: La 0.9.32 contiene varias correcciones en la consola del router I2P y las aplicaciones web asociadas (addressbook, i2psnark, y susimail). También hemos cambiado la forma en la que manejamos los nombres de servidor configurados para las 'router infos' publicadas, para eliminar algunos ataques de enumeración de red vía DNS. Hemos añadido algunas comprobaciones en la consola para resistir ataques de reasociación (rebinding).
id: 0.9.32 berisi sejumlah perbaikan di router console dan webapp terkait (buku alamat, i2psnark, dan susimail). Kami juga telah mengubah cara kami menangani hostname yang dikonfigurasi untuk info router yang dipublikasikan, untuk menghilangkan beberapa serangan network enumeration dengan DNS. Kami telah menambahkan beberapa cek di consol untuk menolak serangan rebinding.

source: Disallow hostnames in router addresses (proposal 141)
es: Prohibe nombres de servidor en las direcciones del router I2P (propuesta 141)
id: Memblokir hostnames di alamat router (proposal 141)

source: Validate Host header in console
es: Valida cabecera del Servidor en la consola
id: Menvalidasi Host header di console

source: Numerous console, i2psnark, susidns, and susimail UI fixes
es: Numerosas correcciones de la interfaz de usuario de consola, i2psnark, susidns, y susimail
id: Banyak perbaikan di i2psnark, susidns, dan susimail UI

source: Fix i2psnark issues with expanding sections in some browsers
es: Corrige problemas de i2psnark con secciones expansivas en algunos navegadores
id: Memperbaiki masalah i2psnark di expanding sections di beberapa browser

source: Debian packaging fixes
es: Correcciones del empaquetamiento Debian
id: Perbaikan paket Debian

source: New benchmarking framework
es: Nuevo modelo de evaluación de rendimiento
id: Framework benchmark baru

source: New Indonesian translation
es: Nueva traducción al indonesio
id: Terjemahan baru Bahasa Indonesia

source: 0.9.33 with Bug Fixes
es: 0.9.33 con correcciones de fallos
id: 0.9.33 memiliki perbaikan bug

source: 0.9.33 contains a large number of bug fixes, including i2psnark, i2ptunnel, streaming, and SusiMail. For those who cannot access the reseed sites directly, we now support several types of proxies for reseeding. We now set rate limits by default in the hidden services manager. For those that run high-traffic servers, please review and adjust the limits as necessary.
es: La 0.9.33 contiene un gran número de correcciones de fallos, incluyendo i2psnark, i2ptunnel, streaming, y SusiMail. Para aquellos que no pueden acceder a los sitios de resembrado directamente, ahora soportamos varios tipos de proxys para resembrado. Ahora establecemos límites de tasa de transferencia en el administrador de servicios ocultos. Para aquellos que ejecutan servidores con alto tráfico, por favor, revisen y ajusten los límites según sea necesario.
id: 0.9.33 memiliki banyak perbaikan bug termasuk i2psnark, i2ptunnel, streaming, dan SusiMail. Jika Anda tidak dapat mengakses reseed sites secara langsung, beberapa tipe proxy untuk reseeding sekarang didukung. Rate limits secara default diatur di the hidden services manager. Jika Anda menjalankan high-traffic servers, silakan review dan atur batasannya seperlunya.

source: DesktopGui: Enable on OSX
es: DesktopGui (interfaz gráfica de escritorio): Habilitada en OSX
id: DesktopGui: diaktifkan di OSX

source: i2ptunnel: Set default rate limits
es: i2ptunnel: Establece límites de tasa predeterminada
id: i2ptunnel: menetapkan rate limits default

source: Reseeding: Add support for proxies
es: Resembrado: Añade soporte para proxies
id: Reseeding: menambah dukungan untuk proxy

source: new installs only
es: sólo nuevas instalaciones
id: hanya untuk instalasi baru

source: Client: Remove key when stopping or disabling encrypted lease set
es: Cliente: Elimina la clave al detener o deshabilitar el lease set cifrado
id: Client: menghapus key ketika menghentikan atau menonaktifkan lease set terenkripsi

source: Console: Several keyring configuration fixes
es: Consola: Varias correcciones de configuración del juego de claves
id: Console: beberapa perbaikan pengaturan keyring

source: EepGet: Detect and reject redirect to https
es: EepGet: Detecta y rechaza redireccionamiento a https
id: EepGet: deteksi dan tolak redirect ke https

source: HTTP Proxy: Fix up characters in URLs not escaped by browsers
es: HTTP Proxy: Corrige caracteres en URLs no 'escapadas' por navegadores
id: HTTP Proxy: perbaikan karakter di URLs yang tidak diteruskan oleh browsers

source: i2psnark: Fix bad completion status on recheck
es: i2psnark: Corrige estado de finalización erróneo al recomprobar
id: i2psnark: perbaikan completion status yang buruk saat recheck

source: i2psnark: Prohibit comments unless name is set
es: i2psnark: Prohibe comentarios a menos que el nombre esté establecido
id: i2psnark: melarang comments kecuali nama diberikan

source: i2psnark: Fix crash stopping update torrent
es: i2psnark: Corrige caída que detiene el torrent de actualización
id: i2psnark: perbaikan crash saat menghentikan update torrent

source: i2ptunnel: Don't erase messages on refresh in UI
es: i2ptunnel: No borra mensajes al refrescar en la interfaz de usuario
id: i2ptunnel: jangan menghapus pesan saat refresh UI

source: i2ptunnel: Propagate reset to and from streaming
es: i2ptunnel: Propaga la reinicialización, hacia y desde el transporte streaming
id: i2ptunnel: Menyebarkan reset ke dan dari streaming

source: i2ptunnel: Add header read timeouts to client proxies
es: i2ptunnel: Añade tiempos de espera de lectura de la cabecera para proxys cliente.
id: i2ptunnel: menambah header read timeouts ke proxy client

source: i2ptunnel: Prevent changing sig type after creating destination
es: i2ptunnel: Evita el cambio de tipo de firma tras crear un destino
id: i2ptunnel: mencegah mengubah jenis sig setelah membuat destinasi

source: Jetty: Fix zero length in request log for static content
es: Jetty: Corrige longitud cero en el registro de petciones para contenido estático
id: Jetty: Memperbaiki zero length di log permintaan untuk konten statis

source: Router: Reduce router info lock contention
es: Router: Reduce la agresividad del bloqueo de router info
id: Router: mengurangi router info lock contention

source: Streaming: Fix loopback hangs
es: Transporte streaming: Corrige caídas de loopback
id: Streaming: memperbaiki loopback hangs

source: Streaming: Fix bug causing excessive acks
es: Transporte streaming: Corrige un fallo que causa excesivos acks
id: Streaming: memperbaiki bug yang membuat excessive acks

source: Streaming: Fix connection close after reset
es: Transporte stremaing: Corrige la conexion para que se cierre tras reinicializar
id: Streaming: memperbaiki koneksi terputus setelah reset

source: SusiMail: Fix several issues when using multiple browser tabs
es: Suisimail: Corrige varios problemas al suar múltiples pestañas de navegador
id: SusiMail: Memperbaiki beberapa masalah ketika menggunakan banyak tab di browser

source: SusuMail: Fix bugs corrupting text attachments and large message bodies
es: Suisimail: Corrige fallos que corrompen adjuntos de texto y cuerpos de mensaje largos
id: SusiMail: Memperbaiki bug yang merusak lampiran dan email dengan isi yang banyak

source: SusiMail: Reject sending messages that exceed server limits
es: SusiMail: Rechaza el envío de mensajes que exceden los límites del servidor
id: SusiMail: Menolak mengirim pesan yang melebihi batasan yang ditentukan server

source: SusiMail: Reduce chance of crashes sending large attachments
es: SusiMail: Reduce las posibilidades de caídas al enviar adjuntos grandes
id: SusiMail: Mengurangi kesempatan crash saat mengirim lampiran yang besar

source: SusiMail: Subject line encoding fixes
es: SusiMail: Correcciones en la codificación de la línea de asunto
id: SusiMail: Perbaikan encoding di bagian Subject

source: SusiMail: Fix Cc header
es: SusiMail: Corrección de la cabecera Cc
id: SusiMail: Perbaikan Cc header

source: SusiMail: Fix encoding for attachment file names
es: SusiMail: Corrige la codificación para los nombres de ficheros adjuntos
id: SusiMail: Perbaikan encoding untuk nama file lampiran

source: SusiMail: POP3 socket close after failure
es: SusiMail: Cierre del socket POP3 después de un fallo
id: SusiMail: POP3 socket tertutup setelah kesalahan terjadi

source: Unit test fixes
es: Correcciones del test de unidad
id: Perbaikan unit test

source: Utils: Use constant-time method to check passwords
es: Utilidades: Usa el método de tiempo constante para comprobar contraseñas
id: Utils: Menggunakan metode constant-time untuk memeriksa passwords

source: Build: Add partial Gradle support
es: Compilación: Añade soporte parcial de Gradle
id: Build: dukungan parsial untuk Gradle

source: Console: Hide or combine aliased tunnels on tunnels pages
es: Consola: Oculta o combina túneles alias en páginas de túneles
id: Console: Menyembunyikan atau menggabungkan aliased tunnels di halaman tunnels

source: Console: Note encrypted leasesets on netdb page
es: Consola: Indica los leasesets cifrados en la página de netdb
id: Console: Note encrypted leasesets di halaman netdb

source: Console: Use bandwidth setting for burst bandwidth
es: Consola: Usa una configuración de ancho de banda explosivo
id: Console: Menggunakan pengaturan bandwidth untuk burst bandwidth

source: Console: Refactor multipart form handling to use Servlet 3.0 API
es: Consola: Refactorizado del manejo de formulario multiparte para usar la API Servlet 3.0
id: Console: Refactor multipart form handling menggunakan Servlet 3.0 API

source: Console: Move most handlers and helpers to the war
es: Consola: Moviliza la mayoría de los punteros y asistentes a la guerra
id: Console: Memindahkan sebagian besar handlers dan helpers kepada war

source: Debian: Xenial build is now separate, Zesty+ matches Buster
es: Debian: La versión de (Ubuntu) Xenial ahora está separada, (Ubuntu) Zesty+ se equipara con (Debian) Buster
id: Debian: versi Xenial sekarang terpisah, Zesty+ menyamai Buster

source: Debian: Remove ecj dependency; replace glassfish with libtaglibs where able
es: Debian: Elimina la dependencia de ecj,; reemplaza glassfish con libtaglibs donde sea posible
id: Debian: Menghapus dependency untuk ecj; mengganti glassfish dengan libtaglibs jika memungkinkan

source: Debian: Fix builds for x32
es: Debian: Corrige versiones para x32
id: Debian: perbaikan untuk versi x32

source: i2ptunnel: Refactor edit jsps
es: i2ptunnel: Reestructuración de los ficheros jsp de edit
id: i2ptunnel: jsps edit refactor

source: i2ptunnel: Message box improvements
es: i2ptunnel: Mejoras del buzón de mensajes
id: i2ptunnel: Peningkatan kotak pesan

source: Session Key Manager: Delete excess tag sets
es: Administrador de claves de sesión: Elimina los conjuntos de etiquetas excedentes
id: Session Key Manager: Menghapus tag sets yang berlebihan

source: SOCKS: Move client code to core
es: SOCKS: Mueve el código del cliente al core (núcleo del software)
id: SOCKS: Memindahkan kode client ke core

source: Startup: Increase open files ulimit if able, in i2prouter script (new installs only)
es: Arranque: Incrementa el ulimit de ficheros abiertos si es posible. en el script i2prouter (sólo nuevas instalaciones)
id: Startup: Meningkatkan open file ulimit jika dimungkinkan, dalam script i2prouter (hanya untuk instalasi baru)

source: SusiMail: UI tweaks and minor fixes
es: SusiMail: Ajustes de la interfaz de usuario y correcciones menores
id: SusiMail: Tweak UI dan perbaikan kecil

source: SusiMail: Use internal sockets to connect to servers
es: SusiMail: Usa sockets internos para conectarse a los servidores
id: SusiMail: Menggunakan soket internal untuk menyambung ke server

source: Update GeoIP data
es: Actualiza datos GeoIP
id: Pembaruan data GeoIP

source: =========================== High-level Roadmap for 2018 ===========================
es: =========================== Hoja de ruta de alto-nivel para 2018 ===========================
id: =========================== Roadmap Tingkat Tinggi di tahun 2018 ===========================

source: 2018 will be the year of new protocols, new collaborations, and a more refined focus.
es: 2018 será el año de los nuevos protocolos, nuevas colaboraciones, y una focalización más refinada.
id: Tahun 2018 akan menjadi tahun untuk protokol baru, kolaborasi baru, dan fokus lebih tajam.

source: One of the many things we discussed at 34C3 was what we should focus on for the coming year. In particular, we wanted a roadmap that was clear about what we want to ensure we get done, vs what would be really nice to have, and be able to help onboard newcomers to either category. Here is what we came up with:
es: Una de las muchas cosas que hemos discutido en el 34C3 fue sobre qué debemos centrarnos para el próximo año. En particular, queríamos una hoja de ruta que fuera clara acerca de lo que queremos asegurar que realizamos, frente a lo que sería realmente agradable tener, y poder ayudar a subirse al carro a los recién llegados a cada categoría. Esto es a lo que hemos logrado:
id: Salah satu hal yang dibahas di 34C3 adalah hal yang seharusnya menjadi fokus ke tahun depan. Khususnya, kami ingin roadmap yang jelas tentang apa yang kami ingin selesaikan, daripada hal yang tampak bagus, dan apa yang dapat membantu pendatang baru ke dalam kategori mana saja. Inilah hasil diskusi kami:

source: Priority: New crypto(graphy!) -----------------------------
es: Prioritario: ¡Nueva criptografía! -----------------------------
id: Prioritas: Crypto(graphy) baru! -----------------------------

source: Many of the current primitives and protocols still retain their original designs from circa 2005, and need improvement. We have had a number of open proposals for several years with ideas, but forward progress has been slow. We all agreed that this needs to be our top priority for 2018. The core components are: - New transport protocols (to replace NTCP and SSU). See Prop111_. - New onion-encryption protocol for building and using tunnels. - New NetDB datatypes to enable enhanced Destinations. See Prop123_. - Upgraded end-to-end protocol (replacing ElGamal).
es: Muchas de las actuales primitivas y protocolos todavía conservan sus diseños originales desde alrededor de 2005, y necesitan mejoras. Hemos tenido varias propuestas abiertas con ideas durante años, pero el progreso posterior ha sido lento. Todos estamos de acuerdo en que estas necesidades sean nuestra principal prioridad para 2018. Los componentes centrales son: - Nuevos protocolos de transporte (para reemplazar NTCP y SSU). Vea la Prop111_. - Nuevo protocolo de cifrado-onion para construir y usar túneles. - Nuevos tipos de datos de NetDB para habilitar Destinos I2P mejorados. Vea la Prop123_. - Protocolo extremo-a-extremo actualizado (reemplazando ElGamal).
id: Banyak protokol dan primitif masih memiliki desain awal dari tahun 2005-an sehingga butuh peningkatan. Kami memiliki sejumlah proposal terbuka untuk beberapa tahun dengan beberapa ide, tetapi kemajuan masih lambat. Kita semua setuju bahwa ini harus menjadi prioritas utama kami di tahun 2018. Komponen utamanya adalah: - Transport protocol baru (mengganti NTCP dan SSU). Lihat Prop111_. - Protokol onion-encryption baru untuk membangun dan menggunakan tunnel. -NetDB datatypes baru untuk mengaktifkan enhanced destination. Lihat Prop123_. -Upgrade protokol end-to-end (menggantikan ElGamal).

source: Work on this priority falls into several areas: - Writing proposals. - Writing working implementations of them that we can test. - Reviewing proposals.
es: El trabajo sobre esta prioridad corresponde a varias áreas: - Escribir propuestas. - Escribir implementaciones funcionales de estas que se puedan probar. - Revisar las propuestas.
id: Pekerjaan di prioritas ini terbagi dalam beberapa area: - Menulis proposal. - Menulis implementasi yang berfungsi sehingga dapat diuji. - Mengulas proposal.

source: We cannot release new protocol specifications across the entire network without work on all of these areas.
es: No podemos publicar nuevas especificaciones de protocolo por toda la red sin trabajar sobre todas estas áreas.
id: Kami tidak dapat merilis spesifikasi protokol baru ke seluruh jaringan tanpa hal-hal yang disebut di atas.

source: Nice-to-have: Code reuse ------------------------
es: Deseable: Reutilización de código ------------------------
id: Nice-to-have: Penggunaan kembali kode pemograman ------------------------
