Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: The global release is being done in several stages, starting with the countries for which we have translations. The notable exception to this is France; due to import regulations on cryptographic code, we are unable yet to distribute these apps on Google Play France. This is the same issue that has affected other apps like TextSecure and Orbot.
es: La publicación global se está realizando en varias etapas, comenzando por los países para los cuales tenemos traducciones. La excepción notable a esto es Francia; debido a las regulaciones a la importación de código criptográfico, aún no podemos distribuir estas aplicaciones en Google Play Francia. Este es el mismo problema que ha afectado a otras aplicaciones como TextSecure u Orbot.
id: Rilis global dilaksanakan melalui beberapa tahap, dimulai dengan negara-negara yang memiliki terjemahan proyek I2P. Pengecualian untuk ini adalah Perancis; menurut peraturan impor pada kode kriptografi, kami belum mampu mendistribusikan aplikasi ini di Google Play Perancis. Ini adalah masalah yang sama yang telah mempengaruhi aplikasi lain seperti TextSecure dan Orbot.

source: If you would like to manually verify the fingerprint (SHA-256) of the repository signing key, or type it in when adding the repository, here it is:
es: Si desea verificar manualmente la huella de validación (SHA-256) de la clave de firmado del repositorio, o introducirla al añadir el repositorio, aquí la tiene:
id: Jika Anda ingin secara manual memverifikasi fingerprint (SHA-256) dari repositori penandatanganan kunci, atau ketik di saat menambahkan repositori, ini caranya:

source: Unfortunately the I2P app in the main F-Droid repository has not been updated because our F-Droid maintainer has disappeared. We hope that by maintaining this binary repository, we can better support our F-Droid users and keep them up-to-date. If you have already installed I2P from the main F-Droid repository, you will need to uninstall it if you want to upgrade, because the signing key will be different. The apps in our F-Droid repository are the same APKs that are provided on our website and on Google Play, so in future you will be able to upgrade using any of these sources.
es: Desafortunadamente la aplicación I2P en el repositorio principal de F-Droid no ha sido actualizada porque nuestro mantenedor de F-Droid ha desaparecido. Esperamos que al mantener este repositorio de binarios, podremos dar mejor soporte a nuestros usuarios de F-Droid y mantenerles actualizados. Si ya ha instalado I2P desde el repositorio principal de F-Droid, tendrá que desinstalarlo si quiere actualizarlo, porque la clave de firmado será diferente. Las aplicaciones en nuestro repositorio de F-Droid son los mismos ficheros APK que se proporcionan en nuestro sitio web y en Google Play, así que en el futuro podrá actualizar usando cualquiera de estas fuentes.
id: Sayangnya aplikasi I2P di repository utama F-Droid belum diperbarui karena adminnya menghilang. Kami berharap dengan mempertahankan repositori biner ini, kita dapat lebih baik mendukung pengguna F-Droid kami dan menjaga mereka untuk tetap up-to-date. Jika Anda telah memasang I2P dari repositori utama F-Droid, Anda akan perlu mencopot I2P tersebut jika Anda ingin memperbarui, karena kunci penandatanganan akan berbeda. Aplikasi-aplikasi di repo F-Droid kami adalah file APK yang sama dengan di situs kami dan di Google Play, sehingga di masa depan Anda akan dapat memperbaruinya dengan menggunakan sumber-sumber tersebut.

source: ================ 31C3 trip report ================
es: ================ Informe de la excursión al 31C3 ================
id: ================ Laporan kunjungan 31C3 ================

source: CCC has always been a productive time for us, and 31C3 was no exception. Here is a summary of our various meetings and discussions.
es: CCC siempre ha sido un periodo productivo para nosotros, y 31C3 no fue una excepción. Aquí tenéis un resumen de nuestras diversas reuniones y conversaciones.
id: CCC selalu menjadi waktu produktif untuk kami, dan tidak terkecuali 31C3. Ini adalah ringkasan dari berbagai pertemuan dan diskusi kami.

source: We were, for the second year in a row, at a great location in the Congress, in `Noisy Square`_, right next to the EFF table. Being part of Noisy Square has really increased our visibility and helped many people find us. Thanks to Noisy Square and the 31C3 organizers for a great Congress.
es: Estuvimos, por segundo año consecutivo, en una estupenda ubicación en el Congreso, en `Noisy Square`_, justo al lado a la mesa de la EFF. Ser parte de Noisy Square ha incrementado de veras nuestra visibilidad y ayudado a mucha gente a encontrarnos. Gracias a Noisy Square y a los organizadores del 31C3 por un magnífico Congreso.
id: Kami berada, untuk tahun kedua berturut-turut, di lokasi yang besar di Congress, di dalam 'Noisy Square' _, tepat di sebelah meja EFF. Menjadi bagian dari Noisy Square meningkatkan visibilitas kami dan membantu banyak orang untuk menemukan kami. Terima kasih kepada Noisy Square dan panitia 31C3 untuk telah melaksanakan Congress yang hebat.

source: Discussions with others =======================
es: Discusiones con otros =======================
id: Diskusi dengan yang lain =======================

source: The prospect of an invigorated GNUnet with a large amount of new funding is quite interesting. We discussed more ways to work together. In early 2014, we worked hard to understand the GnuNet DNS replacement, but we were unable to figure out a good fit for it in I2P. One of his new ideas is a distributed, anonymous statistics gathering subsystem, for detecting problems or attacks on the network. We'd definitely be interested in that.
es: La perspectiva de una GNUnet revigorizada con una gran cantidad de nuevos fondos es bastante interesante. Hemos discutido más formas de trabajar juntos. A principios de 2014 trabajamos duro para comprender al sustituto de GNUnet DNS, pero no pudimos dar con un buen encaje para este en I2P. Una de sus nuevas ideas es un subsistema de recopilación de informacion estadística anónima y distribuida, para detectar problemas o ataques sobre la red. Definitivamente estaríamos interesados en eso.
id: Prospek untuk membangunkan kembali GNUnet dengan pendanaan yang besar memang sangat menarik. Kita membahas lebih banyak cara untuk bekerja sama. Pada awal tahun 2014, kami bekerja keras untuk memahami penggantian GnuNet DNS, tetapi kami tidak dapat mengetahui penerapan cocok untuk itu di I2P. Salah satu gagasan baru adalah subsistem pengumpulan statistik terdistribusi anonim, untuk mendeteksi masalah atau serangan pada jaringan. Kami pasti akan tertarik.

source: He said, well, try the new process, it works great, should be no problem at all if your package is in good shape. The people in Debian that run this process are eager volunteers who want nothing more than to get more packages in. We said our package is indeed in fantastic shape, and we would try out the new process as soon as possible. If all this is true, we will be in the next Debian release in late 2015. This would be very very cool.
es: Él dijo, bien, probad el nuevo proceso, funciona estupendamente, no deber haber problema en absoluto si vuestro paquete está en buenas condiciones. La gente en Debian que ejecuta este proceso son voluntarios entusiastas que no quieren nada más que lograr incorporar paquetes. Dijimos que nuestro paquete está de hecho en unas fantásticas condiciones, y que pondríamos a prueba el nuevo proceso tan pronto como fuera posible. Si todo esto es cierto, estaremos en la próxima versión de Debian a finales de 2015. Esto sería muy muy molón.
id: Katanya, coba proses yang baru, seharusnya tidak masalah sama sekali jika paket anda dalam kondisi bagus. Orang-orang di Debian yang menjalankan proses ini adalah sukarelawan yang hanya ingin mendapatkan lebih banyak paket. Kami mengatakan paket kami memang dalam bentuk sangat baik, dan kami akan mencoba proses baru sesegera mungkin. Jika semua ini benar, kami akan mengikuti rilis Debian berikutnya di akhir tahun 2015. Ini akan sangat sangat keren.

source: BitingBird also handles support, and she tells us the number one issue is how long I2P takes to start up and be useful for browsing I2P sites. Her standard answer is "wait ten more minutes" and that seems to be effective. I2P is particularly slow to startup on Tails since it does not persist peer data by default. It would be nice to change that, but there's also things we can do on the I2P side to make things start faster. Expect some improvement in our 0.9.18 release.
es: BitingBird también lleva el soporte, y ella nos dice que el problema número uno es cuánto tarda I2P en iniciarse y estar listo para navegar por sitios I2P. Su respuesta estándar es "espere diez minutos más" y eso parece ser efectivo. I2P es particularmente lento al iniciarse en Tails ya que por defecto no retiene datos de pares (peers). Sería agradable cambiar eso, pero también hay cosas que podemos hacer del lado del I2P para hacer que las cosas se inicien más rápido. Esperamos alguna mejora en nuestra versión 0.9.18.
id: BitingBird juga menangani dukungan, dan dia mengatakan kepada kami bahwa masalah nomor satu adalah berapa lama waktu yang dibutuhkan I2P untuk memulai dan berfungsi untuk browsing situs I2P. Jawaban standarnya adalah "tunggu sepuluh menit lagi" dan itu tampaknya efektif. I2P sangat lambat untuk startup pada Tails karena tidak bertahan data peer secara default. Alangkah baiknya mengubahnya, tapi ada juga hal yang bisa kita lakukan di sisi I2P untuk membuat segalanya berjalan lebih cepat. Harapkan beberapa peningkatan dalam rilis 0.9.18 kami.

source: New users ---------
es: Nuevos usuarios ---------
id: Pengguna baru ---------

source: We spent hours and hours explaining I2P to people stopping by our table. Some had heard of I2P before, some had not; everybody had heard of Tor and had at least a vague idea of what hidden services are. As usual, introducing people to I2P was a struggle. By the end of the Congress, we became convinced that a part of the problem was a difference in terminology. Back 12 years ago, when I2P and Tor were both getting started, we each came up with terms for the various parts of our systems. Today, the Tor terminology such as "hidden service" is well-understood and commonplace. The I2P terminology such as "eepsite" is neither. We agreed to review our documentation, router console, and other places for opportunities to simplify it and use common terms.
es: Hemos pasado horas y horas explicando I2P a la gente que se detiene por nuestra mesa. Algunos han oído de I2P antes, algunos no; todos han oído de Tor y tienen al menos una vaga idea de lo que son los servicios ocultos. Como es habitual, introducir a la gente en I2P fue una lucha. Para el final del Congreso llegamos al convencimiento de que una parte del problema era una diferencia en la terminología. 12 años atrás, cuando I2P y Tor estaban ambos comenzando, cada uno surgió con términos para las distintas partes de nuestros sistemas. Hoy, la terminología de Tor como "servicio oculto" es bien-entendida y un lugar común. La terminología de I2P como "eepsite" no lo es. Acordamos revisar nuestra documentación, consola del router I2P, y otros lugares, en busca de oportunidades para simplificarlas y utilizar términos comunes.
id: Kami menghabiskan berjam-jam menjelaskan I2P kepada orang-orang yang mampir ke meja kami. Beberapa orang pernah mendengar tentang I2P sebelumnya, beberapa tidak; semua orang pernah mendengar tentang Tor dan setidaknya memiliki gagasan samar tentang apa itu layanan tersembunyi. Seperti biasa, mengenalkan orang pada I2P adalah sebuah perjuangan. Menjelang akhir Congress, kami menjadi yakin bahwa sebagian dari masalahnya adalah perbedaan dalam terminologi. 12 tahun yang lalu, ketika I2P dan Tor mulai, kami masing-masing memberikan persyaratan untuk berbagai bagian sistem kami. Saat ini, terminologi Tor seperti "layanan tersembunyi" dipahami dengan baik dan dianggap hal yang biasa. Terminologi I2P seperti "eepsite" tidak. Kami setuju untuk meninjau dokumentasi kami, router console, dan tempat-tempat lain untuk mendapatkan kesempatan untuk menyederhanakannya dan menggunakan istilah umum.

source: I2P project topics ------------------
es: Temas del proyecto I2P ------------------
id: Topik proyek I2P ------------------

source: ============== 0.9.18 Release ==============
es: ============== Versión 0.9.18 ==============
id: ============== Rilis 0.9.18 ==============

source: 0.9.18 with performance improvements and bug fixes
es: 0.9.18 con mejoras de rendimiento y reparaciones de fallos
id: 0.9.18 dengan perbaikan kinerja dan perbaikan bug

source: 0.9.18 contains several bug fixes and performance improvements. We have shortened the startup time, and reduced latency throughout our network protocols. We've increased the default connection limits for the fastest routers, and reduced the thread usage in i2ptunnel. UPnP fixes should improve handling of external device changes. CPU usage in high-bandwidth routers may be reduced thanks to some NTCP fixes.
es: La 0.9.18 contiene varias reparaciones de fallos y mejoras de rendimiento. Hemos acortado el tiempo de inicio, y reducido la latencia en el conjunto de nuestros protocolos de red. Hemos incrementado los límites de conexión predeterminados para los routers I2P más rápidos, y reducido el uso de hilos en i2ptunnel. Las reparaciones en UPnP deben mejorar el manejo de los cambios en los dispositivos externos. El uso de CPU en routers I2P de alto ancho-de-banda puede reducirse gracias a algunas reparaciones en NTCP.
id: 0.9.18 berisi beberapa perbaikan bug dan peningkatan kinerja. Kami telah mempersingkat waktu startup, dan mengurangi latensi di seluruh protokol jaringan kami. Kami telah meningkatkan batas koneksi default untuk router tercepat, dan mengurangi penggunaan thread di i2ptunnel. Perbaikan UPnP seharusnya memperbaiki penanganan perubahan perangkat eksternal. Penggunaan CPU pada router ber-bandwidth tinggi dapat dikurangi berkat beberapa perbaikan NTCP.

source: Fix parsing of ECDSA address helper in HTTP client proxy
es: Corrige el interpretado del asistente de direcciones EcDSA en el proxy HTTP del cliente.
id: Perbaiki parsing address helper ECDSA di proxy klien HTTP

source: Fix news last-modified processing which prevented notification of update
es: Corrige el procesado del modificado-por-última-vez de las noticias que evitaba la notificación de actualización
id: Perbaikan kabar terakhir yang dimodifikasi yang mencegah pemberitahuan update

source: Improve handling of UPnP device changes
es: Mejora el manejo por parte de UPnP de cambios en los dispositivos
id: Meningkatkan penanganan perubahan perangkat UPnP

source: Don't hang at startup forever waiting for entropy
es: No congela el inicio indefinidamente esperando el valor de entropía
id: Tidak jadi hang saat startup selamanya menunggu entropi

source: Possible fixes for high CPU usage in NTCP
es: Posibles reparaciones para el alto uso de CPU en NTCP
id: Kemungkinan perbaikan untuk penggunaan CPU yang tinggi di NTCP

source: Publish router info faster when address costs change
es: Publica más rápido la información del router I2P cuando los costes de direccionamiento cambian
id: Publikasikan info router lebih cepat saat biaya alamat berubah

source: Start i2ptunnel 90s sooner
es: Inicia i2ptunnel 90 s más pronto
id: Mulai i2ptunnel 90 detik lebih awal

source: Accept tunnels 10m sooner
es: Acepta túneles 10 m más pronto
id: Terimalah terowongan 10 menit lebih cepat

source: Increase exploratory tunnel quantity during initial exploration
es: Incrementa la cantidad de túneles exploratorios durante la exploración inicial
id: Peningkatan jumlah terowongan eksplorasi selama eksplorasi awal

source: Latency reductions in several places
es: Reducciones de latencia en varios puntos
id: Reduksi Latency di beberapa tempat

source: Add startup browser configuration with advanced config routerconsole.browser
es: Añade configuración del navegador al inicIo con configuración avanzada de routerconsole.browser
id: Menambahkan konfigurasi browser startup dengan konfigurasi lanjutan di routerconsole.browser

source: Persistent leaseset keys to eliminate correlation with restart
es: Claves persistentes de leaseset para eliminar la correlación con el reinicio
id: Kunci leaseset yang persistent untuk menghilangkan korelasi dengan restart

source: Faster unchoking of new peers in i2psnark
es: Descongestionamiento más rápido de los nuevos pares (peers) en i2psnark
id: Unchoking lebih cepat untuk peer baru di i2psnark

source: More aggressive throttling of lookups at floodfills
es: Regulamiento más agresivo de búsquedas en routers I2P de inundación (floodfils)
id: Throttlling lookup yang lebih agresif di floodfill

source: Tunnel build request record refactoring
es: Refactorizado del registro de peticiones de construcción de túneles
id: Refactoring untuk perekaman permintaan pembangunan tunnel

source: Reduce thread usage in i2ptunnel
es: Reduce el uso de hilos en i2ptunnel
id: Mengurangi penggunaan thread di i2ptunnel

source: Add i2ptunnel server option for multihomed sites
es: Añade la opción de servidor de i2ptunnel para sitios alojados de modo redundante (multihomed)
id: Menambahkan opsi server i2ptunnel untuk situs multihomed

source: Disallow some common I2P application ports as router ports
es: Desautoriza algunos puertos comunes de aplicaciones I2P como puertos del router I2P
id: Memblokir beberapa port aplikasi I2P yang umum sebagai port router

source: Increase connection limits for fast routers
es: Incrementa los límites de conexión para routers I2P rápidos
id: Meningkatkan batas koneksi untuk router cepat

source: Add Save-As button for SusiMail messages
es: Añade un botón 'Guardar como' para los mensajes de SusiMail
id: Menambahkan tombol Save-As untuk pesan SusiMail

source: Use 'hidden service' terminology in the console
es: Utiliza la terminología 'servicio oculto' en la consola
id: Menggunakan terminologi 'layanan tersembunyi' di konsol

source: Encrypted netdb lookups for 32-bit x86
es: Búsquedas cifradas en la netdb para x86 32-bits
id: Netdb lookup terenkripsi untuk 32-bit x86

source: ============== 0.9.19 Release ==============
es: ============== Versión 0.9.19 ==============
id: ============== Rilis 0.9.19 ==============

source: 0.9.19 with performance improvements and bug fixes
es: 0.9.19 con mejoras de rendimiento y reparaciones de fallos
id: 0.9.19 dengan perbaikan kinerja dan perbaikan bug

source: 0.9.19 has several fixes and improvements for floodfill performance. Many of you saw high CPU usage after 0.9.18 was released. This was caused by a combination of increased encryption usage, the big influx of Vuze users into the network, reduced floodfills due to tighter performance requirements, and some longstanding bugs. Things should be a lot better after most of the network has updated. As always, the best way to reduce CPU usage is to lower your bandwidth limits.
es: La 0.9.19 tiene varias reparaciones y mejoras para el rendimiento del router I2P de inundación (floodfil). Muchos de ustedes vieron un alto uso de CPU después de la publicación de la 0.9.18. Esto fue causado por una combinación del uso incrementado del cifrado, el gran influjo de los usuarios de Vuze en la red, una reducción de los routers I2P de inundación debido a requerimientos de rendimiento más ajustados, y algunos fallos persistentes. Las cosas deberán estar mucho mejor después de que la mayoría de la red se haya actualizado. Como siempre, la mejor manera de reducir el uso de CPU es que reduzca sus límites de ancho de banda.
id: 0.9.19 memiliki beberapa perbaikan dan perbaikan kinerja untuk floodfill. Banyak dari Anda melihat penggunaan CPU yang tinggi setelah 0.9.18 dirilis. Hal ini disebabkan oleh kombinasi penggunaan enkripsi yang meningkat, masuknya pengguna Vuze ke dalam jaringan, mengurangi pemborosan karena persyaratan kinerja yang lebih ketat, dan beberapa bug yang telah berlangsung lama. Hal-hal seharusnya menjadi jauh lebih baik setelah sebagian besar jaringan telah diperbarui. Seperti biasa, cara terbaik untuk mengurangi penggunaan CPU adalah dengan menurunkan batas bandwidth Anda.

source: We've also added new ways to reseed manually, and to generate a reseed file you can easily share with others who need it. See the reseed configuration page in the router console for more information.
es: También hemos añadido nuevas formas de resembrar manualmente, y de generar un fichero de resembrado que puede compartir fácilmente con otros que lo necesiten. Vea la página de configuración del resembrado en la consola del router I2P para más información.
id: Kami juga telah menambahkan cara-cara baru untuk melakukan reseed secara manual, dan untuk membuat file yang bisa Anda reseed dengan mudah dapat Anda bagikan dengan orang lain yang membutuhkannya. Lihat halaman konfigurasi reseed di router console untuk informasi lebih lanjut.

source: Floodfill performance improvements
es: Mejoras del rendimiento de los routers I2P de inundación (floodfills)
id: Perbaikan kinerja floodfill

source: Easier ways to reseed manually from a file or URL
es: Formas más fáciles de resembrar manualmente desde un fichero o una URL
id: Cara mudah untuk melakukan reseed secara manual dari file atau URL

source: New way to export reseed data for others
es: Una nueva forma de exportar los datos de resembrado para otros
id: Cara baru untuk mengekspor data reseed kepada orang lain

source: Support for installing plugin from file
es: Soporte para instalar un complemento desde fichero
id: Dukungan untuk menginstal plugin dari file

source: Fixes for high CPU usage in floodfills
es: Reparaciones para un alto uso de CPU en los routers I2P de inundación (floodfills)
id: Perbaikan untuk penggunaan CPU yang tinggi di floodfill

source: i2ptunnel locking fixes
es: Reparaciones para el bloqueo de i2ptunnel
id: Perbaikan penguncian i2ptunnel

source: Fixes for read timeout handling in streaming
es: Reparaciones para el manejo del tiempo de espera de lectura en streaming
id: Perbaikan untuk penanganan read timeout dalam streaming

source: Fix changing i2psnark data directory on Windows
es: Reparación para el cambio de directorio de datos de i2psnark sobre Windows
id: Perbaikan perubahan direktori data i2psnark di Windows

source: Fix multiple SSL outproxies in HTTP client
es: Reparación para múltiples proxys de salida SSL en el cliente HTTP
id: Perbaikan beberapa outprox SSL dalam klien HTTP

source: Update to UPnP library version 3.0
es: Actualización a la librería UPnP versión 3.0
id: Pembaruan ke library UPnP versi 3.0

source: Improve tracking of floodfill lookup success
es: Mejora del seguimiento del éxito de las búsquedas por router I2P de inundación (floodfill)
id: Peningkatan pelacakan dari keberhasilan pencarian floodfill

source: Direct router info lookups if connected to floodfill
es: Búsquedas directas de información de router I2P si está conectado a un router I2P de inundación (floodfill)
id: Mengarahkan pencarian info router jika terhubung ke floodfill

source: Auto-adjustment of i2psnark tunnel quantity
es: Auto-ajuste de la cantidad de túneles de i2psnark
id: Penyesuaian otomatis jumlah tunnel di i2psnark

source: Increase exploratory tunnel quantity when floodfill
es: Incremento de la cantidad de túneles exploratorios cuando se esté en modo router I2P de inundación (floodfill)
id: Peningkatan kuantitas tunnel eksplorasi saat floodfill

source: Increase min and default bandwidth for i2psnark
es: Incremento del ancho de banda mínimo y del predeterminado para i2psnark
id: Peningkatan bandwidth minimum dan default untuk i2psnark
