Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: One of the benefits of starting the above work now, is that over the last few years there have been independent efforts to create simple protocols and protocol frameworks that achieve many of the aims we have for our own protocols, and have gained traction with the wider community. By leveraging this work, we get a "force multiplier" effect: - We benefit from protocol designs, security proofs, and code written by others, reducing the amount of work we need to do for the same level of feature-completeness and security assurances. - Work we do can be leveraged by other communities, increasing their interest in collaborating with us, and thinking about I2P as a whole.
es: Uno de los beneficios de iniciar el trabajo descrito ahora, es que durante los últimos años ha habido esfuerzos independientes para crear protocolos simples y estructuras de protocolo que logren muchos de los objetivos que tenemos para nuestros propios protocolos, y hemos ganado tracción con una comunidad más amplia. Al potenciar este trabajo, obtenemos un efecto multiplicador. - Nos beneficiamos de diseños de protocolos, pruebas de seguridad, y código escrito por otros, reduciendo la cantidad de trabajo que necesitamos hacer para lograr el mismo nivel de perfeccionamiento de características y certidumbre de seguridad. - El trabajo que hacemos puede ser potenciado por otras comunidades, incrementando su interés en colaborar con nosotros, y reflexionando acerca de I2P en su conjunto.
id: Salah satu manfaat dari memulai hal-hal yang tersebut sekarang adalah selama beberapa tahun terakhir ada beberapa usaha independen untuk membuat protokol sederhana dan framework protokok yang berhasil mencapai beberapa tujuan yang diinginkan protokol kami, dan mendapat dukungan dari komunitas yang lebih luas. Dengan mendukung pekerjaan ini, kami mendapat efek "force multiplier": - Kami mendapat manfaat dalam desain protokol, keamanan security, dan kode yang ditulis pihak lain, mengurangi jumlah pekerjaan yang harus dilakukan dengan tingkat kelengkapan fitur dan jaminan keamanan yang sama. - Pekerjaan yang kami lakukan dapat diperkuat oleh komunitas lain, meningkatkan minat dalam berkolaborasi dengan kami, dan memikirkan I2P secara umum.

source: My proposals in particular will be leveraging the `Noise Protocol Framework`_, and the `SPHINX packet format`_. I have collaborations lined up with several people outside I2P for these!
es: Mis propuestas en particular van a potenciar el `Noise Protocol Framework`_ (marco del protocolo de ruido), y el `formato de paquete SPHINX`_. ¡Para estas tengo colaboraciones asignadas con varias personas externas a I2P!
id: Proposal saya khususnya akan meningkatkan `Noise Protocol Framework`_, dan `SPHINX packet format`_. Untuk ini, saya telah berkolaborasi dengan orang-orang di luar I2P!

source: Priority: Clearnet collaboration --------------------------------
es: Prioritario: Colaboración de clearnet --------------------------------
id: Prioritas: Kolaborasi dengan clearnet --------------------------------

source: On that topic, we've been slowly building interest over the last six months or so. Across PETS2017, 34C3, and RWC2018, I've had some very good discussions about ways in which we can improve collaboration with the wider community. This is really important to ensure we can garner as much review as possible for new protocols. The biggest blocker I've seen is the fact that the majority of I2P development collaboration currently happens inside I2P itself, which significantly increases the effort required to contribute.
es: Sobre ese tema, hemos estado atrayendo el interés durante los últimos seis meses o así. A lo largo de PETS2017, 34C3, y RWC2018, he tenido algunos buenos debates acerca de formas en las que podemos mejorar la colaboración con la comunidad en un sentido más ampliio. Esto es realmente importante para asegurar que podemos acumular tantas revisiones como sea posible para nuevos protocolos. El mayor obstáculo que he observado es de hecho que la mayoría de la colaboración de desarrollo de I2P actualmente ocurre en el interior del propio I2P, lo que incrementa significativamente el esfuerzo requerido para contribuir.
id: Untuk topik ini, kami telah pelan-pelan membangun minat selama kira-kira enam bulan. Saat PETS2017, 34C3, and RWC2018, saya telah melakukan banyak diskusi bagus tentang cara meningkatkan kolaborasi dengan komunitas yang lebih luas. Ini sangat penting untuk memastikan pengumpulan review sebanyak mungkin untuk protokol-protokol baru. Penghalang terbesar adalah fakta bahwa mayoritas kolaborasi pengembangan I2P sekarang terjadi di dalam jaringan I2P, yang secara signifikan meningkatkan usaha untuk berkontribusi.

source: The two priorities in this area are: - Set up a project-run development forum that is accessible both inside and outside I2P. - Set up mailing lists for review and discussion of proposals (possibly connected to the above forum).
es: Las dos prioridades en este área son: - Establecer un proyecto-llevar un foro de desarrollo que sea accesible tanto desde dentro como desde fuera de I2P. - Establecer listas de correo para revisión y debate de propuestas (posiblemente conectadas con el foro anterior).
id: Ada dua prioritas di area ini: di luar I2P. - Membuat milis untuk review dan diskusi proposal (kemungkinan terhubung ke forum di atas).

source: Other goals which are classed as nice-to-have: - Set up a usable git-to-mtn pathway, to enable us to effectively solicit clearnet contributions on GitHub while keeping the canonical dev environment on Monotone. - Write a "position paper" that accurately explains I2P to academic audiences, and puts it in context with existing literature.
es: Otras metas clasificadas como deseables: - Establecer una senda usable git-a-mtn, para habilitarnos a solicitar de forma efectiva contribuciones sobre clearnet (red abierta) en GitHub mientras mantenemos el entorno de desarrollo canónico en Monotone. - Escribir un "documento de posición" que explique I2P con precisión a audiencias académicas y lo ponga en contexto con la literatura existente.
id: Tujuan lain yang digolongkan sebagai nice-to-have: - Membuat git-to-mtn pathway yang berfungsi, yang memungkitkan secara efektif meminta kontribusi clearnet di GitHub sambil melanjutkan lingkungan kerja pengembangan canonical di Monotone. - Menulis sebuah "position paper" yang secara akurat menjelaskan I2P ke pembaca akademik, dan menempatkannya ke dalam daftar pustaka yang sudah ada.

source: I expect that collaborations with people outside I2P will be done entirely on GitHub, for minimal friction.
es: Espero que las colaboraciones con personas fuera de I2P sean realizadas por completo sobre GitHub, para minimizar fricciones.
id: Saya berharap bahwa kolaborasi dengan orang di luar I2P akan dilakukan sepenuhnya di GitHub, untuk meminimalkan gesekan.

source: Priority: Preparation for long-lived releases ---------------------------------------------
es: Prioritario: Preparación para versiones de vida-larga ---------------------------------------------
id: Prioritas: Persiapan untuk rilis long-lived ---------------------------------------------

source: I2P is now in Debian Sid (their unstable repo) which will stablilise in around a year and a half, and has also been pulled into the Ubuntu repository for inclusion in the next LTS release in April. We are going to start having I2P versions that end up hanging around for years, and we need to ensure we can handle their presence in the network.
es: I2P ahora está en Debian Sid (su repositorio inestable) que se estabilizará en alrededor de un año y medio, y también ha sido incorporado al repositorio de Ubuntu para su inclusión en el próxima versión LTS (de soporte a largo plazo) en Abril. Vamos a comenzar a tener versiones de I2P que terminen deambulando durante años, y tenemos que asegurarnos de que podemos manejar su presencia en la red.
id: I2P sekarang ada di dalam Debian Sid (di dalam repository unstable) yang akan menjadi stabil dalam sekitar satu setengah tahun, dan sudah diambil ke dalam repository Ubuntu untuk digunakan di rilis LTS berikutnya di bulan April. Kami akan memulai versi I2P yang dapat digunakan selama bertahun-tahun, dan kami perlu memastikan bahwa kami dapat menangani keberadaannya di dalam jaringan.

source: The primary goal here is to roll out as many of the new protocols as we feasibly can in the next year, to hit the next Debian stable release. For those that require multi-year rollouts, we should incorporate the forward-compatability changes as early as we can.
es: El objetivo principal aquí es presentar tantos de los nuevos protocolos como nos sea factible en el próximo año, para alcanzar la siguiente versión de Debian estable. Para aquellos que requieran despliegues durante varios años, debemos incorporar los cambios de compatibilidad-hacia-delante tan pronto como podamos.
id: Tujuan utama di sini adalah mengeluarkan protokol baru sebanyak mungkin di tahun mendatang, untuk mencapai liris stable di Debian. Untuk rilis jangka panjang, kami perlu menerapkan perubahan kompatibilitas ke depan secepat mungkin.

source: Priority: Pluginization of current apps ---------------------------------------
es: Prioritario: Pluginización de las actuales aplicaciones ---------------------------------------
id: Prioritas: Penerapan Plugin di aplikasi-aplikasi sekarang ---------------------------------------

source: The Debian model encourages having separate packages for separate components. We agreed that decoupling the currently-bundled Java applications from the core Java router would be beneficial for several reasons: - It codifies the boundary between the applications and the router. - It should make it easier to get these apps running with non-Java routers. - It would enable third parties to create "I2P bundles" containing just the applications they want.
es: El modelo de Debian anima a tener paquetes separados para componentes separados. Estamos de acuerdo en que desacoplar la aplicaciones Java actualmente incluidas del router I2P Java central, sería beneficioso por varias razones: - Codifica el límite entre las aplicaciones y el router I2P. - Debe hacer más fácil lograr que estas aplicaciones se ejecuten en routers I2P no-Java. - Habilitaría que terceros crearan "Paquetes de I2P" conteniendo sólo las aplicaciones que desean.
id: Model Debian mensyaratkan paket terpisah untuk setiap komponen. Kami bersepakat bahwa pemisahan aplikasi Java, yang selama ini dibundel, dari ini router Java akan bermanfaat karena beberapa alasan: - Menjelaskan batasan antara aplikasi dan router. - Memudahkan aplikasi dijalan dengan router non-Java. - Membuat pihak ketiga membuat bundel I2P yang berisi aplikasi yang mereka inginkan.

source: In combination with the earlier priorities, this moves the main I2P project more in the direction of e.g. the Linux kernel. We will spend more time focusing on the network itself, leaving third-party developers to focus on applications that use the network (something that is significantly easier to do after our work in the last few years on APIs and libraries).
es: En combinación con las prioridades anteriores, esto mueve el proyecto I2P principal más en la dirección p.e. del kernel Linux. Pasaremos más tiempo centrándonos en la propia red, dejando que desarrolladores terceros se ocupen de aplicaciones que usen la red (algo significativamente más fácil de hacer tras nuestro trabajo de los últimos años sobre APIs y librerías).
id: Dalam kombinasi dengan prioritas sebelumnya, ini memindahkan proyek I2P utama lebih ke arah seperti kernel Linux. Kita akan menghabiskan waktu lebih banyak berfokus pada jaringan itu sendiri, membiarkan pengembang pihak ketiga untuk berfokus pada aplikasi yang menggunakan jaringan (sesuatu yang secara signifikan lebih mudah untuk dilakukan setelah pekerjaan kami dalam beberapa tahun terakhir pada API dan library).

source: Nice-to-have: App improvements ------------------------------
es: Deseable: Mejoras de la aplicación ------------------------------
id: Nice-to-have: Pengembangan aplikasi ------------------------------

source: There are a bunch of app-level improvements that we want to work on, but do not currently have the developer time to do so, given our other priorities. This is an area we would love to see new contributors for! Once the above decoupling is complete, it will be significantly easier for someone to work on a specific application independently of the main Java router.
es: Hay un montón de mejoras a nivel de aplicación sobre las que queremos trabajar, pero actualmente nuestros desarrolladores no disponen de tiempo para abordarlas, dado el resto de nuestras prioridades. ¡Este es área para el que nos encantaría ver nuevos contribuidores! Una vez se complete el desacoplamiento descrito, será significativamente más fácil para alguien trabajar sobre una aplicación específica independientemente del router I2P Java.
id: Ada banyak pengembangan di tingkat aplikasi yang perlu dilakukan, tapi tidak ada waktu untuk mengembangkannya karena beberapa prioritas yang sudah dibuat. Ini adalah area yang memerlukan kontributor baru! Setelah pemisahan aplikasi dan core router selesai, akan lebih mudah untuk mengerjakan aplikasi yang independen dari router Java.

source: One such application we would love to have help with is I2P Android. We will be keeping it up-to-date with the core I2P releases, and fixing bugs as we can, but there is much that could be done to improve the underlying code as well as the usability.
es: Una de esas aplicaciones para las que nos encantaría recibir ayuda es I2P Android. La mantendremos actualizada con las versiones centrales de I2P, y corregiremos fallos según podamos, pero hay muchas cosas que se podrían hacer para mejorar el código subyacente así como la usabilidad.
id: Aplikasi seperti itu yang diperlukan di I2P Android. Kami akan membuat hal ini up-to-date dengan rilis I2P core, dan memperbaki bug sebisa kami, tapi ada banyak hal yang dapat dilakukan untuk meningkatkan kode dasar dan kegunaannya.

source: Priority: Susimail and I2P-Bote stabilisation ---------------------------------------------
es: Prioritario: Estabilización de Susimail e I2P-Bote ---------------------------------------------
id: Priority: Susimail dan penstabilan I2P-Bote ---------------------------------------------

source: Having said that, we do want to work specifically on Susimail and I2P-Bote fixes in the near term (some of which have landed in 0.9.33). They have had less work over the last few years than other I2P apps, and so we want to spend some time bringing their codebases up to par, and making them easier for new contributors to jump into!
es: Habiendo dicho esto, queremos trabajar específicamente sobre correcciones en Susimail e I2P-Bote a corto plazo (algunas de las cuales ya se han implantado en la 0.9.33). Estas han recibido menos cuidados durante los últimos años que otras aplicaciones de I2P, así que queremos pasar más tiempo poniendo sus bases de código a la par, ¡y haciendo que sean más fácilmente abordables para nuevos contribuidores!
id: Karena itu, kami ingin bekerja secara khusus pada perbaikan Susimail dan I2P-Bote dalam waktu dekat (beberapa di antaranya telah diterapkan di 0.9.33). Mereka memiliki lebih sedikit pekerjaan selama beberapa tahun terakhir dari aplikasi I2P lainnya, jadi kami ingin menghabiskan waktu untuk membawa kode pemogramannya menjadi selevel, dan membuatnya lebih mudah untuk dikerjakan oleh kontributor baru!

source: We have a large backlog of tickets in a number of I2P subsystems and apps. As part of the above stabilisation effort, we would love to clean up some of our older long-standing issues. More importantly, we want to ensure that our tickets are correctly organised, so that new contributors can find good tickets to work on.
es: Tenemos un gran acopio de tickets (asuntos instados) de varios de los subsistemas y aplicaciones de I2P. Como parte del esfuerzo de estabilización descrito, nos encantaría deshacernos de algunos de nuestros asuntos de mayor antigüedad. Aún más importante, queremos asegurar que nuestros tickets estén correctamente organizados, de forma que los nuevos contribuidores puedan encontrar buenos tickets sobre los que trabajar.
id: Ada banyak backlog tiket di beberapa subsistem dan aplikasi I2P. Sebagai bagian dalam usaha stabilisasi di atas, kami ingin membersihkan beberapa masalah yang sudah berjalan lama. Lebih penting lagi, kami ingin memastikan tiket-tiket tersebut terorganisir secara benar, sehingga kontributor baru dapat menemukan tiket yang bagus untuk dikerjakan.

source: Priority: User support ----------------------
es: Prioritario: Soporte del usuario ----------------------
id: Priority: Dukungan pengguna ----------------------

source: One aspect of the above we will be focusing on is keeping in touch with users who take the time to report issues. Thank you! The smaller we can make the feedback loop, the quicker we can resolve problems that new users face, and the more likely it is that they keep participating in the community.
es: Un aspecto de lo anterior sobre el que nos estaremos centrando es mantenernos en contacto con los usuarios que se toman su tiempo en informar de problemas. ¡Gracias! Cuanto más corto podamos hacer el ciclo de comunicación más rápido podremos resolver los problemas a los que se enfrentan los nuevos usuarios, y es más probable que continúen participando en la comunidad.
id: Salah satu aspek di atas adalah kami akan berfokus dalam terus berhubungan dengan pengguna yang menyempatkan diri dalam melaporkan masalah. Terima kasih! Dengan membuat feedback loop yang kecil, kami dapat menyelesaikan masalah yang dialami pengguna baru dengan lebih cepat, dan lebih memungkinkan mereka untuk tetap berkontribusi kepada komunitas.

source: We'd love your help! --------------------
es: ¡Nos encantaría que nos ayudase! --------------------
id: Kami akan sangat senang dengan bantuan Anda! --------------------

source: That all looks very ambitious, and it is! But many of the items above overlap, and with careful planning we can make a serious dent in them.
es: ¡Todo esto parece muy ambiguo, y lo es! Pero muchos de los elementos descritos se solapan, y con una planificación cuidadosa podemos hacerles verdadera mella..
id: Memang semua ini terlihat sangat ambisius! Namun, banyak hal di atas tumpang tindih, dan dengan perencanaan hati-hati kami akan membuat banyak peningkatan.

source: If you are interested in helping with any of the goals above, come chat to us! You can find us on OFTC and Freenode (#i2p-dev), and Twitter (@GetI2P).
es: Si está interesado en ayudar con alguno de los objetivos anteriores, ¡venga y chatee con nosotros! Puede encontrarnos en OFTC y Freenode (#i2p-dev), y en Twitter (@GetI2P).
id: Jika Anda tertarik dalam membantu kami di salah satu tujuan di atas, ayo chat dengan kami! Anda dapat menemukan kami di OFTC dan Freenode (#i2p-dev), dan Twitter (@GetI2P).

source: ================ I2P at BSidesNYC ================
es: ================ I2P en BSidesNYC ================
id: ================ I2P di BSidesNYC ================

source: Trip report about the I2P meetup at BSidesNYC.
es: Informe del viaje sobre el encuemtro de I2P en BSidesNYC.
id: Trip melaporkan pertemuan I2P di BSidesNYC.

source: 0.9.34 with Bug Fixes
id: 0.9.34 memiliki perbaikan bug

source: 0.9.34 contains a lot of bug fixes! It also has improvements in SusiMail, IPv6 handling, and tunnel peer selection. We add support for IGD2 schemas in UPnP. There's also preparation for more improvements you will see in future releases.
es: ¡La 0.9.34 contiene muchas correcciones de fallos! También tiene mejoras en SusiMail, manejo de IPv6, y selecciòn de contraparte de túnel. Añadimos soporte para esquemas IGD2 en UPnP. También hay preparación para más mejoras que verá en futuras versiones.
id: 0.9.34 memiliki banyak perbaikan bug. Juga ada banyak perbaikan di SusiMail, IPv6 handling, dan pemilihan tunnel peer. Kami menambah dukungan IGD2 schemas di UPnP. Ada juga persiapan untuk peningkatan yang akan terlihat di rilis-rilis berikutnya.

source: SusiMail: Improved startup and memory management
id: SusiMail: Peningkatan manajemen startup dan memory

source: UPnP: Support IGD 2
id: UPnP: Mendukung IGD 2

source: Console: Numerous fixes
id: Console: Banyak perbaikan

source: i2ptunnel: Fix servers not accepting after router restart
id: i2ptunnel: Perbaikan servers tidak menerima setelah router di-restart

source: Router: Improved tunnel peer selection for hidden and IPv6-only modes
id: Router: peningkatan pemilihan tunnel peer untuk mode tersembunya dan IPv6-only

source: SusiMail: Numerous fixes
id: SusiMail: Banyak perbaikan

source: Transport: Better selection of IPv6 addresses
id: Transport: Pemilihan alamat IPv6 yang lebih baik

source: Prep for HTTPS console and eepsite
id: Persiapan HTTPS console dan eepsite

source: Prep for splitting up Debian package
id: Persiapan pemisahan paket Debian

source: Streaming: Return HTTP response when limits exceeded
id: Streaming: Pesan HTTP ketika batasan dilampaui

source: Console: Number formatting changes
id: Console: Perubahan format nomor

source: EdDSA cleanups
id: Pembersihan EdDSA

source: 0.9.35 with SusiMail folders and SSL Wizard
es: 0.9.35 con carpetas de SusiMail y asistente de instalación de SSL
id: 0.9.35 dirilis dengan folders SusiMail dan SSL Wizard

source: 0.9.35 adds support for folders in SusiMail, and a new SSL Wizard for setting up HTTPS on your Hidden Service website. We also have the usual collection of bug fixes, especially in SusiMail.
es: 0.9.35 añade soporte para carpetas en SusiMail, y un nuevo Asistente SSL para configurar HTTPS en su sitio web de Servicio Oculto. También tenemos la habitual colección de correcciones de errores, especialmente en SusiMail.
id: 0.9.35 menambah dukungan folder di SusiMail, dan SSL Wizard baru untuk mengatur HTTPS di situs web Hidden Service Anda. Ada perbaikan bug, terutama di SusiMail.

source: We're hard at work on several things for 0.9.36, including a new OSX installer and a faster, more secure transport protocol called NTCP2.
es: Estamos trabajando duro en varias cosas para 0.9.36, incluyendo un nuevo instalador de OSX y un protocolo de transporte más rápido y seguro llamado NTCP2.
id: Kami berusaha keras untuk memperbaiki versi 0.9.36, termasuk installer baru untuk OSX dan protol baru yang lebih cepat dan aman, yang bernama NTCP2.

source: I2P will be at HOPE in New York City, July 20-22. Find us and say hello!
es: I2P estará en HOPE en la ciudad de Nueva York, del 20 al 22 de julio. Encuéntranos y dinos hola!
id: I2P akan hadir di HOPE di New York City, Juli tanggal 20-22. Cari kami dan sapa!

source: New Hidden Service SSL Wizard
id: Hidden Service SSL Wizard Baru

source: SusiMail support for Folders, Drafts, background sending
id: SusiMail mendukung Folders, Drafts, pengiriman email di latar belakang

source: Console: Fix changes to wrong tunnel on /configtunnels
id: Console: Perbaikan perubahan ke tunnel yang salah di file /configtunnels

source: CPUID: Fix TBM detection
id: CPUID: Perbaikan deteksi TBM

source: i2psnark: Fix torrents ignoring priority settings when autostart enabled
id: i2psnark: Perbaikan torrents tidak mengikuti aturan perioritas ketika autostart diaktifkan

source: i2ptunnel: Retry accept after server socket closed
id: i2ptunnel: Retry diterima setelah server socket ditutup

source: NTCP: Fix bug causing initial latency for outbound connections
id: NTCP: Perbaikan bug yang membuat latency awal untuk koneksi keluar

source: SusiMail: Include attachments in forwarded mail
id: SusiMail: Memasukkan attachments di email yang diteruskan

source: SusiMail: Many other fixes
id: SusiMail: Banyak perbaikan lain
