Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: The speakers and the schedule of the I2PCon in Toronto 2015 have been announced. Have a look on the `I2PCon page`_ for details. Reserve your seat on `Eventbrite`_.
es: Los oradores y el programa de la I2PCon 2015 en Toronto han sido anunciados. Heche un vistazo a la `página I2PCon`_ para los detalles. Reserve su sitio en `Eventbrite`_.
id: Pembicara dan jadwal I2PCon Toronto 2015 telah diumumkan. Silahkan lihat di 'halaman I2PCon`_ untuk rinciannya. Pesan tempat duduk Anda di `Eventbrite`_.

source: Add multisession support for dual-signature crypto on the same tunnels
es: Añade soporte multisesión para criptografía de firma dual en los mismos túneles
id: Tambahan dukungan multisession untuk tanda tangan crypto ganda pada tunnel yang sama

source: Use multisession for shared clients
es: Usa multisesión para clientes compartidos
id: Pengunaan multisession untuk shared client

source: Increase default outbound bandwidth limit to 60 KBps
es: Incrementa el límite predeterminado de ancho de banda de salida a 60 KBps
id: Peningkatan batas bandwidth outbound default menjadi 60 KBps

source: Increase default maximum participating tunnels
es: Incrementa el máximo predeterminado de túneles participantes
id: Peningkatan participating tunnel secara default

source: Floodfills will send database store acks directly if connected, for efficiency
es: Si están conectados los routers I2P floodfill enviarán directamente los acuses de recibo de la base de datos de almacenamiento, por eficiencia
id: Floodfills akan mengirimkan ack store database secara langsung jika terhubung, untuk peningkatan efisiensi

source: Set TCP keepalive on I2CP and SAM sockets
es: Establece TCP keepalive en I2CP y sockets SAM
id: penetapan TCP keepalive pada soket I2CP dan SAM

source: More efficient decompression in HTTP proxy, use less threads
es: Descompresión más eficiente en HTTP proxy, usa menos hilos
id: Dekompresi yang lebih efisien dalam proxy HTTP, pengurangan penggunaan thread

source: Add support for fast extensions in i2psnark
es: Añade soporte para extensiones rápidas en i2psnark
id: Penambahan dukungan untuk ekstensi cepat di i2psnark

source: i2psnark only autostarts torrents that were running previously
es: i2psnark sólo autoinicia torrents que estuvieron corriendo previamente
id: i2psnark hanya memulai otomatis torrent yang sebelumnya sudah berjalan

source: Add support for translated console news
es: Añade soporte para novedades de consola traducidas
id: Tambahan dukungan untuk terjemahan berita konsol

source: SSU fixes to compete better with NTCP for bandwidth when limited
es: Reparaciones de SSU para competir mejor con NTCP por el ancho de banda cuando esté limitado
id: Perbaikan SSU untuk bersaing lebih baik dengan NTCP untuk bandwidth saat terbatas

source: Fixes to prevent SSU stalls
es: Correcciones para evitar atascos de SSU
id: Perbaikan untuk mencegah SSU menjadi stalled

source: Wait for outbound tunnels before sending first leaseset to client, to prevent dropping first message
es: Espera para túneles salientes antes de enviar el primer leaseset al cliente, para evitar la pérdida del primer mensaje.
id: Menunggu tunnel keluar sebelum mengirim leaseset pertama ke klien, untuk mencegah pesan pertama ditolak

source: Clean up resources correctly when SAM stops
es: Limpia los recursos correctamente cuando SAM se detiene
id: Pembersihan sumber daya dengan benar saat SAM berhenti

source: Better error handling and notification when HTTP proxy is not running
es: Mejor gestión de errores y notificación cuando el proxy HTTP no esté en ejecución
id: Penanganan dan notifikasi kesalahan yang lebih baik saat proxy HTTP tidak berjalan

source: More i2ptunnel fixes at startup and shutdown of tunnels
es: Más reparaciones de i2ptunnel al inicio y cierre de túneles
id: Perbaikan i2ptunnel lebih banyak saat startup dan shutdown tunnel

source: Fix total_size in i2psnark metadata message
es: Corrige total_size en el mensaje de metadatos de i2psnark
id: Perbaiki total_size dalam pesan metadata i2psnark

source: Restore dates in console news headers
es: Restaura las fechas en las cabeceras de novedades de consola
id: Pemulihan tanggal di header berita console

source: Several I2CP fixes
es: Varias reparaciones de I2CP
id: Beberapa perbaikan I2CP

source: Use same session for naming lookups in I2PSocketEepGet
es: Usa la misma sesión para nombrar búsquedas en I2PSocketEepGet
id: Penggunaan sesi yang sama untuk menamai lookup di I2PSocketEepGet

source: Increase max bandwidth to 16 MBps, add larger Bloom filter
es: Incrementa el ancho de banda máximo a 16 MBps, añade un filtro Bloom más grande
id: Peningkatan bandwidth maksimal hingga 16 MBps, penambahan filter Bloom yang lebih besar

source: New floodfills will send their info to nearby floodfills to speed integration
es: Los nuevos routers I2P floodfill enviarán su información a los routers I2P floodfill cercanos para acelerar la integración
id: Floodfills baru akan mengirim info mereka ke floodfills terdekat untuk meningkatkan kecepatan integrasi

source: ============================ I2PCon: Mission Accomplished ============================
es: ============================ I2PCon: Misión cumplida ============================
id: ============================ I2PCon: Misi Berhasil ============================

source: I2PCon: Mission Accomplished
es: I2PCon: Misión cumplida
id: I2PCon: Misi Berhasil

source: I2PCon has been a giant success. For us, the I2P contributors, it represents a leap forward in terms of what we're capable of pulling off as a community, how we communicate the usecases of I2P and reach out to privacy conscious individuals. By arranging this event, we've also grown our community. People who've previously only lurked on our irc channels, or run our software or possibly hadn't even heard of I2P are now a part of our comminuty. This event has been our first active step towards building a large and inclusive community, and as such it's been great success.
es: I2PCon ha sido un enorme éxito. Para nosotros los contribuidores de I2P, representa un salto adelante en términos de lo que somos capaces de conseguir como comunidad, cómo comunicamos los casos de uso de I2P y llegamos a individuos concienciados con la privacidad. Al organizar este evento, también hemos cultivado nuestra comunidad. Las personas que previamente sólo estabamos agazapados en nuestros canales de IRC, o ejecutábamos nuestro software, o posiblemente ni siquiera habíamos oído de I2P, ahora son una parte de nuestra comunidad. Este evento ha sido nuestro primer paso activo hacia la construcción de una comunidad grande e inclusiva, y como tal está siendo un gran éxito.
id: I2PCon telah sukses besar. Bagi kami, kontributor I2P, ini merupakan lompatan ke depan dalam hal apa yang dapat kita lakukan sebagai sebuah komunitas, bagaimana kita mengkomunikasikan penerapan I2P dan menjangkau individu yang sadar privasi. Dengan mengatur acara ini, kami juga telah menumbuhkan komunitas kami. Orang-orang yang sebelumnya hanya mengintai saluran irc kami, atau menjalankan perangkat lunak kami, atau mungkin bahkan belum pernah mendengar tentang I2P sekarang menjadi bagian dari komitment kami. Acara ini merupakan langkah aktif pertama kami untuk membangun komunitas besar dan inklusif, dan karena itu sukses besar.

source: Minutiae ======== On day 2 we had two short discussion sessions. A more general discussion and a roadmapping discussion. The minutiae can be found here: `I2P Roadmap session minutiae`_ and `I2P Discussion session minutiae`_.
es: Pormenores ======== El día 2 tuvimos dos sesiones de debate cortas. Un debate más general y un debate sobre hoja de ruta. Los pormenores se pueden encontrar aquí: `Pormenores de la sesión de hoja de ruta de I2P`_ y `Pormenores de la sesión de debate sobre I2P`_.
id: Detail kecil ======== Pada hari ke-2 kami mengadakan dua sesi diskusi singkat. Diskusi yang lebih umum dan diskusi tentang roadmap. Detail-detail kecil dapat ditemukan di sini: 'sesi I2P Roadmap minutiae`_ dan 'sesi diskusi I2P minutiae`_.

source: Photos ======
es: Fotos ======
id: Foto-foto ======

source: The learn how to setup I2P crypto party station
es: El aprendizaje de cómo montar una estación de crypto fiesta de I2P
id: Belajar bagaimana menyiapkan stasiun di pesta kripto I2P

source: The learn how use I2P and Vuze party station
es: El aprendizaje de cómo usar una estación de fiesta de I2P y Vuze
id: Belajar bagaimana menggunakan stasiun I2p dan Vuze

source: David Dagons wonderful talk
es: La maravillosa charla de David Dagons
id: Diskusi hebat dengan David Dagons

source: Thanks ======
es: Gracias ======
id: Terima kasih ======

source: We've had some wonderful speakers, from both inside- and outside of our community. `David Dagon`_ talked to us about the way forward and how I2P could handle potential abuse. `Lance James`_ - the creator of our predecessor iip - said Hi and gave us his thoughts about how far I2P has come. `Nick Johnston`_ gave us a wonderful talk about why privacy matters and why you should care.
es: Tuvimos algunos oradores maravillosos, tanto de dentro como de fuera de nuestra comunidad. `David Dagon`_ nos habló acerca del camino por delante y de cómo I2P podría gestionar el abuso potencial. `Lance James`_ - el creador de nuestro predecesor IIP - nos dijo Hola y nos ofreció sus pensamientos acerca de lo lejos que ha llegado I2P. `Nick Johnston`_ nos ofreció una maravillosa charla acerca de por qué la privacidad importa y por qué debería interesarse.
id: Kami memiliki beberapa pembicara hebat, baik dari dalam maupun luar komunitas kami. `David Dagon`_ berbicara kepada kami tentang jalan ke depan dan bagaimana I2P dapat menangani penyalahgunaan potensial. `Lance James`_ - pencipta pendahulunya iip - mengucapkan salam dan memberikan pemikirannya kepada kami tentang sejauh mana I2P telah berkembang. `Nick Johnston` memberi kami sebuah ceramah yang bagus tentang mengapa privasi adalah hal yang penting dan mengapa Anda harus peduli.

source: I would also like to thank the speakers from our community. `psi`_, `@str4d`_ and `zzz`_ who all had wonderful talks. Improving our ability to inform people about I2P is something that is going to be important for us going forward.
es: También me gustaría agradecer a los oradores de nuestra comunidad, `psi`_, `@str4d`_ y`zzz`_ quienes han tenido todos ellos charlas maravillosas. Mejorar nuestra capacidad de informar a la gente acerca de I2P es algo que va a ser importante para que avancemos.
id: Saya juga ingin mengucapkan terima kasih kepada pembicara dari komunitas kami. `psi`_,` @ str4d`_ dan `zzz`_ yang semuanya melakukan diskusi yang bagus. Meningkatkan kemampuan kita untuk memberi tahu orang tentang I2P adalah sesuatu yang akan menjadi penting bagi kita untuk maju.

source: I would like to thank `Sadie`_ and Siew for helping us out with marketing and graphics. Without you I2PCon would've been a very different event.
es: Me gustaría agradecer a `Sadie`_ y a Siew por auxiliarnos con el marketing y el grafismo. Sin vosotros I2PCon habría sido un evento muy diferente.
id: Saya ingin mengucapkan terima kasih kepada `Sadie`_ dan Siew karena telah membantu kami dalam pemasaran dan grafis. Tanpa mereka, saya pasti acaranya akan menjadi sangat berbeda.

source: I would like to thank `@chlorelium`_ and `Hacklab`_ for being the most wonderful of hosts.
es: Me gustaría agradecer a `@chlorelium`_ y `Hacklab`_ por ser los anfitriones más estupendos.
id: Saya ingin mengucapkan terima kasih kepada `@chlorelium`_ dan `Hacklab`_ karena menjadi tuan rumah yang paling hebat.

source: I would like to thank `@darknetj`_, P and `@hizeena`_ of `Toronto Crypto`_ for their help during the event.
es: Me gustaría agradecer a `@darknetj`_, P y`@hizeena`_ de `Toronto Crypto`_ por su ayuda durante el evento.
id: Saya ingin mengucapkan terima kasih kepada `@darknetj`_, P, dan `@hizeena`_ dari `Toronto Crypto`_ atas bantuan mereka selama acara berlangsung.

source: I would like to thank `@z3r0fox`_ for doing a wonderful job with the AV and doing all of the post-production work for the videos of all the talks.
es: Me gustaría agradecer a `@z3r0fox`_ por hacer un magnífico trabajo con el audiovisual y realizar todo el trabajo de post-producción para los vídeos de todas las charlas.
id: Saya ingin mengucapkan terima kasih kepada `@z3r0fox`_ karena telah melakukan pekerjaan hebat dengan AV dan melakukan semua karya pasca produksi untuk video dari semua diskusi.

source: I would like to thank `@killyourtv_i2p`_ for hosting a very popular crypto party station.
es: Me gustaría agradecer a `@killyourtv_i2p`_ por alojar un estación de crypto fiesta muy popular.
id: Saya ingin mengucapkan terima kasih kepada `@killyourtv_i2p`_ untuk hosting sebuah stasiun pesta kripto yang sangat populer.

source: Thanks to our new favorite journalist `@robinlevinson`_, for showing an interest in our cause and educating yourself about the technologies involved.
es: Gracias a nuestro nuevo periodista favorito `@robinlevinson`_, por mostrar interés en nuestra causa y educarse a si mismo acerca de las tecnologías implicadas.
id: Terima kasih kepada jurnalis favorit kami `@robinlevinson`_, karena menunjukkan ketertarikan pada tujuan kami dan mendidik diri sendiri tentang teknologi yang digunakan.

source: Thanks for all the pizza `@Panago_Pizza`_, it keept us going. You very much made this event better.
es: Gracias por toda la pizza a `@Panago_Pizza`_, nos mantuvo en marcha. Tú hiciste muchísimo para hacer este evento mejor.
id: Terima kasih untuk semua pizza `@Panago_Pizza`_, yang membuat kami terus semangat. Anda sangat banyak membuat acara ini menjadi lebih baik.

source: Finally I would like to thank everyone else who just showed up to the event and helped out in any way they could. ComradeNosebleed, LazyGravy, `cacapo`_, Xmz, ZeroRax, `echelon`_, it was most excellent to hang out with you.
es: Finalmente me gustaría agradecer a todos los demás que simplemente se dejaron ver por el evento y ayudaron de la manera que pudieron. ComradeNosebleed, LazyGravy, `cacapo`_, Xmz, ZeroRax, `echelon`_, fue de lo más estupendo pasar el rato con vosotros.
id: Akhirnya saya ingin mengucapkan terima kasih kepada orang lain yang baru saja hadir pada acara tersebut dan membantu semaksimal mungkin. ComradeMosebleed, LazyGravy, `cacapo`_, Xmz, ZeroRax,` echelon`_, sangat senang nongkrong dengan Anda semua.

source: ============== 0.9.22 Release ==============
es: ============== Versión 0.9.22 ==============
id: ============== Rilis 0.9.22 ==============

source: 0.9.22 with bug fixes and start of Ed25519 migration
es: Versión 0.9.22 con correcciones de fallos y el comienzo de la migración a Ed25519
id: 0.9.22 dengan perbaikan bug dan dimulainya migrasi Ed25519

source: 0.9.22 contains fixes for i2psnark getting stuck before completion, and begins the migration of router infos to new, stronger Ed25519 signatures. To reduce network churn, your router will have only a small probability of converting to Ed25519 at each restart. When it does rekey, expect to see lower bandwidth usage for a couple of days as it reintegrates into the network with its new identity. If all goes well, we will accelerate the rekeying process in the next release.
es: La versión 0.9.22 contiene correcciones para i2psnark, que solía quedarse atascado antes de finalizar, y comienza la migración de las RouterInfos (datos del router I2P) a las nuevas y más robustas firmas Ed25519. Para reducir la volatilidad de la red, su router I2P tendrá sólo una pequeña probabilidad de realizar la conversión a Ed25519 en cada reinicio. Cuando al fin se realice la renovación de la claves, espere ver un menor uso del ancho de banda durante algunos días hasta que su router I2P se reintegre a la red con su nueva identidad. Si todo va bien, aceleraremos el proceso de renovación de claves en la próxima versión.
id: 0.9.22 berisi perbaikan pada I2PSnark yang terjebak sebelum selesai, dan memulai perpindahan RouterInfo ke yang baru, signatur Ed25519 yang lebih kuat. Untuk mengurangi kocokan pada jaringan, router Anda hanya akan memiliki sedikit kemungkinan mengubah ke Ed25519 pada saat setiap kali merestart. Ketika itu melakukan rekey, berharap melihat penggunaan badnwidth yang rendah untuk beberapa hari karena proses integrasi ulang kedalam jaringan dengan identitas barunya. Jika semua berjalan lancar, kami akan mengakselerasi proses rekey pada rilis berikutnya.

source: Start migration to Ed25519 router info signatures
es: Comienza la migración a firmas de información de router I2P de tipo Ed25519
id: Memulai migrasi ke tanda tangan infor router Ed25519

source: Convert i2psnark destinations to Ed25519 signatures
es: Convierte los destinos i2psnark en firmas Ed25519
id: Konversi destinasi i2psnark ke tanda tangan Ed25519

source: Fix i2psnark getting stuck before download complete, and not deleting temp files
es: Repara i2psnark al bloquearse antes de completar la descarga, y no borrar los ficheros temporales
id: Memperbaiki i2psnark terjebak sebelum men-download yang lengkap, dan tidak menghapus file temp

source: Fix starting of torrents added by copying torrent file to i2psnark directory
es: Repara el comienzo de los torrents añadidos copiando el fichero torrent al directorio i2psnark
id: Memperbaiki memulai torrents yang ditambahkan dengan menyalin torrent file ke direktori i2psnark

source: Fix UPnP 'content not allowed in trailing section' error
es: Repara el error UPnP 'contenido no permitido en la sección de cola'
id: Memperbaiki kesalahan 'konten tidak diperbolehkan di bagian trailing' UPnP

source: Fix excluded SSL ciphers in console
es: Corrige códigos SSL excluidos en la consola
id: Perbaikan mengecualikan sandi SSL di console

source: ================== Community Outreach ==================
es: ================== Apertura de la comunidad ==================
id: ================== Jangkauan Komunitas ==================

source: A start to more frequent community status reports.
es: Un comienzo para informes de estado de la comunidad más frecuentes.
id: Mulai untuk laporan status komunitas yang lebih sering.

source: Greetings! This is the first in a long series of blogs to help the community see what is happening in the I2P community. Since many awesome events are happening *inside* the network, we think it will be worthwhile to talk about some of activities here.
es: ¡Saludos! Esta es la primera de una larga serie de blogs para ayudar a la comunidad a ver lo que está sucediendo en la comunidad I2P. Como están ocurriendo muchos eventos sensacionales *dentro* de la red, creemos que merecerá la pena hablar sobre algunas de las actividades aquí.
id: Salam! Ini adalah awal dari serangkaian panjang blog untuk membantu masyarakat melihat apa yang terjadi di komunitas I2P. Karena banyak peristiwa-peristiwa mengagumkan terjadi *dalam* jaringan, kami pikir ini akan berharga untuk berbicara tentang beberapa kegiatan di sini.

source: A Call for Feedback
es: Una llamada a la respuesta
id: Panggilan untuk umpan balik

source: Let's face it -- our console needs improvement. Our site could use an update as well. We are looking for feedback on how to improve the usability of I2P for new and existing users!
es: Afrontémoslo -- nuestra consola necesita mejorar. Nuestro sitio bien podría también introducir una actualización. ¡Estamos buscando respuesta sobre cómo mejorar la usabilidad de I2P para usuarios nuevos y existentes!
id: Akui saja -- console kami perlu perbaikan. Situs kami dapat juga memerlukan pembaruan. Kami sedang mencari umpan balik tentang cara meningkatkan kegunaan dari I2P untuk pengguna baru dan pengguna lama!

source: Any and all feedback is welcome. Please contact `@GetI2P`_, `@str4d`_, or `@YrB1rd`_. If you don't feel comfortable using Twitter, we are always available via the in-network IRC channel. You don't have to be a long time user. We want to hear from all sorts of people!
es: Cualquiera y todas las respuestas son bienvenidas. Por favor, contacte con `@GetI2P`_, `@str4d`_, o `@YrB1rd`_. Si no se siente a gusto usando Twitter, siempre estamos disponibles a través del canal en la red IRC. No necesita ser un usuario experimentado. Queremos escuchar a todo tipo de personas.
id: Umpan balik apapun sangat diharapkan. Mohon hubungi '@GetI2P'_, '@str4d' _ atau '@YrB1rd'_. Jika Anda tidak merasa nyaman menggunakan Twitter, kami selalu tersedia melalui di channel IRC di dalam jaringan I2P. Anda tidak perlu menjadi pengguna lama untuk memberikan umpan balik. Kami ingin mendengar dari semua orang!

source: Developer Meeting Synopsis
es: Sinopsis del encuentro de desarrolladores
id: Sinopsis Rapat Pengembang

source: On 03 November there was an I2P developer meeting (`log`_). This meeting focused on adding new links to the router console, preparation for CCC, finding a replacement for forum.i2p, and website improvements.
es: El 3 de noviembre hubo un encuentro de desarrolladores de IP2 (`registro`_). Este encuentro se centró en la adición de nuevos enlaces a la consola del router, preparación para el CCC, encontrar un sustituto para forum.i2p, y mejoras en el sitio web.
id: Pada 03 November ada I2P pertemuan pengembang ('log' _). Pertemuan ini difokuskan pada menambahkan link baru ke router console, persiapan untuk CCC, menemukan pengganti untuk forum.i2p, dan perbaikan website.

source: The consensus was to not add dogecoindark.i2p. There are concerns about usability due to many images being included on the page. Exchanged.i2p is conditionally added, as long as the maintainer adds a disclaimer on the site. I2Pwiki.i2p (a backup of ugha.i2p, an older wiki) was accepted, as was lenta.i2p (a russian news site).
es: El consenso fue no añadir dogecoindark.i2p. Hay preocupaciones acerca de la usabilidad debido a que se incluyen muchas imágenes en la página. Exchanged.i2p se añade condicionalmente, en tanto el mantenedor conserve un pliego de descargo en el sitio. I2Pwiki.i2p (una copia de seguridad de ugha.i2p, un wiki antiguo) fue aceptado, igual que lo fue lenta.i2p (un sitio de noticias ruso).
id: Ada kesepakatan untuk tidak menambah dogecoindark.i2p. Ada kekhawatiran tentang kegunaan karena banyak gambar yang disertakan pada halaman. Exchanged.i2p ditambahkan dengan syarat pengelola menambahkan sanggahan atau disclaimer di situs. I2Pwiki.i2p (cadangan ugha.i2p, wiki yang lebih lama) diterima, sama seperti lenta.i2p (sebuah situs berita Rusia).

source: str4d proposed blocking off the \*.i2p.i2p namespace so they can be used for developer's services. He also suggested a more formalized technical proposal system, with more prominence on the main website.
es: str4d propuso bloquear el espacio de nombres \*.i2p.i2p para que se pueda usar para servicios de desarrollador. También sugirió un sistema de propuestas técnicas más formalizado, con más prominencia para el sitio web.
id: str4d mengusulkan memblokir \*.i2p.i2p namespace sehingga dapat digunakan untuk pengembang layanan. Dia juga menyarankan sebuah sistem proposal teknis yang lebih formal, yang lebih menonjol pada situs utama.

source: The I2P Team is going to be in Hamburg, Germany for the 32nd Chaos Computer Congress. More details are to come on this, but we can promise there will be stickers.
es: El equipo de I2P va a estar en Hamburgo, Alemania para el 32º Congreso Chaos Computer. Más detalles sobre esto están por llegar, pero podemos prometer que habrá pegatinas.
id: Tim I2P akan hadir di Hamburg, Jerman untuk Chaos Computer Congress ke-32. Rincian lebih lanjut ditambahkan, tapi kami bisa menjanjikan akan ada stiker.

source: General Announcements
es: Anuncios generales
id: Pengumuman Umum
