Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Translated man pages
es: Páginas man traducidas
id: Halaman manual diterjemahkan

source: Add support for outproxy plugin to CONNECT proxy
es: Añade soporte para proxy CONNECT al complemento outproxy
id: Menambahkan dukungan untuk outproxy plugin ke CONNECT proxy

source: Replace random tunnel keys when rekeying
es: Reemplaza claves aleatorias de túnel al sustituir las claves
id: Mengganti kunci acak tunnel ketika rekeying

source: Fix streaming optional delay and choking
es: Corrige el retardo y taponamiento opcionales del transporte streaming
id: Memperbaiki streaming opsional penundaan dan choking

source: Don't hard fail on message expired error in streaming
es: Elude el fallo severo para un error de mensaje caducado en el transporte streaming
id: Mencegah hard fail pada pesan kesalahan kadaluarsa dalam streaming

source: Fix javadoc errors
es: Corrige errores de javadoc
id: Memperbaiki kesalahan javadoc

source: Fix broken unit tests
es: Corrige tests unitarios dañados
id: Memperbaiki unit test yang rusak

source: Ensure i2psnark finishes writing config files at shutdown
es: Se asegura de que i2psnark finaliza escribiendo los ficheros de configuración al cerrar
id: Memastikan i2psnark selesai menulis file konfigurasi saat shutdown

source: Fix rare NPE in AES via NTCP
es: Corrige excepciones de puntero nulo (NPE) en AES vía NTCP
id: Memperbaiki NPE langka di AES melalui NTCP

source: Disable caching of compressors, in an attempt to fix corruption
es: Deshabilita el almacenamiento en caché de los compresores, en un intento de corregir la corrupción de datos
id: Menonaktifkan caching kompresor, dalam upaya untuk memperbaiki korupsi

source: Don't close SAM or BOB session on receipt of corrupt compressed data
es: No cierra la sesión de SAM o BOB al recibir datos comprimidos corruptos
id: Tidak menutup SAM atau sesi BOB pada penerimaan kompresi data yang korup

source: Add support for ports to CONNECT proxy
es: Añade soporte para puertos al proxy CONNECT
id: Menambahkan dukungan untuk port untuk CONNECT proxy

source: Consolidate stream copy code
es: Consolida el código de copiado del flujo de datos
id: Mengkonsolidasikan stream copy code

source: Consolidate console timer threads
es: Consolida los hilos de cronómetro de consola
id: Mengkonsolidasikan console timer threads

source: New streaming test harness
es: Nuevo control del test del transporte streaming
id: Streaming test harness baru

source: ============================ 0.9.29 Windows Installer Fix ============================
es: ============================================= Corrección del instalador de Windows de la 0.9.29 =============================================
id: ============================ 0.9.29 Perbaikan Windows Installer ============================

source: 0.9.29 Windows installer fix
es: Corrección del instalador de Windows de la 0.9.29
id: 0.9.29 Perbaikan Windows Installer

source: The 0.9.29 Windows installer posted on our website two days ago fails during install with an Exception. We have fixed the bug and posted the new installer to our website. This does not affect upgrades from previous releases or non-Windows installers. We apologize for the issue.
es: El instalador de Windows de la 0.9.29 publicado en nuestro sitio web hace dos días falla durante la instalación produciendo una excepción. Hemos corregido el fallo y publicado el nuevo instalador en nuestro sitio web. Esto no afecta a las actualizaciones de anteriores versiones de instaladores no-Windows. Le pedimos disculpas por el problema.
id: Windows Installer 0.9.29 yang diposting pada website kami dua hari yang lalu gagal selama instal dengan Exception. Kami telah diperbaiki bug dan installer baru diposting ke situs kami. Ini tidak mempengaruhi pembaruan dari rilis sebelumnya atau installer non-Windows. Kami mohon maaf untuk masalah ini.

source: ============== 0.9.30 Release ==============
es: ============== Versión 0.9.30 ==============
id: ============== Rilis 0.9.30 ==============

source: 0.9.30 with Jetty 9
es: 0.9.30 con Jetty 9
id: 0.9.30 dengan Jetty 9

source: 0.9.30 contains an upgrade to Jetty 9 and Tomcat 8. The previous versions are no longer supported, and are not available in the upcoming Debian Stretch and Ubuntu Zesty releases.
es: La 0.9.30 contiene una actualización a Jetty 9 y Tomcat 8. Las versiones anteriores ya no están soportadas, y no están disponibles en las versiones Debian Stretch y Ubuntu Zesty que se avecinan.
id: 0.9.30 berisi pembaruan ke Jetty 9 dan Tomcat 8. Versi sebelumnya tidak lagi didukung, dan tidak tersedia di rilis Debian Stretch dan Ubuntu Zesty mendatang.

source: The router will migrate the jetty.xml configuration file for each Jetty website to the new Jetty 9 setup. This should work for recent, unmodified configurations but may not work for modified or very old setups. Verify that your Jetty website works after upgrading, and contact us on IRC if you need assistance.
es: El router I2P migrará el fichero de configuración jetty.xml para cada sitio web Jetty a la nueva instalación Jetty 9. Esto debería funcionar para configuraciones recientes no modificadas, pero puede no funcionar para instalaciones muy antiguas. Verifique que su sitio web Jetty funciona tras la actualización, y contacte con nosotros en el IRC si necesita asistencia.
id: Router akan bermigrasi file konfigurasi jetty.xml untuk setiap situs web Jetty ke setup Jetty 9 baru. Ini seharusnya berfungsi di konfigurasi baru yang tidak modifikasi, tetapi mungkin tidak berfungsi untuk setup yang sangat tua atau dimodifikasi. Verifikasi bahwa situs web Jetty berfungsi setelah upgrade, dan hubungi kami di IRC jika Anda memerlukan bantuan.

source: Several plugins are not compatible with Jetty 9 and must be updated. The following plugins have been updated to work with 0.9.30, and your router should update them after restart:
es: Varios complementos no son compatibles con Jetty 9 y deben actualizarse. Los siguientes complementos han sido puestos al día para funcionar con la 0.9.30, y su router I2P debe actualizarlos tras reiniciar.
id: Beberapa plugin tidak kompatibel dengan Jetty 9 dan harus diperbaharui. Plugin berikut telah diperbarui untuk berfungsi dengan 0.9.30, dan router Anda harus memperbarui mereka setelah restart:

source: The following plugins (with current versions listed) will not work with 0.9.30. Contact the appropriate plugin developer for the status of new versions:
es: Los siguientes complementos (versiones actuales en la lista) no funcionarán con la 0.9.30. Contacte con el desarrollador correspondiente del complemento para conocer el estado de nuevas versiones.
id: Plugin berikut (dengan versi terdaftar) tidak akan berfungsi dengan 0.9.30. Hubungi pengembang plugin yang sesuai untuk status versi baru:

source: This release also supports migration of old (2014 and earlier) DSA-SHA1 hidden services to the more-secure EdDSA signature type. See http://zzz.i2p/topics/2271 for further information, including a guide and FAQ.
es: Esta versión también soporta la migración de los antiguos (2014 y anteriores) servicios ocultos DSA-SHA1 al tipo de firma EdDSA más seguro. Vea http://zzz.i2p/topics/2271 para información adicional, incluyendo una guía y preguntas frecuentes (FAQ).
id: Rilis ini juga mendukung migrasi hidden service DSA-SHA1 lama (2014 dan sebelumnya) ke tipe signature EdDSA yang lebih aman. Lihat http://zzz.i2p/topics/2271 untuk informasi lebih lanjut, termasuk panduan dan FAQ.

source: Note: On non-Android ARM platforms such as the Raspberry Pi, the blockfile database will upgrade on restart, which may take several minutes. Please be patient.
es: Nota: En plataformas ARM no-Android como la Raspberry Pi, la base de datos del blockfile (sistema de nombres) se actualizará al reiniciar, lo que puede tardar varios minutos. Por favor, tenga paciencia.
id: Catatan: Pada platform ARM non-Android seperti Raspberry Pi, database blockfile akan diupgrade saat restart, yang mungkin memakan waktu beberapa menit. Harap bersabar.

source: Jetty 9, Tomcat 8
id: Jety 9, Tomcat 8

source: Stretch / Zesty support
es: Soporte Stretch / Zesty
id: Dukungan Stretch / Zesty

source: Migration support for DSA-SHA1 hidden services
es: Soporte de migración para servicios ocultos DSA-SHA1
id: Dukungan Migrasi untuk layanan tersembunyi DSA-SHA1

source: ARM (non-Android) router signature type migration
es: Migración del tipo de firma del router I2P ARM (no-Android)
id: Migrasi tipe router signature ARM (non-Android)

source: ARM (non-Android) blockfile format migration
es: Migración del formato del blockfile ARM (no-Android)
id: Migrasi formar blockfile ARM (non-Android)

source: Fix disappearing i2psnark start button
es: Corrige la desaparición del botón de inicio de i2psnark
id: Perbaikan mulai start di i2psnark yang menghilang

source: Fix saving of libjcpuid.jnilib file on Macs
es: Corrige el guardado del fichero libjcpuid.jnilib en Macs
id: Perbaikan penyimpanan file libjcpuid.jnilib pada Mac

source: Fix fallback to 'none' architecture for jbigi
es: Corrige el uso como recurso de 'ninguna' arquitectura para jbigi
id: Memperbaikan fallback ke 'none' arsitektur untuk jbigi

source: Fixes for multiple destinations in SusiDNS
es: Correcciones para múltiples destinos en SusiDNS
id: Perbaikan untuk destinasi banyak di SusiDNS

source: Fix config directory location in Gentoo
es: Corrige la ubicacion del directorio de configuración en Gentoo
id: Memperbaikan lokasi direktori config di Gentoo

source: Fix rapid firewalled/not-firewalled transitions
es: Corrige transiciones rápidas bloqueado-por-cortafuegos/no-bloqueado-por-cortafuegos
id: Perbaikan untuk transisi firewall/tidak-firewall cepat

source: Fix startup crash on very old Android platforms
es: Corrige una caída en el arranque en plataformas Android muy antiguas
id: Perbaikan crash pada startup di versi Android yang sangat tua

source: Fixes for advanced authentication strings in i2ptunnel
es: Correcciones para cadenas de autentificación avanzadas en i2ptunnel
id: Perbaikan untuk string otentifikasi lanjutan di i2ptunnel

source: Fix exception caused by corrupt stored i2psnark DHT data
es: Corrige una excepción causada por datos corruptos almacenados de la DHT de I2psnark
id: Memperbaikan exeption yang disebabkan oleh data i2psnark DHT tersimpan yang korup

source: Speed up writes of i2psnark files at shutdown
es: Acelera la escritura de ficheros i2psnark al cierre
id: Mempercepat penulisan file i2psnark saat shutdown

source: Recognize AMD Ryzen processor
es: Reconoce el procesador AMD Ryzen
id: Mengenali prosesor AMD Ryzen

source: Support for new i2psnark-rpc remote plugin
es: Soporte para el nuevo complemento remoto i2pnark-rpc
id: Dukungan untuk plugin baru remote i2psnark-rpc

source: Build addressbook as a jar, not a webapp
es: Compila addressbook (libreta de direcciones) como un jar, no como aplicación web
id: Membangun addressbook sebagai jar, bukan webapp

source: Support client registration in app context
es: Soporta el registro de cliente en el contexto de la aplicación
id: Dukungan pendaftaran client dalam konteks aplikasi

source: Add support for i2psnark-rpc plugin
es: Añade soporte para el complemento i2psnark-rpc
id: Menambahkan dukungan untuk plugin i2psnark-rpc

source: Adjust thresholds for probabalistic throttling on slow platforms
es: Ajusta los umbrales para la regulación probabilística en plataformas lentas
id: Menyesuaikan batas untuk probabalistic throttling pada platform lambat

source: Add reset() to I2PSocket API
es: Añade reset() a la API I2PSocket
id: Menambah reset() ke I2PSocket API

source: Add date parameter to subscription authentication strings
es: Añade el parámetro date (fecha) a las cadenas de autentificación de suscripción
id: Menambahkan tanggal parameter ke string otentikasi berlangganan

source: Add bash completion scripts to Debian packages
es: Añade scripts bash de completado a los paquetes Debian.
id: Menambahkan skrip bash completion untuk paket-paket Debian

source: ================================ I2P Summer Dev 2017: MOAR Speed! ================================
es: ===================================== I2P Summer Dev 2017: ¡MOAR/MÁS Velocidad! =====================================
id: ================================ I2P Summer Dev 2017: Kecepatan Lebih Tinggi! ================================

source: This year's Summer Dev will be focused on metrics collection and performance improvements for the network.
es: El Summer Dev de este año se centrará en la recopilación de mediciones y mejoras del rendimiento para la red.
id: Summer Dev tahun ini akan berfokus pada perbaikan koleksi metrik dan kinerja jaringan.

source: It's that time of year again! We're embarking on our summer development programme, where we focus on a particular aspect of I2P to push it forward. For the next three months, we'll be encouraging both new contributors and existing community members to pick a task and have fun with it!
es: ¡De nuevo llegó ese momento del año! Nos estamos embarcando en nuestro programa de desarrollo veraniego, donde nos centramos en un aspecto particular de I2P para impulsarlo hacia delante. ¡Durante los próximos tres meses, estaremos animando tanto a nuevos contribuidores como miembros existentes de la comunidad a que seleccionen una tarea y se diviertan con ella!
id: Waktu telah tiba! Kami sedang memulai program pengembangan musim panas, di mana kami berfokus pada aspek tertentu dari I2P untuk mendorong perkembangannya. Dalam tiga bulan ke depan, kami akan mendorong kontributor baru dan anggota lama komunitas untuk memilih tugas dan bersenang-senang dengannya!

source: Despite onion-routing networks often being called "low-latency" networks, there is significant overhead created by routing traffic through additional computers. I2P's unidirectional tunnel design means that by default, a round trip between two Destinations will involve twelve participants! Improving the performance of these participants will help to both reduce the latency of end-to-end connections [1]_, and increase the quality of tunnels network-wide.
es: A pesar de las redes de enrutamiento-onion, a menudo llamadas redes de "baja-latencia", hay un tráfico de control significativo creado por el enrutamiento del tráfico a través de máquinas adicionales. ¡El diseño unidireccional del túnel de I2P significa que, por defecto, un viaje de ida y vuelta entre dos destinos I2P implicará a doce participantes! Mejorar el rendimiento de estos participantes ayudará tanto a reducir la latencia de las conexiones extremo-a-extremo [1]_, como a incrementar la calidad de los túneles por toda la red.
id: Meskipun jaringan onion-routing sering disebut jaringan "latensi-rendah", ada overhead yang signifikan yang dibuat oleh routing lalu lintas melalui beberapa komputer. Desain tunnel I2P yang unidirectional membuat, secara default, lalu lintas bulak balik antara dua destinasi yang melibatkan dua belas peserta! Meningkatkan kinerja para peserta ini akan membantu mengurangi latensi koneksi end-to-end [1]_, dan meningkatkan kualitas tunnel di seluruh jaringan.

source: MOAR speed! ===========
es: ¡MOAR/MÁS velocidad! ===================
id: Kecepatan Lebih Tinggi! ===========

source: Our development programme this year will have four components:
es: Nuestro programa de desarrollo tendrá este año cuatro componentes:
id: Program pengembangan kami tahun ini akan memiliki empat komponen:

source: Measure -------
es: Medición -------
id: Ukuran -------

source: We can't tell if we improve performance without a baseline! We'll be creating a metrics system for collecting usage and performance data about I2P in a privacy-preserving way, as well as porting various benchmarking tools to run over I2P (e.g. iperf3_).
es: ¡No podemos decir si mejoramos el rendimiento sin una línea base de partida! Vamos a estar creando un sistema de mediciones para recopilar el uso y rendimiento de los datos sobre I2P de manera que se preserve la privacidad, además de portar varias herramientas de banco de pruebas para ejecutar sobre I2P (ej. iperf3_).
id: Kita tidak bisa mengatakan jika kita meningkatkan kinerja tanpa patokan! Kami akan membuat sebuah sistem metrik untuk mengumpulkan data penggunaan dan kinerja tentang I2P di dalam cara menjaga privasi, serta melakukan porting berbagai tool pembandingan untuk berjalan di dalam I2P (misalnya iperf3_).

source: Optimise --------
es: Optimización --------
id: Optimisasi --------

source: There's a lot of scope for improving the performance of our existing code, to e.g. reduce the overhead of participating in tunnels. We will be looking at potential improvements to:
es: Hay mucho rango para la mejora del rendimiento de nuestro código existente, por ejemplo, para reducir el tráfico de control de los participantes en los túneles. Vamos a estar pendientes de potenciales mejoras para:
id: Ada banyak cakupan untuk meningkatkan kinerja di kode pemograman yang ada, misalnya untuk mengurangi overhead dari partisipasi di dalam tunnel. Kita akan mencari potensi perbaikan:

source: Network transports, both at the link-layer (NTCP_, SSU_) and end-to-end (Streaming_)
es: Transportes de red, tanto en la capa-de-enlace (NTCP_, SSU_) como extremo-a-extremo (Streaming_)
id: Network transport, baik pada link-layer (NTCP_, SSU_) dan end-to-end (Streaming_)

source: Peer profiling
es: Perfilamiento de pares (peers)
id: Pembuatan profil peer

source: Tunnel path selection
es: Selección de la ruta del túnel
id: Pemilihan jalur tunnel

source: Advance -------
es: Avanzado -------
id: Kemajuan -------

source: We have several open proposals for improving the scalability of the I2P network (e.g. Prop115_, Prop123_, Prop124_, Prop125_, Prop138_, Prop140_). We will be working on these proposals, and begin implementing the finalised ones in the various network routers. The more feedback these proposals receive, the sooner we can roll them out, and the sooner I2P services can start using them!
es: Tenemos varias propuestas abiertas para mejorar la escalabilidad de la red I2P. (ej. Prop115_, Prop123_, Prop124_, Prop125_, Prop138_, Prop140_). Vamos a estar trabajando en estas propuestas, y comenzaremos a implementar las que se finalicen en los distintos routers I2P de la red. ¡Cuanta mayor respuesta recibamos a estas propuestas, más pronto podremos desplegarlas, y más pronto podrán comenzar a usarlas los servicios I2P!
id: Kami memiliki beberapa usulan yang terbuka untuk meningkatkan skalabilitas jaringan I2P (misalnya Prop115_, Prop123_, Prop124_, Prop125_, Prop138_, Prop140_). Kami akan mengerjakan proposal-proposal tersebut dan mulai menerapkan proposan yang difinalisasi di dalam berbagai router jaringan. Semakin banyak umpan balik yang diterima proposal ini, semakin cepat kita bisa meluncurkannya, dan semakin cepat layanan I2P dapat mulai menggunakannya!

source: Research --------
es: Investigación --------
id: Penelitian --------

source: I2P is a packet-switched network, like the internet it runs on top of. This gives us significant flexibility in how we route packets, both for performance and privacy. The majority of this flexibility is unexplored! We want to encourage research into how various clearnet techniques for improving bandwidth can be applied to I2P, and how they might affect the privacy of network participants.
es: I2P es una red de paquetes-conmutados, al igual que Internet, sobre la cual se ejecuta. Esto nos proporciona una flexibilidad significativa sobre la forma en que enrutamos los paquetes, tanto para el rendimiento como para la privacidad. ¡La mayoría de esta flexibilidad está inexplorada! Queremos alentar la investigación sobre cómo se pueden aplicar a I2P distintas técnicas de clearnet (red no cifrada) para mejorar el ancho de banda, y cómo podrían afectar a la privacidad de los participantes en la red.
id: I2p adalah jaringan packet-switched, seperti Internet, yang berjalan di atas Internet. Ini memberikan fleksibilitas besar dalam cara merutekan paket, untuk meningkatkan kinerja dan privasi. Kebanyakan dari fleksibilitas ini belum dijelajahi! Kami ingin mendorong penelitian dalam bagaimana teknik di Internet biasa dalam meningkatkan bandwith, dapat diterapkan di I2P, dan bagaimana teknik tersebut mempengaruhi privasi dari peserta jaringan I2P.

source: We have many more ideas for things we'd like to get done in these areas. If you're interested in hacking on privacy and anonymity software, designing protocols (cryptographic or otherwise), or researching future ideas - come and chat with us on IRC or Twitter! We are always happy to welcome newcomers into our community, both inside and outside the I2P network. We'll also be sending I2P stickers out to all new contributors taking part! If you want to chat about a specific idea, contact `@GetI2P`_, `@i2p`_ or `@str4d`_ on Twitter. You can also find us in #i2p-dev on OFTC or Freenode.
es: Tenemos muchas más ideas para cosas que nos gustaría que se hicieran en estas áreas. Si está interesado en el hacking sobre software de privacidad y anonimato, diseñar protocolos (criptográficos o de otro tipo), o investigar futuras ideas - ¡venga y charle con nosotros en el IRC o Twitter! Siempre nos alegra recibir a los recien llegados a nuestra comunidad, tanto dentro como fuera de la red I2P. ¡Además vamos a enviar pegatinas de I2P a todos los nuevos contribuidores que tomen parte! Si quiere charlar acerca de una idea específica, contacte con `@GetI2P`_, `@i2p`_ o `@str4d`_ en Twitter. También puede encontrarnos en #i2p-dev en las redes OFTC o Freenode del IRC.
id: Kami memiliki lebih banyak gagasan untuk hal-hal yang ingin kami lakukan di bidang ini. Jika Anda tertarik untuk meretas perangkat lunak privasi dan anonimitas, merancang protokol (kriptografi atau hal lain), atau meneliti ide masa depan: datang dan mengobrol dengan kami di IRC atau Twitter! Kami selalu senang untuk menyambut pendatang baru ke dalam komunitas, baik di dalam maupun di luar jaringan I2P. Kami akan mengirimkan stiker I2P ke semua kontributor baru! Jika Anda ingin chatting tentang ide tertentu, hubungi `@GetI2P`_, '@i2p`_ atau `@str4d`_ di Twitter. Anda juga dapat menemukan kami di #i2p-dev di OFTC atau FreeNode.
