Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Thank you to `TorontoCrypto`_ for hosting the newest I2P reseed server!
es: ¡Gracias a `TorontoCrypto`_ por alojar el servidor de resembrado I2P más reciente!
id: Terima kasih kepada 'TorontoCrypto'_ untuk hosting server reseed I2P terbaru!

source: Translation deadline Thursday, 12 November, translators please update. All translations are done via `Transifex`_ .
es: Fecha límite para la traducción jueves, 12 de noviembre, traductores por favor actualizad. Todas las traducciones se realizan vía `Transifex`_ .
id: Batas waktu penerjemahan adalah Kamis 12 November. Para penerjemah mohon memperbarui terjemahannya. Semua terjemahan dilakukan melalui 'Transifex'_. Semua penerjemahan dilakukan dengan `Transifex`_ .

source: ============== 0.9.23 Release ==============
es: ============== Versión 0.9.23 ==============
id: ============== Rilis 0.9.23 ==============

source: 0.9.23 contains a variety of bug fixes, and some minor improvements in I2PSnark
es: La 0.9.23 contiene distintas reparaciones de fallos, y algunas mejoras menores en I2PSnark
id: 0.9.23 berisi berbagai perbaikan bugs, dan beberapa peningkatan kecil di I2PSnark

source: Hello I2P! This is the first release signed by me (str4d), after 49 releases signed by zzz. This is an important test of our redundancy for all things, including people.
es: ¡Hola I2P! Está es la primera versión firmada por mi (str4d), después de 49 versiones firmadas por zzz. Esto es una prueba importante de nuestra redundancia para todo tipo de cosas, incluyendo personas.
id: Halo I2P! Ini adalah rilis pertama yang ditandai oleh saya (str4d), setelah 49 rilis sebelumnya ditandai oleh zzz. Ini adalah percobaan penting redundansi kami untuk semua hal, termasuk orang-orang.

source: If you installed I2P via a package manager, you are not affected by the change, and can update as usual.
es: Si instaló I2P mediante un administrador de paquetes, no está afectado por el cambio, y puede actualizar de forma normal.
id: Jika Anda menginstal I2P melalui pengelola paket, Anda tidak akan terpengaruh oleh perubahan, dan dapat memperbarui seperti biasa.

source: Update details ==============
es: Detalles de actualización ==============
id: Rincian pembaruan ==============

source: The migration of RouterInfos to new, stronger Ed25519 signatures is going well, with at least half of the network already estimated to have rekeyed. This release accelerates the rekeying process. To reduce network churn, your router will have a small probability of converting to Ed25519 at each restart. When it does rekey, expect to see lower bandwidth usage for a couple of days as it reintegrates into the network with its new identity.
es: La migración de RouterInfos (datos del router I2P) a las nuevas, y más robustas firmas Ed25519, está yendo bien, se estima que al menos la mitad de la red ya ha realizado la conversión a estas nuevas firmas. Esta versión acelera el proceso de renovación de claves. Para reducir la volatilidad de la red, su router tendrá una pequeña probabilidad de realizar la conversión a Ed25519 en cada reinicio. Cuando al fin se realize la renovación de las claves, espere ver un menor uso de ancho de banda durante un par de días mientras se reintegra a la red con su nueva identidad.
id: Migrasi RouterInfos baru, tanda tangan Ed25519 yang kuat berjalan baik, dengan setidaknya setengah dari jaringan sudah diperkirakan telah rekeyed. Rilis ini mempercepat proses rekeying. Untuk mengurangi churn jaringan, router Anda akan memiliki kemungkinan kecil konversi ke Ed25519 di setiap restart. Ketika melakukan rekey, harap untuk melihat penggunaan bandwidth yang lebih rendah selama beberapa hari selama integrasikan kembali ke jaringan dengan identitas barunya.

source: Note that this will be the last release to support Java 6. Please update to Java 7 or 8 as soon as possible. We are already working to make I2P compatible with the upcoming Java 9, and some of that work is in this release.
es: Observe que esta será la última versión que soporte Java 6. Por favor, actualice a Java 7 u 8 tan pronto como sea posible. Ya estamos trabajando para hacer I2P compatible con la venidera Java 9, y parte de ese trabajo está en esta versión.
id: Dengan catatan bahwa hal ini akan menjadi rilis terakhir yang mendukung Java 6. Harap perbarui ke Java 7 atau 8 secepatnya. Kami sudah bekerja untuk membuat I2P dapat digunakan dengan Java 9, dan beberapa pekerjaan tersebut berada dalam rilis ini.

source: We have also made some minor improvements in I2PSnark, and added a new page in the routerconsole for viewing older news items.
es: También hemos hecho algunas mejoras menores en I2PSnark, y añadido una nueva página en la consola del router I2P para ver elementos de novedades más antiguos.
id: Kami juga telah membuat beberapa peningkatan kecil di I2PSnark, dan menambahkan beberapa halaman di routerconsole untuk melihat item news yang lama.

source: Accelerate transition to Ed25519
es: Acelera la transición a Ed25519
id: Mempercepat transisi ke Ed25519

source: Fix some bugs soft restarting after a large clock shift (e.g. resume) (but more to do)
es: Corrige algunos fallos que hacían reiniciar el software tras un gran desfase de reloj (ej. resumir) (pero hay más por hacer)
id: Memperbaiki beberapa bug kecil di mana restart setelah pergeseran jam besar (misalnya saat resume) (namun masih banyak hal yang perlu dilakukan)

source: Fix streaming retransmission timers that were dying, and related timer bugs
es: Corrige los relojes de retransmisión de streaming que estaban muriendo, y los fallos de reloj relacionados
id: Memperbaiki timer retransmission streaming yang sekarat, dan terkait bug timer

source: Fix streaming connections rejected while tunnel is opening
es: Corrige las conexiones de streaming rechazadas mientras el túnel se está abriendo
id: Memperbaiki streaming koneksi yang ditolak sementara tunnel sedang dibuka

source: Fix rare i2psnark and UPnP deadlocks
es: Repara extraños puntos muertos de i2psnark y UPnP
id: Memperbaiki i2psnark langka dan UPnP deadlock

source: Fix lifetime participating bandwidth display in console
es: Repara el indicador en la consola del ancho de banda participante para todo el tiempo de vida
id: Memperbaiki tampilan participating bandwidth seumur hidup yang di console

source: Increase default outbound exploratory tunnel length to 3
es: Incrementa la longitud predeterminada del túnel exploratorio de salida a 3
id: Meningkatkan panjang tunnel eksplorasi outbound default ke 3

source: Use max of 2 not-failing peers in exploratory tunnels to improve build success
es: Usa un máximo de 2 pares no-falibles en túneles exploratorios para mejorar el éxito de la construcción del túnel
id: Menggunakan max 2 peer yang tidak gagal dalam tunnel eksplorasi untuk meningkatkan keberhasilan pembangunan tunnel

source: Add support for hostnames prefixed with "www."
es: Añade soporte para nombres de nodos prefijados con "www."
id: Menambahkan dukungan untuk nama host yang diawali dengan "www."

source: Store news feed items separately on disk, show on new /news page, limit display on home page to 2
es: Almacena elementos de suscripciones de noticias (feeds) de forma separada en el disco, se muestran en una nueva página /news (noticias), limita los mostrados en la página principal a 2
id: Menyimpan isi news feed terpisah di dalam harddisk, menampilkannya dalam halaman new/news, membatasi tampilan di halaman depan menjadi 2

source: Increase probability of rekeying to EdDSA
es: Incrementa la probabilidad de renovación de claves con firma EdDSA
id: Meningkatkan probabilitas rekeying untuk EdDSA

source: Detect for broken ECDSA support in Gentoo
es: Soporte de detección para ECDSA roto en Gentoo
id: Mendeteksi untuk dukungan ECDSA rusak di Gentoo

source: Console: Add a Java 6 warning, this is the last release to support Java 6
es: Consola: Añade una advertencia de Java 6, esta es la última versión que soporta Java 6
id: Console: Tambahan peringatan Java 6, ini adalah rilis terakhir untuk mendukung Java 6

source: Changes to prepare for Java 9 compatibility
es: Cambios de preparación para la compatibilidad con Java 9
id: Perubahan untuk mempersiapkan kompatibilitas Java 9

source: Pass Accept-Encoding header through client and server proxies, to allow end-to-end compression
es: Hace pasar la cabecera Aceptar-Codificar a través de los proxys de cliente y servidor, para permitir la compresión extremo-a-extremo
id: Menerima header Accept-Encoding melalui klien dan server proxy, untuk membolehkan kompresi end-to-end

source: Increase piece size, piece count, and file count limits
es: Incrementa los límites de tamaño del fragmento, número de fragmentos, y número de ficheros
id: Meningkatkan ukuran potongan, jumlah potongan, dan batasan jumlah file

source: Save added and completed times
es: Guarda los tiempos de añadido y completado
id: Simpan ditambahkan dan jumlah selesai

source: Save magnet parameters across restart
es: Guarda los parámetros magnet entre reinicios
id: Menyimpan parameter magnet setiap restart

source: Don't delete .torrent file on errors at startup, rename to .torrent.BAD
es: No borra el fichero .torrent por errores al inicio, lo renombra a .torrent.BAD
id: Jangan menghapus file .torrent pada kesalahan pada saat startup, mengubah nama menjadi .torrent.BAD

source: Add recheck, start, stop buttons on details pages
es: Añade botones de recomprobación, inicio y detención en la páginas de detalles
id: Menambahkan tombol recheck, mulai, berhenti pada halaman rincian

source: Add option to disable "smart sort"
es: Añade una opción para deshabilitar "ordenación inteligente"
id: Tambahkn pilihan untuk menonaktifkan "smart sort"

source: Speed up IP address validation
es: Acelera la validación de dirección IP
id: Mempercepat pengesahan alamat IP

source: Separate streaming blacklists for ECDSA and EdDSA
es: Separa las listas negras de streaming para ECDSA y EdDSA
id: Blacklist streaming terpisah untuk ECDSA dan EdDSA

source: Attending: Sadie, Colin, lazygravy, zzz, hottuna, kytv, cacapo, and eche|on.
es: Asistentes: Sadie, Colin, lazygravy, zzz, hottuna, kytv, cacapo, and eche|on.
id: Yang hadir: Sadie, Colin, lazygravy, zzz, hottuna, kytv, cacapo, dan echelon.

source: Just like previous years we were located in Noisy Square, located near the EFF's table. This proved to be an ideal spot for us as our table was almost always busy with current and new users who were interested in I2P, many of whom we wouldn't have otherwise had the ability to talk to.
es: Como en años anteriores estamos ubicados en Noisy Square, que se localiza junto a la mesa de la EFF. Este demostró ser un punto ideal para nosotros ya que nuestra mesa estuvo casi siempre ocupada con usuarios actuales y nuevos usuarios que estaban interesados en I2P, con muchos de los cuales no habríamos tenido la oportunidad de conversar de otro modo.
id: Sama seperti tahun kemarin, kami berada Noisy Square, di dekat meja EFF. Ini menjadi ideal bagi kami karena meja kami hampir selalu sibuk dengan pengguna baru dan lama yang tertarik dengan I2P, banyak yang sebelumnya tidak dapat temui..

source: Reseed Status =============
es: Estado de resembrado ===================
id: Status Reseed =============

source: Let's get more reseeds!
es: ¡Consigamos más resembrados!
id: Ayo dapatkan reseed lebih banyak!

source: Sybil Detection (beta) ======================
es: Detección de ataques Sybil (beta) =============================
id: Deteksi Sybil (beta) ======================

source: Due to the decentralized nature of I2P detecting Sybil attacks is not as straight forward as on other networks (i.e. Tor). To mitigate this zzz has been working on a new router-based Sybil detection tool. To be brief, the tool runs in the router, and collects information on floodfills your router is currently aware of. Currently the tool is mainly collecting a baseline and does not act on any of the information it is collecting. Expect to see a writeup on this more as 0.9.25 or 0.9.26 approaches, as it is still in active development
es: Debido a la naturaleza descentralizada de I2P la detección de ataques tipo Sybil no es tan directa como en otras redes (ej. Tor). Para mitigar esto zzz ha estado trabajando en una nueva herramienta de detección de ataques Sybil basada en el router I2P. Para abreviar, la herramienta se ejecuta en el router I2P, y recopila información sobre routers I2P de inundación (floodfills) de los que su router I2P tiene conocimiento en ese momento. Actualmente la herramienta está recopilando principalmente un basamento y no actúa sobre ninguno de los datos que está recogiendo. Espere ver una reseña sobre esto según se aproximen más las versiones 0.9.25 o 0.9.26, ya que aún se encuentra en pleno desarrollo.
id: Karena sifat desentralisasi I2P, mendeteksi serangan Sybil tidak sesederhana pada jaringan lain (seperti dalam Tor). Untuk mengatasi ini, zzz telah membuat alat baru pada deteksi Sybil di router. Singkat kata, alat ini berjalan di router, dan mengumpulkan informasi pada router Anda sedang mendeteksi floodfills. Saat ini, alat ini utamanya mengumpulkan baseline dan tidak bertindak terhadap informasi yang dikumpulkan. Harapkan untuk melihat revisi pada hal ini sampai mendekati rilis 0.9.25 atau 0.9.26, yang masih dalam pengembangan aktif

source: Development Meeting ===================
es: Reunión de desarrollo ===================
id: Pertemuan Pengembangan ===================

source: Meeting (Future) ================
es: Reunión (Futura) ================
id: Pertemuan (Di Masa Depan) ================

source: Review of assigned tasks from 30 December meeting
es: Revisión de las tareas asignadas en la reunión del 30 de diciembre
id: Tinjauan tugas yang ditugaskan pada pertemuan 30 Desember

source: Project meeting plan for 2016
es: Plan de la reunión del proyecto para 2016
id: Rencana rapat proyek 2016

source: GMP 6 readiness
es: Estado de preparación para la librería GMP 6
id: Kesiapan GMP 6

source: A proposal for a code of conduct
es: Una propuesta para un código de conducta
id: Proposal untuk kode etik

source: ============== 0.9.24 Release ==============
es: ============== Versión 0.9.24 ==============
id: ============== Rilis 0.9.24 ==============

source: 0.9.24 contains a variety of bug fixes and performance enhancements
es: La versión 0.9.24 contiene una variedad de reparaciones de fallos y mejoras de rendimiento
id: 0.9.24 berisi berbagai perbaikan bug dan peningkatan kinerja

source: 0.9.24 contains a new version of SAM (v3.2) and numerous bug fixes and efficiency improvements. Note that this release is the first to require Java 7. Please update to Java 7 or 8 as soon as possible. Your router will not automatically update if you are using Java 6.
es: La versión 0.9.24 contiene una versión de SAM (v3.2) y numerosas correcciones de fallos y mejoras de eficiencia. Observe que esta versión es la primera que requiere Java 7. Por favor, actualice a Java 7 u 8 tan pronto como sea posible. Su router I2P no se actualizará automáticamente si está usando Java 6.
id: 0.9.24 berisi versi baru SAM (v3.2), banyak perbaikan bug, dan peningkatan efisiensi. Perhatikan bahwa rilis ini adalah yang pertama membutuhkan Java 7. Silahkan perbarui ke Java 7 atau 8 sesegera mungkin. Router Anda tidak akan secara otomatis memperbarui jika Anda menggunakan Java 6.

source: Java 7 now required
es: Ahora requiere Java7
id: Java 7 sekarang dibutuhkan

source: SAM 3.2, with several new advanced features, command parser improvements, and lots of bug fixes
es: SAM 3.2, con varias características avanzadas nuevas, mejoras del interprete de comandos, y muchas correcciones de fallos.
id: SAM 3.2, dengan beberapa fitur canggih baru, perbaikan perintah parser, dan banyak perbaikan bug

source: Commons logging removed
es: Se eliminó la librería commons logging
id: Commons logging dihapus

source: Fix HTML escaping in the console plugin table
es: Corrige el HTML escapando (no siendo interpretado como tal) en la tabla del complemento de consola
id: Perbaikian HTML escaping di tabel plugin console

source: Fix rare deadlocks in the router
es: Corrige extraños estancamientos en el router I2P
id: Perbaikan deadlock langka di router

source: Fix the tunnel build Bloom filter
es: Repara el filtro Bloom levantado por túnel
id: Perbaikan tunnel build filter Bloom

source: Don't remove tunnel on next-hop failure indication from transport, it isn't reliable
es: No elimina el túnel con una indicación de fallo en el próximo-salto desde el transporte, no es fiable
id: Jangan menghapus tunnel pada indikasi kegagalan hop berikutnya dari transportasi, itu tidak bisa diandalkan

source: Fix formatting in summary bar to prevent overflow
es: Corrige el formato en la barra de resumen para evitar desbordamiento
id: Perbaikan format di summary bar untuk mencegah overflow

source: Fix console links in i2ptunnel error pages when on nonstandard host/port
es: Corrige enlaces de consola en páginas de error de i2ptunnel cuando apunten a servidor/puerto no estándar
id: Perbaiki tautan console di halaman kesalahan i2ptunnel saat berada di host/port yang tidak standar

source: Don't query floodfills whose version is too old to support encrypted replies
es: No consulta routers I2P de inundación (floodfills) cuya versión sea demasiado antigua para soportar respuestas cifradas.
id: Jangan meminta floodfill yang versinya terlalu tua untuk mendukung balasan terenkripsi

source: Reduce out-of-order delivery in SSU
es: Reduce la entrega fuera-de-servicio sobre SSU
id: Kurangi pengiriman out-of-order di SSU

source: Fix a rare NPE in the tunnel build handler
es: Corrige un extraño fallo NPE en el puntero levantado por el túnel
id: Perbaiki NPE langka di tunnel build handler

source: Listen for Windows Service shutdown events to shutdown cleanly
es: Escucha eventos de cierre de Windows Service para cerrar de forma limpia
id: Mendengarkan event shutdown Windows Service untuk shutdown dengan bersih

source: Fix some IPv6 issues on Windows
es: Corrige algunos problemas con IPv6 en Windows
id: Perbaikan beberapa masalah IPv6 di Windows

source: Change Jetty request logging from b64 to b32
es: Cambia el registrado (log) de peticiones Jetty de b64 a b32
id: Mengganti Jetty request logging dari b64 ke b32

source: New 'family' indication in netdb, don't use two of the same family in a tunnel
es: Nueva indicación 'family' (familia) en netdb, no usa dos de la misma familia en un túnel
id: Indikasi 'family' baru di netdb, jangan gunakan dua router family yang sama di tunnel

source: New overview picture in SusiDNS
es: Nueva imagen general en SusiDNS
id: Gambaran ikhtisar baru di SusiDNS

source: Close connection faster if it's for a rejected tunnel request
es: Cierra la conexión más rápido si es para una petición de túnel rechazada
id: Menutup koneksi lebih cepat jika untuk permintaan tunnel ditolak

source: Use SSU extended options field for session request message
es: Usa el campo de opciones extendidas de SSU para el mensaje de petición de sesión
id: Gunakan bidang opsi perpanjangan SSU untuk pesan permintaan sesi

source: Request introduction in the SSU extended options
es: Petición de introducción (a la red) en las opciones extendidas de SSU
id: Meminta pengenalan dalam opsi perpanjangan SSU

source: Don't offer to introduce unless requested, to introduce only those that need it
es: No ofrece introducción a menos que sea solicitado, para introducir sólo a aquellos que lo necesiten
id: Tidak menawarkan untuk memperkenalkan kecuali diminta, hanya untuk mengenalkan yang membutuhkannya

source: Experimental Sybil analysis tool, requires routerconsole.advanced=true
es: Herramienta de análisis de ataques Sybil experimental, requiere routerconsole.advanced=true
id: Alat analisis Sybil eksperimental, membutuhkan routerconsole.advanced=true

source: Persist some profile netdb stats that weren't being saved
es: Hace persistir estadísticas netdb de algunos perfiles que no se estaban guardando
id: Mempertahankan beberapa profil statistik netdb yang tidak disimpan

source: Memory reduction and other efficiency improvements throughout
es: Reducción de memoria y otras mejoras de eficiencia por toda la aplicación
id: Pengurangan memori dan peningkatan efisiensi lainnya

source: Increase several limits in i2psnark
es: Incrementa varios límites en i2psnark
id: Tingkatkan beberapa batasan di i2psnark

source: New streaming unit tests
es: Nuevas pruebas de la unidad de streaming
id: Tes unit streaming baru

source: Fix some SSU stats on /peers to be consistent with NTCP
es: Corrige algunas estadísticas de SSU sobre /peers para que sean consistentes con NTCP
id: Perbaikan beberapa statistik SSU di /peer konsisten dengan NTCP

source: Change default sig type for new i2ptunnels to Ed25519
es: Cambia el tipo de firma predeterminada para nuevos túneles i2ptunnel a Ed25519
id: Ubah tipe sig default untuk i2ptunnels baru ke Ed25519

source: Increase router rekey probability at startup again
es: Incrementa la probabilidad de renovación de claves del router I2P en el inicio otra vez
id: Meningkatkan probabilitas rekey router saat startup lagi

source: New Chinese (Taiwan) translation
es: Nueva traducción al chino (de Taiwán)
id: Terjemahan baru bahasa Mandarin (Taiwan)

source: ============== 0.9.25 Release ==============
es: ============== Versión 0.9.25 ==============
id: ============== Rilis 0.9.25 ==============

source: 0.9.25 contains SAM 3.3, QR codes, and bug fixes
es: 0.9.25 contiene SAM 3.3, códigos QR, y correcciones de fallos
id: 0.9.25 berisi SAM 3.3, kode QR, dan perbaikan bug.

source: 0.9.25 contains a major new version of SAM, v3.3, to support sophisticated multiprotocol applications. It adds QR codes for sharing hidden service addresses with others, and "identicon" images for visually distinguishing addresses.
es: La versión 0.9.25 contiene una nueva versión principal de SAM, v3.3, para soportar aplicaciones multiprotocolo sofisticadas. Añade códigos QR para compartir direcciones de servicios ocultos con otros, e imágenes "identicon" para distinguir direcciones visualmente.
id: 0.9.25 berisi versi baru SAM v3.3 untuk mendukung aplikasi multiprotocol yang canggih. Rilis ini menambahkan kode QR untuk berbagi alamat hidden service dengan orang lain, dan gambar "identicon" untuk membedakan alamat secara visual.

source: We've added a new "router family" configuration page in the console, to make it easier to declare that your group of routers is run by a single person. There are several changes to increase the capacity of the network and hopefully improve tunnel build success.
es: Hemos añadido una nueva página de configuración de "familia de router I2P" en la consola, para facilitar declarar que su grupo de routers I2P está ejecutado por una sola persona. Hay varios cambios para incrementar la capacidad de la red y con suerte mejorar el establecimiento exitoso de túneles.
id: Kami telah menambahkan halaman konfigurasi "router family" baru di console, untuk memudahkan untuk menyatakan bahwa kelompok router Anda dijalankan oleh satu orang. Ada beberapa perubahan untuk meningkatkan kapasitas jaringan dan semoga hal ini meningkatkan kesuksesan dalam membangun tunnel.

source: Display of identicons and QR codes in address book and i2ptunnel
es: Muestra identicons y códigos QR en la libreta de direcciones e i2ptunnel
id: Tampilan identik dan kode QR di buku alamat dan i2ptunnel

source: SAM v3.3 with advanced features
es: SAM v3.3 con características avanzadas
id: SAM v3.3 dengan fitur canggih

source: Configuration page for router family
es: Página de configuración para la familia del router I2P
id: Halaman konfigurasi untuk keluarga router

source: Custom icons for plugins
es: Iconos personalizados para complementos
id: Ikon khusus untuk plugin
