Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Internal implementation of self-signed certificate generation
es: Implementación interna de generación de certificados auto-firmados
id: Pelaksanaan internal sertifikat yang ditandatangani sendiri

source: Add i2ptunnel http server options to block by referer or user-agent
es: Añade opciones al servidor http de i2ptunnel para bloquear por referer o agente-del-usuario
id: Tambahan pilihan server http i2ptunnel untuk blokir oleh referer atau user-agent

source: IRC server tunnel default fix to help reliability
es: Corrección de la configuración predeterminada del túnel del servidor IRC para contribuir a la fiabilidad
id: Perbaikan default tunnel server IRC untuk meningkatkan keandalan

source: Don't wait until a lease expires to switch to a new on
es: No espera hasta que un lease (túnel autorizado a un destino) expire para cambiar a uno nuevo activo
id: Jangan menunggu sampai lease berakhir untuk beralih ke yang baru

source: Preliminary support for certificate revocations
es: Soporte preliminar para revocaciones de certificados
id: Dukungan awal untuk pembatalan sertifikat

source: Preliminary support for storing EdDSA and ElGamal keys in keystores
es: Soporte preliminar para almacenar claves EdDSA y ElGamal en almacenamientos de claves
id: Dukungan awal untuk menyimpan kunci EdDSA dan ElGamal di keystore

source: More efficient signing and verification with EdDSA
es: Firmado y verificación más eficiente con EdDSA
id: Penandatanganan dan verifikasi lebih efisien dengan EdDSA

source: Increase default connection limits
es: Incrementa los límites predeterminados de la conexión
id: Meningkatkan batas koneksi default

source: Increase default inbound bandwidth
es: Incrementa el ancho de banda entrante predeterminado
id: Meningkatkan default bandwidth masuk

source: Increase max files per torrent in i2psnark
es: Incrementa el número máximo de ficheros por torrent en i2psnark
id: Meningkatkan jumlah file maks per torrent di i2psnark

source: Add more sanity checks to detect bad system clock
es: Añade más comprobaciones de salubridad para detectar relojes de sistema erróneos
id: Tambahkan lebih banyak pemeriksaan sanity untuk mendeteksi jam sistem yang buruk

source: Improve news styling in console
es: Mejora el estilo de noticias en la consola
id: Peningkatkan gaya berita di console

source: Improve certificate blacklist implementation
es: Mejora la implementación de lista negra de certificados
id: Perbaiki penerapan sertifikat blacklist

source: Faster disconnect after publishing router info to floodfill
es: Desconexión más rápida tras publicar la información del router I2P en el router I2P de inundación (floodfill)
id: Pemutusan lebih cepat setelah mempublikasikan info router ke floodfill

source: Smooth out the dropping of idle SSU sessions
es: Desobstaculiza el descarte de sesiones SSU ociosas
id: Memperlancar pemutusan sesi SSU yang menganggur

source: Add X-Content-Type-Options headers in console
es: Añade cabeceras X-Content-Type-Options en la consola
id: Tambahan header X-Content-Type-Options di console

source: We are pleased to announce that this summer, I2P will be embarking on a development program aimed at improving the privacy software ecosystem for both developers and users.
es: Nos complace anunciar que este verano, I2P se embarcará en un programa de desarrollo (I2P Summer Dev - verano de desarrollo de I2P) orientado a mejorar el ecosistema de software de privacidad, tanto para desarrolladores como para usuarios.
id: Dengan senang hati kami umumkan bahwa musim panas ini, I2P akan memulai program pengembangan yang bertujuan memperbaiki ekosistem perangkat lunak privasi, baik untuk pengembang maupun pengguna.

source: Over the last few years, the need for users to be in control of their own data has become increasingly apparent. Some excellent progress had been made in this regard with the rise of messaging apps like Signal_, and file storage systems like Tahoe-LAFS_. The ongoing work of `Let's Encrypt`_ to bring HTTPS to the whole world is steadily gaining traction.
es: Durante los últimos años, la necesidad de los usuarios de tener el control de sus propios datos se ha vuelvo cada vez más aparente. Se han realizado algunos progresos excelentes a este respecto con la aparición de aplicaciones como Signal_, y sistemas de almacenamiento de ficheros como Tahoe-LAFS_. Además del trabajo continuado de `Let's Encrypt`_ (cifremos) para llevar HTTPS a todo el mundo, está ganando fuerza de forma sostenida.
id: Selama beberapa tahun terakhir, kebutuhan pengguna untuk mengendalikan data mereka sendiri telah menjadi semakin nyata. Beberapa kemajuan yang sangat baik telah dicapai sehubungan dengan munculnya aplikasi pesan singkat seperti Signal_, dan sistem penyimpanan file seperti Tahoe-LAFS_. Pekerjaan yang sedang berlangsung seperti `Let's Encrypt`_ untuk membawa HTTPS ke seluruh dunia terus mendapatkan daya tarik.

source: But building privacy and anonymity into applications is not trivial. Much of the software people use every day was not designed to be privacy-preserving, and the tools developers have available are generally not easy to work with. The recently-published OnionScan_ survey gives some insight into just how easy it is for even technical users to mis-configure their services, completely undermining their intentions.
es: Pero incorporar privacidad y anonimato a las aplicaciones no es trivial. La mayoría del software que la gente usa cada día no fue diseñado para preservar la privacidad, y generalmente no es fácil trabajar con las herramientas que los desarrolladores tienen disponibles. El sondeo OnionScan_ recientemente publicado proporciona una mejor percepción de lo fácil que es que, incluso usuarios técnicamente capaces, configuren mal sus servicios, socavando completamente sus intenciones.
id: Tapi membangun kerahasiaan dan anonimitas menjadi aplikasi tidaklah sepele. Sebagian besar perangkat lunak yang digunakan setiap hari tidak dirancang untuk menjaga privasi, dan alat pengembang yang tersedia umumnya tidak mudah digunakan. Survei OnionScan_ yang baru dipublikasikan memberikan beberapa wawasan tentang betapa mudahnya pengguna teknis untuk salah mengonfigurasi layanan mereka, yang benar-benar merusak niat mereka.

source: Helping developers help their users ===================================
es: Colaborando a que los desarrolladores ayuden a sus usuarios =========================================================
id: Membantu pengembang dalam membantu pengguna mereka ===================================

source: We are pleased to announce that this summer, I2P will be embarking on a development program aimed at improving the privacy software ecosystem. Our goal is to make life easier both for developers wanting to leverage I2P in their applications, and for users trying to configure and run their apps through I2P.
es: Nos complace anunciar que este verano, I2P se embarcará en un programa de desarrollo (I2P Summer Dev - verano de desarrollo de I2P) orientado a mejorar el ecosistema de software de privacidad. Nuestro objetivo es hacer la vida más fácil tanto para desarrolladores que quieran sacar provecho de I2P en sus aplicaciones, como para usuarios que traten de configurar y ejecutar sus aplicaciones a través de I2P.
id: Dengan senang hati kami umumkan bahwa musim panas ini, I2P akan memulai program pengembangan yang bertujuan memperbaiki ekosistem perangkat lunak privasi. Tujuan kami adalah untuk membuat hidup lebih mudah bagi pengembang yang ingin memanfaatkan I2P dalam aplikasi mereka, dan bagi pengguna yang mencoba mengonfigurasi dan menjalankan aplikasi mereka melalui I2P.

source: We will be focusing our time this summer into three complementary areas:
es: Este verano vamos a enfocar nuestro tiempo en tres áreas complementarias:
id: Kami akan memfokuskan waktu kami musim panas ini ke dalam tiga area:

source: June: APIs ----------
es: Junio: APIs ----------
id: Juni: APIs ----------

source: In June, we will be updating the various libraries that exist for interfacing with I2P. We have made significant progress this year on extending our SAM_ API with additional features, such as support for datagrams and ports. We plan to make these features easily accessible in our C++ and Python libraries.
es: En junio, estaremos actualizando las distintas librerías que existen para la interfaz con I2P. Hemos hecho progresos significativos este año en extender nuestra API de SAM_ con características adicionales, como soporte para datagramas y puertos. Planeamos hacer que estas características sean fácilmente accesibles en nuestras librerías C++ y Python.
id: Pada bulan Juni, kami akan memperbarui berbagai library yang ada untuk berinteraksi dengan I2P. Kami telah membuat kemajuan yang signifikan tahun ini untuk memperluas API SAM_ kami dengan fitur tambahan, seperti dukungan untuk datagrams dan port. Kami berencana untuk membuat fitur ini mudah diakses di library C ++ dan Python kami.

source: We will also soon be making it much easier for Java and Android developers to add I2P support to their applications. Stay tuned!
es: Pronto también nos pondremos a facilitar que los desarrolladores para Java y Android añadan soporte I2P a sus aplicaciones. ¡Manténgase a la escucha!
id: Kami juga akan segera mempermudah pengembang Java dan Android untuk menambahkan dukungan I2P ke aplikasi mereka. Tetap disini!

source: July: Apps ----------
es: Julio: Aplicaciones ----------
id: Juli: Apps ----------

source: In July we will be working with applications that have expressed interest in adding support for I2P. There are some really neat ideas being developed in the privacy space right now, and we want to help their communities leverage over a decade of research and development on peer-to-peer anonymity. Extending these applications to work natively over I2P is a good step forward for usability, and in the process will improve how these applications think about and handle user information.
es: En julio estaremos trabajando con aplicaciones que han expresado interés en añadir soporte para I2P. Ahora mismo hay algunas ideas realmente brillantes en desarrollo en el ámbito de la privacidad, y queremos ayudar a sus comunidades a sacar provecho de más de una década de investigación y desarrolllo en el anonimato entre pares (P2P). Extender estas aplicaciones para que funcionen de forma nativa sobre I2P es un buen avance en la usabilidad, y durante el proceso mejorará la forma en que estas aplicaciones se plantean y gestionan la información del usuario.
id: Pada bulan Juli, kami akan mengerjakan aplikasi yang telah menyatakan minatnya untuk menambahkan dukungan untuk I2P. Ada beberapa gagasan yang benar-benar rapi yang dikembangkan di ruang privasi saat ini, dan kami ingin membantu komunitas mereka memanfaatkan lebih dari satu dekade penelitian dan pengembangan tentang anonimitas peer-to-peer. Memperluas aplikasi ini untuk bekerja secara native di atas I2P adalah langkah maju yang baik untuk kegunaan, dan dalam prosesnya akan memperbaiki bagaimana aplikasi ini memikirkan dan menangani informasi pengguna.

source: August: Plugins ---------------
es: Agosto: Complementos ---------------
id: Agustus: Plugins ---------------

source: Finally, in August we will turn out attention to the apps we bundle inside I2P, and the wider array of plugins. Some of these are due for some love, to make them more user-friendly - as well as fix any outstanding bugs! We hope that longtime I2P supporters will enjoy the outcome of this work.
es: Finalmente, en agosto volveremos nuestra atención a las aplicaciones que incluimos en el paquete I2P, y la colección cada vez más amplia de complementos. Algunos de ellos están debido a cierto aprecio, para hacerlos más amables para el usuario - ¡además de reparar cualquier fallo prominente! Esperamos que los más fieles entusiastas de I2P disfruten del resultado de este trabajo.
id: Akhirnya, pada bulan Agustus, kami akan mengalihkan perhatian ke aplikasi yang kami rangkai di dalam I2P, dan rangkaian plugin yang lebih luas. Beberapa di antaranya adalah karena kami menyukainya, untuk membuatnya lebih mudah digunakan - dan juga memperbaiki bug yang beredar! Kami berharap para pendukung I2P lama akan menikmati hasil dari pekerjaan ini.

source: Take part in Summer Dev! ========================
es: ¡Participe en el Summer Dev! ===========================
id: Berpartisipasi dalam Summer Dev! ========================

source: We have many more ideas for things we'd like to get done in these areas. If you're interested in hacking on privacy and anonymity software, designing usable websites or interfaces, or writing guides for users: come and chat with us on IRC or Twitter! We are always happy to "see" new "faces" in our community, both inside and outside I2P. We'll be sending I2P stickers out to all new contributors taking part (or possibly other pending I2P goodies)!
es: Tenemos muchas más ideas para cosas que nos gustaría completar en estas áreas. Si está interesado en el hacking de software de privacidad y anonimato, en diseñar sitios web o interfaces con usabilidad, o en escribir guías para usuarios: ¡venga y charle con nosotros en el IRC o en Twitter! Siempre nos alegra "ver" nuevas "caras" en nuestra comunidad, tanto de dentro como de fuera de I2P. ¡Vamos a enviar pegatinas de I2P (o posiblemente otros artículos de I2P pendientes) a todo nuevo contribuidor que participe!
id: Kami memiliki lebih banyak gagasan untuk hal-hal yang ingin kami lakukan di bidang ini. Jika Anda tertarik untuk meretas perangkat lunak privasi dan anonimitas, merancang situs web atau antarmuka yang dapat digunakan, atau menulis panduan untuk pengguna: datang dan mengobrol dengan kami di IRC atau Twitter! Kami selalu senang "melihat" wajah baru "di komunitas kami, baik di dalam maupun di luar I2P. Kami akan mengirimkan stiker I2P ke semua kontributor baru (atau mungkin barang I2P lainnya yang tertunda)!

source: Likewise, if you are an application developer who wants a hand with integrating I2P, or even just to chat about the concepts or details: get in touch! If you want to get involved in our July Apps month, contact `@GetI2P`_, `@i2p`_ or `@str4d`_ on Twitter. You can also find us in #i2p-dev on OFTC or FreeNode.
es: De forma similar, si usted es un desarrollador de aplicaciones y quiere que le echemos una mano con la integración de I2P, o incluso sólo charlar acerca de conceptos o detalles: ¡póngase en contacto! Si quiere participar en nuestro Julio de Aplicaciones durante el mes, contacte con `@GetI2P`_, `@i2p`_ o `@str4d`_ en Twitter. También por IRC en #i2p-dev en OFTC o Freenode.
id: Demikian juga, jika Anda seorang pengembang aplikasi yang menginginkan bantuan dalam mengintegrasikan I2P, atau bahkan hanya untuk mengobrol tentang konsep atau detailnya: hubungi kami! Jika Anda ingin terlibat dalam bulan Juli Apps, hubungi `@GetI2P`_, '@i2p`_ atau `@str4d`_ di Twitter. Anda juga dapat menemukan kami di #i2p-dev di OFTC atau FreeNode.

source: We'll be posting here as we go, but you can also follow our progress, and share your own ideas and work, with the hashtag `#I2PSummer`_ on Twitter. Bring on the summer!
es: Vamos a estar publicando aquí según avancemos, pero también puede seguir nuestros progresos, y compartir sus propias ideas y trabajo, con el hashtag `#I2PSummer`_ en Twitter. ¡Venga ese verano!
id: Kami akan posting di sini saat acara berlangsung, tapi Anda juga bisa mengikuti kemajuan kami, dan berbagi ide dan pekerjaan Anda sendiri, dengan hashtag `#I2PSummer`_ di Twitter. Bring on the summer!

source: ============== 0.9.26 Release ==============
es: ============== Versión 0.9.26 ==============
id: ============== Rilis 0.9.26 ==============

source: 0.9.26 contains crypto updates, Debian packaging improvements, and bug fixes
es: La versión 0.9.26 contiene actualizaciones de criptografía, mejoras del empaquetado Debian, y correciones de fallos
id: 0.9.26 dirilis dengan pembaruan crypto, peningkatan kinerja untuk Debian, dan perbaikan bug

source: 0.9.26 contains a major upgrade to our native crypto library, a new addressbook subscription protocol with signatures, and major improvements to the Debian/Ubuntu packaging.
es: La 0.9.26 contiene una actualización importante de nuestra librería de criptografía nativa, un nuevo protocolo de suscripción de libreta de direcciones con firmas, y mejoras importantes para el empaquetado Debian/Ubuntu.
id: 0.9.26 berisi pembaruan besar ke crypto library asli kami, protokol baru untuk addressbook subscription protocol with signatures, dan peningkatan besar pada paket Debian/Ubuntu.

source: For crypto, we have upgraded to GMP 6.0.0, and added support for newer processors, which will speed up crypto operations considerably. Also, we are now using constant-time GMP functions to prevent side-channel attacks. For caution, the GMP changes are enabled for new installs and Debian/Ubuntu builds only; we will include them for in-net updates in the 0.9.27 release.
es: Para criptografía, hemos actualizado a GMP 6.0.0, y añadido soporte para nuevos procesadores, que acelerarán las operaciones de criptografía considerablemente. Además, ahora estamos usando funciones GMP de tiempo-constante para prevenir ataques de canal-lateral. Por precaución, los cambios de GMP sólo están habilitados para nuevas instalaciones y versiones (builds) Debian/Ubuntu; las incluiremos para actualizaciones dentro-de-la-red en la versión 0.9.27.
id: Untuk kripto, kami telah memperbarui ke GMP 6.0.0 dan menambahkan dukungan untuk prosesor yang lebih baru, yang akan mempercepat operasi crypto secara signifikan. Selain itu, kami sekarang menggunakan GMP constant-time untuk mencegah serangan side-channel. Untuk kehatihatian, perubahan GMP diaktifkan hanya untuk pemasangan baru di Debian/Ubuntu; Kami akan menyertakan mereka untuk pembaruan in-net dalam rilis 0.9.27.

source: For Debian/Ubuntu builds, we have added dependencies on several packages, including Jetty 8 and geoip, and removed the equivalent bundled code.
es: Para versiones (builds) para Debian/Ubuntu, hemos añadido dependencias en varios paquetes, incluyendo Jetty 8 y geoip, y hemos eliminado el código empaquetado equivalente.
id: Untuk versi Debian/Ubuntu, kami telah menambahkan dependensi pada beberapa paket, termasuk Jetty 8 dan geoip, dan menghapus kode paket yang setara.

source: There's a collection of bug fixes also, including a fix for a timer bug that caused instability and performance degradations over time.
es: También hay una recopilación de correcciones de fallos, incluyendo una corrección para un fallo de cronometraje que causaba inestabilidad y degradación del rendimiento con el paso del tiempo.
id: Ada juga koleksi perbaikan bug, termasuk perbaikan bug timer yang menyebabkan ketidakstabilan dan penurunan kinerja dari waktu ke waktu.

source: GMP 6.0.0 and jbigi/jcpuid native libraries, enabling significant speedups on newer architectures, and constant-time crypto operations (new installs and Debian/Ubuntu builds only, will include in the updates in the next release, 0.9.27)
es: Librerías nativas GMP 6.0.0 y jbigi/jcpuid, que habilitan incrementos de velocidad significativos en las arquitecturas más recientes, y operaciones de criptografía de tiempo-constante (sólo para nuevas instalaciones y versiones (builds) Debian/Ubuntu, se incluirán en las actualizaciones en la próxima versión, 0.9.27)
id: GMP 6.0.0 dan jbigi/jcpuid native library, yang memungkinkan percepatan signifikan pada arsitektur yang lebih baru, dan operasi kripto konstan-waktu (hanya untuk pemasangan baru dan Debian/Ubuntu, akan tercakup pada rilis berikutnya, 0.9.27)

source: Addressbook subscription protocol, enabling signed addressbook updates
es: Protocolo de suscripción de la libreta de direcciones, que habilita actualizaciones firmadas de libreta de direcciones
id: Protokol subskripsi buku alamat, memungkinkan update buku alamat yang ditandatangani

source: Generate signed authentication strings for subscriptions in i2ptunnel
es: Genera cadenas de autentificación firmadas para suscripciones en i2ptunnel
id: Pembuatan string otentikasi yang ditandatangani untuk subskripsi di i2ptunnel

source: Enhance hosts blockfile format to allow for multiple destinations per entry
es: Mejora el formato del fichero de bloques de hosts para permitir múltiples destinos I2P por entrada
id: Meningkatkan format blockfile host untuk memungkinkan beberapa destinasi per entri

source: Use system GeoIP database when available
es: Usa la base de datos GeoIP del sistema cuando esté disponible
id: Penggunaan sistem database GeoIP bila tersedia

source: Remove systray4j.jar from non-Windows installers and Debian/Ubuntu packages
es: Elimina systray4j.jar de los instaladores no-Windows y los paquetes Debian/Ubuntu
id: Menghapus systray4j.jar dari installer non-Windows dan paket Debian / Ubuntu

source: Remove multiple external libraries from Debian/Ubuntu builds, and add dependencies on: geoip-database, gettext-base, libgetopt-java, libjetty8-java, libservlet3.0-java, glassfish-javaee
es: Elimina múltiples librerías externas de las versiones (builds) Debian/Ubuntu, y añade dependencias sobre: geoip-database, gettext-base, libgetopt-java, libjetty8-java, libservlet3.0-java, glassfish-javaee
id: Menghapus beberapa library eksternal dari Debian / Ubuntu, dan menambahkan dependensi pada: geoip-database, gettext-base, libgetopt-java, libjetty8-java, libservlet3.0-java, glassfish-javaee

source: Store CRLs received in the news feed, to distribute key revocations when necessary
es: Almacena las CRLs (listas de revocación de certificados) recibidas en la suscripción (feed) de noticias, para distribuir las revocaciones de claves cuando sea necesario
id: menyimpan CRLs yang diterima di news feed, untuk mendistribusikan pencabutan kunci saat diperlukan

source: Enhancements to the desktopgui system tray feature, to be enabled by default in next release
es: Mejoras en la característica de bandeja de sistema de desktopgui (interfaz gráfica de escritorio), que se habilitarán por defecto en la próxima versión
id: Penambahan pada fitur systray desktopgui, diaktifkan secara default di rilis berikutnya

source: Wrapper 3.5.29 (new non-Windows installs only)
es: Wrapper 3.5.29 (encapsulador como servicio) (sólo para nuevas instalaciones no-Windows)
id: Wrapper 3.5.29 (hanya pemasangan baru di non-Windows)

source: Fix periodic timers not firing after a backwards OS clock shift, which caused widespread instability and gradual deterioration
es: Corrige un fallo de los cronometrajes periódicos no disparándose tras un desfase del reloj del SO, que causaba una extensa inestabilidad y un deterioro gradual.
id: Perbaiki timer periodik yang tidak aktif setelah pergeseran jam OS mundur, yang menyebabkan ketidakstabilan dan penurunan bertahap secara meluas

source: Fix wrapper on FreeBSD 10 (new installs only, see ticket #1118 for manual fix)
es: Corrige el encapsulador (wrapper) en FreeBSD 10 (sólo nuevas instalaciones, vea el ticket #1118 para una reparación manual)
id: Perbaikan wrapper di FreeBSD 10 (pemasangan baru saja, lihat tiket # 1118 untuk perbaikan manual)

source: Fix NPE on hostname lookup failure in SOCKS 4a
es: Corrige un fallo NPE (excepción de puntero nulo) en la búsqueda de nombre de nodo en SOCKS 4a
id: Perbaikan NPE pada kegagalan lookup hostname di SOCKS 4a

source: Fix setting JAVA_HOME on Mac OS X (new installs only, see ticket #1783 for manual fix)
es: Corrige la configuración JAVA_HOME en Mac OS X (sólo en nuevas instalaciones, vea el ticket #1783 para una reparación manual)
id: Perbaikan pengaturan JAVA_HOME di Mac OS X (hanya pemasangan baru, lihat tiket #1783 untuk perbaikan manual)
