Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Fix router bug causing lockup when using iMule
es: Arreglado el problema del bloqueo del ruter cuando se usaba iMule.
id: Memperbaiki bug router yang menyebabkan lockup ketika menggunakan iMule

source: Recognize, handle, reject duplicate tunnel IDs
es: Reconocimiento, manejo y rechazo de IDs de túneles duplicados.
id: Mengenali, menangani, menolak id tunnel duplikat

source: Fix changing of the log file name
es: Corregido el cambio de nombre del archivo de registro
id: Memperbaiki perubahan nama file log

source: Prevent hashcode attack in session tags
es: Prevención contra el ataque hashcode en las etiquetas de sesión
id: Mencegah serangan kode hash di tag sesi

source: Add build request throttler based on previous hop
es: Añadido el acelerador de construcción de peticiones basado en el salto anterior
id: Menambahlan permintaan pembangunan throttler berdasarkan hop sebelumnya

source: Limit concurrent next-hop lookups
es: Limitar las búsquedas concurrentes del siguiente salto
id: Membatasi pencarian next-hop yang bersamaan

source: Catch exceptions storing nonces in console
es: Capturar las excepciones almacenando nonces en la consola
id: Menangkap exceptions storing nonces di konsol

source: Fix saving graph settings in console
es: Arreglado el guardar la configuración gráfica en la consola
id: Memperbaiki penyimpanan pengaturan grafik di console

source: Fix eepget generation of URLs when not proxied
es: Arreglada la creación de URLs eepget sin proxy
id: Memperbaiki pembuatan URL eepget ketika tidak menggunakan proxy

source: Encrypt database lookup messages end-to-end when sent through exploratory tunnels
es: Cifrado delos mensajes fin-a-fin de búsqueda en la base de datos cuando son enviados a través de túneles exploratorios.
id: Mengenkripsi pesan pencarian database end-to-end ketika dikirim melalui exploratory tunnels

source: Don't use multiple floodfills from the same /16 in a query
es: Cuando se consulta no se usan múltiples foodfills de la misma /16 , zona de red.
id: Jangan gunakan beberapa floodfills dari /16 yang sama di sebuah query

source: Randomize delay before verifying floodfill store
es: Se aleatoriza el retardo antes de verificar el almacenamiento floodfill
id: Mengacak penundaan sebelum memverifikasi floodfill store

source: Increase number of floodfills
es: Aumento en el número de floodfills
id: Peningkatan jumlah floodfills

source: Improve support for mobile browsers
es: Mejora del soporte para navegadores en móviles.
id: Meningkatkan dukungan untuk peramban seluler

source: Partial defenses for UCSB attacks
es: Defensa parcial contra los ataques UCSB
id: Pertahanan parsial untuk serangan UCSB

source: Add announce list support to i2psnark
es: Se ha añadido suporte para lista de anuncios en i2psnark
id: Menambahkan dukungan daftar pengumuman untuk i2psnark

source: Jetty: upgrade Apache Tomcat to 6.0.36
es: Jetty: actualización a Apache Tomcat versión 6.0.36
id: Jetty: upgrade Apache Tomcat ke 6.0.36

source: Split router info files into multiple subdirectories
es: Se dividen los archivos de información del ruter en varios subdirectorios.
id: Memisahkan file router info ke dalam beberapa subdirektori

source: Add IP to hostname mapping option in SOCKS
es: Se añade la IP a la opción hostname en SOCKS
id: Menambahkan IP ke opsi pemetaan hostname dalam SOCKS

source: Improve PRNG seeding
es: Mejora en el sembrado de PRNG
id: Meningkatkan seeding PRNG

source: Translation updates: French, German, Hungarian, Italian, Norwegian, Polish, Portuguese, Russian, Swedish
es: Actualización de las traducciones: Francés, alemán, húngaro, italiano, noruego, polaco, portugués, ruso y sueco.
id: Pembaruan terjemahan: Perancis, Jerman, Hungaria, Italia, Norwegia, Polandia, Portugis, Rusia, Swedia

source: Update wrapper to 3.5.17 (new installs and PPA only)
es: Actualizado el wrapper a 3.5.17 (sólo para instalaciones nuevas y PPA)
id: Update wrapper ke 3.5.17 (hanya untuk install baru dan PPA)

source: 0.9.6 Release
es: Versión 0.9.6
id: 0.9.6 Rilis

source: 0.9.6 includes bug fixes and an update from Jetty 6.1.26 (2010-11-10) to Jetty 7.6.10 (2013-03-12). See below for important information on the Jetty update. The Jetty 7 series is actively maintained and we plan to stay current with it in future I2P releases.
es: La versión 0.9.6 incluye varios arreglos y una actualización de Jetty 6.1.26 (2010-11-10) a Jetty 7.6.10 (2013-03-12). Vea más abajo para ver información importante sobre esta actualización de Jetty. Las versiones 7 de Jetty se desarrollan activamente y planeamos mantenerlas actualizadas con las versiones futuras de I2P.
id: 0.9.6 mencakup perbaikan bug dan update dari Jetty 6.1.26 (2010-11-10) ke Jetty 7.6.10 (2013-03-12). Lihat di bawah untuk informasi penting pada Jetty update. Seri Jetty 7 dijaga secara aktif dan kami berencana untuk tetap menggunakannya di rilis I2P di masa depan.

source: Most users will update via HTTP. Those running development builds will attempt to update via the experimental in-network bittorrent with i2psnark. We've fixed some bugs that will enable more users to update via torrent in the 0.9.7 update cycle.
es: La mayoría de los usuarios se actualizarán por HTTP. Aqueyos que utilicen versiones en desarrollo intentarán actualizarse a través del método experimental bittorrent con i2psnark. Arreglamos alguno errores que premitirán que más usuarios puedan actualizarse via torrent en las versiones 0.9.7.
id: Kebanyakan pengguna akan memperbarui melalui HTTP. Orang-orang yang menjalankan development build akan berusaha memperbarui melalui bittorrent di jaringan eksperimental dengan i2psnark. Kami telah memperbaiki beberapa bug yang akan memungkinkan lebih banyak pengguna untuk memperbarui via torrent di siklus update versi 0.9.7.

source: Important fix for Windows Eepsites, first install 0.9.5 only
es: Arreglo importante para las eepsites en Windows, sólo para primeras instalaciones de 0.9.5
id: Perbaikan penting untuk Eepsites Windows, pertama-tama Instal hanya 0.9.5

source: If you first installed I2P with version 0.9.5, on Windows only, we recommend that you follow the following instructions to fix your eepsite location **before** you update to 0.9.6. Only original installations of 0.9.5-0 on Windows are affected by this issue. If your router version is 0.9.5-0-win1, you already have the fix and need not take any action.
es: Si instaló por primera vez I2P con la versión 0.9.5, sólo en Windows, recomendamos que siga las instrucciones para arreglar la localización de su eepsite **antes** de actualizar a 0.9.6. Sólo las instalaciones originales de 0.9.5-0 en Windows están afectadas por este error. Si su versión del ruter es 0.9.5-0-win1, ya tiene el problema solucionado y no necesita hacer nada.
id: Jika Anda pertama kali menginstal I2P dengan versi 0.9.5, di Windows hanya, kami menyarankan Anda untuk mengikuti petunjuk berikut untuk memperbaiki lokasi eepsite ** sebelum ** Anda memperbarui ke 0.9.6. Hanya instalasi asli 0.9.5-0 pada Windows yang terpengaruh oleh masalah ini. Jika versi router Anda 0.9.5-0-win1, Anda sudah memiliki perbaikan ini dan tidak perlu mengambil tindakan apapun.

source: Jetty 7 Migration Details
es: Detalles de la migración a Jetty 7
id: RIncian Migrasi Jetty 7

source: For most people, the update should just work. If you have multiple Jetty eepsites, OR have made changes to jetty.xml or other Jetty configuration files, including changing the port from 7658, you MUST take manual action AFTER updating.
es: Para la mayoría la actualización debería funcionar sin más. Si tiene varias webs Jetty, O hizo cambios en jetty.xml u otros archivos de configuración de Jetty, incluyendo el cambio de puerto desde 7658, TIENE que hacer cambios manualmente DESPUÉS de actualizar.
id: Bagi kebanyakan orang, update ini seharusnya berhasil. Jika Anda memiliki beberapa eepsite Jetty, ATAU telah membuat perubahan jetty.xml atau file konfigurasi Jetty lainnya, yang termasuk mengubah port dari 7658, Anda HARUS mengambil tindakan manual SETELAH melakukan pembaruan.

source: After update, the router will migrate your jetty.xml files to the new Jetty 7 format.
es: Después de la actualización, el ruter migrará sus archivos jetty.xml al nuevo formato de Jetty 7.
id: Setelah melakukan pembaruan, router akan memigrasi file jetty.xml Anda ke format Jetty 7 baru.

source: The migration resets the port to 7658. If you have more than one Jetty eepsite, OR your eepsite is NOT on port 7658, OR you have made other modifications to jetty.xml (for example changing the listen address from 127.0.0.1 to 0.0.0.0), you MUST edit the jetty.xml file for each eepsite to fix them up after updating, and restart again.
es: Al migrar se reajusta el puerto al 7658. Si tiene más de una eepsite Jetty, O su eepsite NO está en el puerto 7658, O hizo otras modificaciones en el archivo jetty.xml (por ejemplo cambiando la dirección de 127.0.0.1 a 0.0.0.0), TIENE que editar el archivo jetty.xml después de actualizar, y reiniciar de nuevo.
id: Migrasi me-reset port ke 7658. Jika Anda memiliki lebih dari satu eepsite Jetty, ATAU eepsite Anda BUKAN pada port 7658, ATAU Anda telah membuat modifikasi lain untuk jetty.xml (misalnya mengubah alamat dengar dari 127.0.0.1 ke 0.0.0.0), Anda harus mengedit file jetty.xml untuk setiap eepsite untuk memperbaiki mereka setelah memperbarui, dan restart lagi.

source: **The following files will be backed up with a &quot;.jetty6&quot; suffix and then migrated.** If you have made local changes, you may have to edit them manually and restart. See http://wiki.eclipse.org/Jetty for assistance in configuring Jetty 7.
es: **Se hará una copia de seguridad de los siguientes archivos con un sufijo &quot;.jetty6&quot; y entonces será migrado** SI ha hecho cambio locales, debería editarlos manualmente y reiniciar. Vea http://wiki.eclipse.org/Jetty para ver como confisurar Jetty 7.
id: ** File-file berikut akan di-backup dengan akhiran ".jetty6" dan kemudian dimigrasi.** jika Anda telah membuat perubahan lokal, Anda mungkin harus mengedit mereka secara manual lalu melakukan restart. Lihat http://wiki.eclipse.org/Jetty untuk bantuan dalam konfigurasi Jetty 7.

source: Plugins
es: Complementos
id: Plugin

source: Most plugins should work fine with Jetty 7.
es: La mayoría de los pluguins deberían funcionar sin problemas con Jetty 7.
id: Kebanyakan plugin seharusnya berfungsi dengan baik dengan Jetty 7.

source: The I2PControl and zzzot plugins must be updated. Your router should download and install the new versions shortly after starting 0.9.6.
es: Los pluguins I2PCOntrol y zzzot tienen que actualizarse. Su ruter debería descargar e instalar las nuevas versiones nada más arrancar la versión 0.9.6.
id: Plugin I2PControl dan zzzot harus diperbarui. Router Anda seharusnya mengunduh dan menginstal versi baru segera setelah memulai 0.9.6.

source: If a plugin does not work, please contact the maintainer for that plugin.
es: Su algún pluguin no funciona, por favor pongase en contacto con el desarrollador de ese pluguin.
id: Jika plugin tidak berfungsi, hubungi pengelola plugin itu.

source: Several bugs with Windows installation (see above)
es: Varioes errores con la instalación de Windows (vea más arriba)
id: Beberapa bug di instalasi Windows (lihat di atas)

source: Fix default form action in i2ptunnel
es: Arreglado el formulario de acción por defecto en i2ptunnel
id: Memperbaiki form action default di i2ptunnel

source: Fix links on iframed console pages
es: Arreglados los enlaces en las webs de la consola
id: Memperbaiki tautan di halaman konsol iframed

source: Better detection of 64-bit Windows to prevent crashes by systray
es: Mejor detección de Windows 64-bits para prevenir las caidas de la bandeja de sistema
id: Deteksi Windows 64-bit yang lebih baik untuk mencegah crash oleh systray

source: Fix bug preventing router update via torrent
es: Arreglado el error que evitaba poder actualizar el router por torrent.
id: Memperbaiki bug yang mencegah update router via torrent

source: Several SSU fixes for NATs that change UDP ports
es: Varias arreglos en SSU para las NATs que cambian sus puertos UDP
id: Beberapa perbaikan SSU untuk NAT yang mengubah port UDP

source: Ignore unsupported IPs in RouterInfos when selecting an address (prep for IPv6)
es: IPs no soportadas son ignoradas cuando se selecciona una dirección (preparado para IPv6)
id: Mengabaikan IP yang tidak didukung di RouterInfos saat memilih alamat (persiapan untuk IPv6)

source: Ignore unused option bits in Database Lookup Message (prep for requesting encrypted response)
es: Se ignoran las opciones no usadas en los Mensajes de Búsqueda en la Base de Datos (preparado para solicitar respuestas cifradas)
id: Mengabaikan opsi bit yang tidak terpakai di Database Lookup Message (persiapan untuk meminta tanggapan terenkripsi)

source: Fix HTTP proxy error response for malformed URIs
es: Arreglada la respuesta de error del proxy HTTP para URIs malformadas
id: Memperbaiki respons kesalahan proxy HTTP untuk URI yang salah

source: Recognize UPnP devices without port forwarding capability
es: Reconocimiento de dispositivos UPnP sin el reenvío de puertos habilitado.
id: Mengenali perangkat UPnP yang tidak memiliki kemampuan port forwarding

source: Jetty 7.6.10 (see above for migration information)
es: Jetty 7.6.10 (vea más arriba para la migración)
id: Jetty 7.6.10 (lihat di atas untuk informasi migrasi)

source: Limit page size in i2psnark
es: Se limita el tamaño de página en i2psnark
id: Membatasi ukuran halaman di i2psnark

source: Add data directory and page size configuration to i2psnark
es: Se añaden información de directorio y tamaño de página en la configuración de i2psnark.
id: Menambahkan direktori data dan konfigurasi ukuran halaman ke i2psnark

source: Support multiple i2psnark instances
es: Soporte para múltiple instancias de i2psnark
id: Mendukung beberapa instance dari i2psnark

source: Piece size adjustments in i2psnark
es: Ajuste del tamaño de los trozos del torrent en i2psnark
id: Penyesuaian ukuran potongan di i2psnark

source: Add more graphing support for combined bandwidth graph
es: Añade más soporte gráfico para la gráfica del ancho de banda combinado
id: Menambahkan lebih banyak dukungan untuk grafik bandwith gabungan

source: Block b32.i2p supercookies
es: Bloque de las supercookies b32.i2p
id: Blokir b32.i2p supercookies

source: Allow stopping clients on /configclients
es: Se permite para los clientes en /configclients
id: Perbolehkan menghentikan klien di /configclients

source: Check for nonce count replays in HTTP client
es: Comprobar el número de respuestas nonce en el cliente HTTP
id: Memeriksa replay nonce count di klien HTTP

source: Support SASL authentication in IRC proxy
es: Soporte de la autenticación SASL en el proxy IRC
id: Mendukung otentikasi SASL di proxy IRC

source: Several cleanups and minor fixes in the update manager
es: Varias mejoras y arreglos menores en al administrador de actualizaciones
id: Beberapa hal dibereskan dan perbaikan kecil di update manager

source: Translation updates: German, Portuguese, Russian, Spanish, and Swedish
es: Traducciones actualizadas: alemán, portugués, ruso, español, y sueco
id: Pembaruan terjemahan: Jerman, Portugis, Rusia, Spanyol dan Swedia

source: 0.9.7 Release
es: Versión 0.9.7
id: 0.9.7 Rilis

source: 0.9.7 includes significant bug fixes and improvements.
es: 0.9.7 Contiene significantes mejoras y arreglos de errores
id: 0.9.7 termasuk perbaikan bug signifikan dan peningkatan kinerja.

source: For the first time, class 'N' routers (those with a minimumum of 128 KBytes/sec of shared bandwidth) will automatically become floodfill (previously it was only 'O' routers with 256 KBps). This will increase the floodfill population for additional resistance to certain attacks (see below). Floodfill routers don't consume much additional bandwidth, but they do tend to use additional memory and concurrent connections. If you do not wish your router to become floodfill, set the advanced configuration router.floodfillParticipant=false .
es: Por primera vez, los ruters de clase 'N' (aquellos con un mínimo de 128 KBytes/sec de ancho de banda compartido)class="marksource newline" title="New line"> se convertirán automáticamente en floodfills (anteriormente eran sólo las ruters 'O' con 256 KBps). Esto incrementaráclass="marksource newline" title="New line"> el número de floodfills para aumentar la resistencia ciertos ataques (ver más abajo). Los ruters Floodfill noclass="marksource newline" title="New line"> consumen mucho más ancho de banda, pero tieneden a utilizar más memoria y conexionesclass="marksource newline" title="New line" concurrentes. Si no desea que su ruter funcione como un Floodfill, cambie en la configuración avanzadaclass="marksource newline" title="New line"> a router.floodfillParticipant=false .
id: Untuk pertama kalinya, router kelas 'N' (yang memiliki minimum 128 KByte/sec shared bandwidth) secara otomatis akan menjadi floodfill (sebelumnya itu hanya router kelas 'O' dengan 256 KBps). Ini akan meningkatkan populasi floodfill untuk tambahan perlawanan terhadap serangan tertentu (lihat bawah). Router floodfill tidak menggunakan bandwidth tambahan, tetapi mereka cenderung untuk menggunakan memori dan sambungan tambahan. Jika Anda tidak ingin router Anda menjadi floodfill, setel pengaturan lebih lanjut menjadi router.floodfillParticipant=false .

source: As we think the last release fixed the experimental update-via-torrent bugs, 3%(pc)s of routers should update over in-network bittorrent this cycle.
es: Como pensamos que la anterior versión solucionó los fallos de la actualización-vía-torrent experimental, el 3%(pc)s de los routers I2P debería actualizarse mediante el bittorrent interno-a-la-red en esta actualización.
id: Karena rilis terakhir memperbaiki bug update eksperimental melalui torrent, 3%(pc)s dari router seharusnya memperbarui atas melalui jaringan bittorrent di siklus ini.

source: Plugin update checks, possibly broken for several releases, are fixed. Your plugins should once again auto-update after updating the router.
es: Arreglado la comprobación de actualizaciones de los pluguins, probablemente roto en varias versiones. Sus pluguins deberían auto actualizarse después de actualizar el ruter.
id: Pemeriksaan update plugin, yang mungkin rusak di beberapa rilis, sudah diperbaiki. Plugin Anda seharusnya kembali melakukan auto-update setelah memperbarui router.

source: We fixed a major streaming timer bug that contributed to frequent IRC disconnects.
es: Arreglamos un error mayor que hacía que el IRC tuviese desconexiones frecuentes.
id: Kami memperbaiki bug besar di streaming timer yang berkontribusi sering terputusnya IRC.

source: Anonymity Improvements
es: MEjoras en el anonimato.
id: Peningkatan Anonimitas

source: End-to-end encryption of responses to leaseset lookups
es: Cifrado de fin a fin de las respuestas a las búsquedas leaseset.
id: Respons enkripsi end-to-end untuk pencarian leaseset

source: Expand floodfill pool by enabling class 'N' floodfills
es: Aumento del número de floodfills activando los ruters clase 'N' como floosfills.
id: Memperluas floodfill dengan mengaktifkan floodfills kelas 'N'

source: Randomize padding inside encrypted SSU packets
es: RElleno aleatorio dentro de los paquetes cifrados SSU
id: Mengacak padding di dalam paket SSU terenkripsi

source: Preparation for better SSU protocol obfuscation
es: Preparación para la mejora del ocultamiento del protocolo SSU
id: Persiapan untuk yang SSU protocol obfuscation lebih baik

source: Fix newer lease sets not getting stored or published
es: Arreglo de los nuevos leasesets no almacenados o publicados
id: Memperbaiki leaseset baru yang tidak dapat didisimpan atau diterbitkan

source: Fix classpath bug when used with 4-year-old installations, causing the console not to start
es: Arreglado el error classpath cuando se usaban instlaciones de más de 4 años, provocando que la consola no iniciase.
id: Memperbaiki bug classpath ketika digunakan instalasi berumur 4 tahun, yang menyebabkan console tidak dapat dijalankan

source: Fix addressbook database bug preventing update of the reverse index
es: Arreglado el problema de la base de datos que evitaba las actualizaciones del índice reverso.
id: Memperbaiki bug database addressbook yang mencegah pembaruan reverse index

source: Fix i2psnark bug that changed the infohash of torrents created by Robert and fetched via magnet link
es: Arreglado el error de i2psnark que cambiaba el infohash de los torrents creados por Robert y descargados a traves de enlaces magnet.
id: Memperbaiki bug i2psnark yang mengubah infohash torrents yang diciptakan oleh Robert dan diambil melalui magnet link

source: Fix version checking for plugins
es: Arreglada la comprobación de versión de los pluguins
id: Memperbaiki versi memeriksa plugin

source: Fix a streaming timer bug causing frequent IRC disconnects (also affects other close-on-idle tunnels)
es: Arreglado el error que causaba desconexiones frecuentes en el IRC (también afectaba a otros tipos de túeneles)
id: Memperbaiki bug timer streaming yang menyebabkan IRC sering terputus (juga mempengaruhi tunnel tutup-saat-menganggur)

source: Don't install as a service on Windows by default
es: En Windows no lo instale por defecto como un servicio
id: Jangan Instal sebagai service pada Windows secara default

source: Reduce transport idle timeouts
es: Reducido los tiempos de reposo de transporte
id: Mengurangi timeout transportast idle

source: Reduce tunnels on idle in i2psnark
es: Reducción de túneles en i2psnark en reposo
id: Mengurangi tunnel on idle dalam i2psnark

source: Change default in i2ptunnel GUI to 3 hops
es: Cambiado a 3 saltos por defecto en la configuración de i2ptunnel
id: Mengubah GUI default di i2ptunnel untuk 3 hop

source: IE 10 support
es: Soporte para IE 10
id: Dukungan IE 10

source: Individual expiration times in leases, for efficiency on destinations with a high number of tunnels
es: Tiempos de vencimiento individuales para los leases, para mejorar la eficiencia en los destinos cuando hay un gran número de túneles.
id: Waktu kedaluwarsa per individu di lease, untuk efisiensi pada destinasi dengan jumlah tunnel yang tinggi

source: Low-level encryption and XOR speedups
es: Mejora de la velocidad en cifrados de najo nivel y XOR
id: Enkripsi tingkat rendah dan XOR speedups

source: Translation updates: Chinese, French, German, Portuguese, Russian, Spanish
es: Actualización de traducciones: chino, francés, alemán, portugués, ruso, y español
id: Pembaruan terjemahan: Mandarin, Perancis, Jerman, Portugis, Rusia, Spanyol

source: New Turkish translation
es: Nueva traducción al Turco
id: Terjemahan baru untuk bahasa Turki

source: Wrapper 3.5.19 (new installs and PPA only)
es: Wrapper 3.5.19 (sólo en las instalaciones nuevas y en PPA)
id: Wrapper 3.5.19 (hanya untuk instalasi baru dan PPA)

source: 0.9.7.1 Release
es: Versión 0.9.7.1
id: 0.9.7.1 Rilis
