Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Add preliminary support for ECDSA-signed Destinations
es: Añade soporte preliminar para destinos firmados-con-ECDSA
id: Menambahkan dukungan awal untuk destinasi ECDSA-signed.

source: Add check for replayed NTCP session requests
es: Añade comprobación para peticiones de sesión NTCP reenviadas
id: Menambah pemeriksaan untuk permintaan replayed NTCP session

source: Add throttling and blocking checks to streaming ping processing
es: Añade comprobaciones de saturación y bloqueo para el procesado del ping del transporte streaming
id: Menambah pemeriksaan throttling dan blocking ke dalam proses streaming ping

source: Fix RouterInfo exchange in NTCP
es: Repara el intercambio de RouterInfo en NTCP
id: Memperbaiki RouterInfo exchange di NTCP

source: Extend timeout for Delivery Status Messages
es: Extiende la expiración para los mensajes de estado de entrega
id: Memperpanjang timeout untuk Delivery Status Messages

source: Drop streaming messages from recently closed connections
es: Descarta mensajes del transporte streaming desde conexiones cerradas recientemente
id: Menghapus streaming messages dari koneksi yang terakhir ditutup

source: Fix restarts on Raspberry Pi
es: Repara reinicios en Rapsberry Pi
id: Memperbaiki masalah restart di Raspberry Pi

source: Restore profileOrganizer.sameCountryBonus advanced config
es: Restaura la configuración avanzada de profileOrganizer.sameCountryBonus
id: Mengembalikan profileOrganizer.sameCountryBonus advanced config

source: Fix for jwebcache and i2phex
es: Reparación para jwebcache y i2phex
id: Perbaikan untuk jwebcache dan i2phex

source: Jetty 8.1.14.v20131031; Java 6 now required
es: Jetty 8.1.14.v20131031; Java 6 es ahora requerido
id: Jetty 8.1.14.v20131031; Java 6 sekarang diperlukan

source: Reduce target connection count again to reduce tunnel reject rate further
es: Reduce el recuento de la conexión objetivo para recudir el ratio de rechazos de túneles aún más
id: Mengurangi lagi jumlah target koneksi untuk lebih banyak mengurangi jumlah penolakan tunnel

source: Add rate limit for outbound connections at tunnel endpoints
es: Añade límite de velocidad para conexiones de salida hacia extremos de túneles
id: Menambah batasan jumlah untuk outbound connections di tunnel endpoints

source: Add optional inproxy blocking in i2ptunnel
es: Añade bloqueo opcional de proxy entrante en i2ptunnel
id: Menambah halangan opsional inproxy di i2ptunnel

source: Use SSU session key for relay request/response when available
es: Cuando esté disponible usa la clave de sesión SSU para el repetido de las peticiones/respuestas
id: Menggunakan SSU session key untuk relay permintaan/respon bila tersedia

source: Include HTTP POST data in SYN packet
es: Incluye datos HTTP POST en el paquete SYN
id: Menambah data HTTP POST ke dalam paket SYN

source: Add getopt library for better argument processing
es: Añade la librería getopt para un mejor procesado de argumentos
id: Menambah getopt library untuk argument processing lebih baik

source: More removal of Jetty dependencies
es: Más supresiones de dependencias de Jetty
id: Penghapusan lebih banyak di dependensi Jetty

source: Remove MD5 code, use Java libraries instead
es: Elimina el código MD5, usa las librerías Java en su lugar
id: Menghapus kode MD5, dan menggunakan Java libraries untuk seterusnya

source: Change the default addressbook subscription URL
es: Cambia la URL de suscripción a la libreta de direcciones predeterminada
id: Mengubah URL default addressbook subscription

source: ============== 0.9.13 Release ==============
es: ============== Versión 0.9.13 ==============
id: ============== Rilis 0.9.13 ==============

source: 0.9.13 with SusiMail improvements and fixes for firewalled routers
es: 0.9.13 con mejoras para Susimail y reparaciones para routers bloqueados por cortafuegos (firewall)
id: 0.9.13 dengan perbaikan SusiMail dan router dengan firewall

source: 0.9.13 includes fixes for firewalled routers, netdb lookup improvements, and a big SusiMail update. Of course, there's also the usual collection of bug fixes and translation updates.
es: 0.9.13 incluye reparaciones para routers bloqueados por cortafuegos, mejoras en la búsqueda sobre netdb, y una gran actualización de Susimail. Por supuesto, también está la habitual colección de reparaciones de fallos y actualizaciones de traducción.
id: 0.9.13 memasukkan perbaikan untuk router dengan firewalled, peningkatan netdb lookup, dan pembaruan besar di SusiMail. Tentu saja, ada pembaruan rutin dari perbaikan bug dan pembaruan terjemahan.

source: zzz has updated his GPG keys, and the release files are signed with his new keys. His new key fingerprint is:
es: zzz ha actualizado sus claves GPG, y los archivos de la versión están firmados con sus nuevas claves. Su nueva huella de validación (fingerprint) de clave es:
id: zzz memperbarui GPG keys miliknya, dan file rilis ditandatangani dengan keys baru tersebut. Key fingerprint yang baru adalah:

source: Many UI improvements
es: Muchas mejoras de la interfaz de usuario (UI)
id: Banyak peningkatan UI

source: Implement local storage of messages
es: Implementa el almacenamiento local de mensajes
id: Penerapan penyimpanan lokal untuk pesan-pesan

source: Add offline mode
es: Añade modo desconectado
id: Menambah modus offline

source: Messages now deleted on server after download
es: Los mensajes ahora son borrados en el servidor después de descargarse
id: Pesan sekarang dihapus di server setelah diunduh

source: Several backend POP3 and SMTP speedups and fixes
es: Varias agilizaciones y reparaciones de los mecanismos POP3 y SMTP
id: Beberapa peningkatan kecepatan dan perbaikan di backend POP3 dan SMTP

source: NetDB lookup fixes
es: Reparaciones de la búsqueda en NetDB
id: perbaikan NetDB lookup

source: Fix transition from not-firewalled to firewalled
es: Repara la transición desde sin-cortafuegos a tras-cortafuegos
id: Memperbaiki transisi dari tidak-firewall menjadi firewall

source: Fix plugin uninstall on Windows
es: Repara la desinstalación de complementos en Windows
id: Memperbaiki plugin uninstall di Windows

source: SSU locking fixes
es: Reparaciones del bloqueo de SSU (UDP Seguro Semiconfiable)
id: perbaikan penguncian SSU

source: Fix rapid republishing of SSU addresses
es: Reparación del republicado rápido de direcciones SSU
id: Memperbaiki cepat republishing alamat SSU

source: IRC client exception fixes
es: Reparaciones de excepciones de cliente de IRC
id: Memperbaiki IRC client exeptions

source: Fix changing HTTP outproxy configuration without restarting tunnel
es: Reparación al cambiar la configuración de proxy de salida HTTP sin reiniciar el túnel
id: Memperbaiki pengubahan konfigurasi HTTP outproxy tanpa melakukan restart tunnel

source: New i2ptunnel server option for unique local address per-client
es: Nueva opción de servidor I2PTunnel para una dirección local única por-cliente
id: Opsi i2ptunnel server baru untuk alamat lokal yang unik per klien

source: Warn in i2ptunnel on duplicate client ports
es: Alerta en I2PTunnel por puertos de cliente duplicados
id: Peringatan di i2ptunnel pada client port yang duplikat

source: Update HTTP User-Agent to match TBB
es: Actualiza el agente de usuario HTTP para coincidir con el del TBB (Paquete de Navegador Tor)
id: Memperbarui HTTP User-Agent untuk cocok dengan TBB

source: Extend SSU establishment retransmission timer
es: Extiende el tiempo límite de retransmisión del establecimiento SSU
id: Memperpanjang timer dari SSU establishment retransmission

source: Use constant-time method for HMAC verification
es: Usa un método de tiempo-constante para la verificación HMAC (Codigo de Autentificación de Mensaje criptográficamente resumido (hashed))
id: Menggunakan metode konstan-waktu untuk verifikasi HMAC

source: New translation: Slovak
es: Nueva traducción: eslovaco
id: Terjemahan baru: Slovak

source: ============== 0.9.14 Release ==============
es: ============== Versión 0.9.14 ==============
id: ============== Rilis 0.9.14 ==============

source: 0.9.14 includes critical security fixes
es: 0.9.14 incluye reparaciones críticas de seguridad
id: 0.9.14 mencakup perbaikan kritis untuk keamanan

source: 0.9.14 includes critical fixes for XSS and remote execution vulnerabilities reported by Exodus Intelligence. As an added precaution, we have disabled several advanced configuration features in the router console, including installation of new plugins. We plan to re-enable these in a future release after additional review.
es: 0.9.14 incluye reparaciones críticas de seguridad para XSS y vulnerabilidades de ejecución remota reveladas por Exodus Intelligence. Como precaución añadida, hemos deshabilitado varias características de configuración avanzadas en la consola del router, incluyendo la instalación de nuevos complementos (plugins). Planeamos volver a habilitar estas características en una futura versión después de revisión adicional.
id: 0.9.14 mencakup perbaikan kritis untuk XSS dan kerentanan remote execution yang dilaporkan oleh Exodus Intelligence. Sebagai tindakan pencegahan tambahan, kami telah menonaktifkan beberapa fitur konfigurasi lanjutan di console router, termasuk instalasi plugin baru.Sebagai tindakan pencegahan tambahan, kami telah menonaktifkan beberapa fitur konfigurasi lanjutan di console router, termasuk instalasi plugin baru. Kami berencana untuk kembali mengaktifkan ini dalam rilis masa depan setelah tambahan review.

source: Due to I2P library changes, I2P-Bote users must upgrade their plugin to version 0.2.10 to work with I2P 0.9.14. Your router should update the plugin automatically after the router restarts.
es: Debido a cambios en la librería I2P, los usuarios de I2P-Bote tienen que actualizar su complemento a la versión 0.2.10 para que funcione con I2P 0.9.14. Después de reiniciarse, su router debería actualizar automáticamente el complemento.
id: Karena perubahan library I2P, pengguna I2P-Bote harus memperbarui plugin mereka ke versi 0.2.10 untuk berfungsi di I2P 0.9.14. Router Anda seharusnya memperbarui plugin secara otomatis setelah restart router.

source: The release also contains several bug fixes in i2ptunnel, i2psnark, and other areas, and updates to the latest Jetty, Tomcat, and Wrapper. We've also implemented a faster and more secure method for reseeding. Of course, there's also the usual collection of minor bug fixes and translation updates.
es: La versión también contiene varias reparaciones de fallos en i2ptunnel, i2psnark, y otras áreas, y actualizaciones a los últimos Jetty, Tomcat, y Wrapper. También hemos implementado una método más rápido y seguro para el resembrado. Por supuesto, también está la colección habitual de reparaciones de fallos menores y actualizaciones de traducción.
id: Rilis ini juga berisi beberapa perbaikan bug di i2ptunnel, i2psnark, dan tempat lain, dan pembaruan terbaru Jetty, Tomcat, dan Wrapper. Kami juga telah menerapkan metode yang lebih cepat dan lebih aman untuk reseeding. Tentu saja, ada juga koleksi biasa di perbaikan bug minor dan pembaruan terjemahan.

source: You must update to this release immediately. The best way to maintain security and help the network is to run the latest release.
es: Tiene que actualizar a esta versión inmediatamente. La mejor manera de mantener la seguridad y ayudar a la red es ejecutar la última versión.
id: Anda harus segera memperbarui ke rilis ini. Cara terbaik untuk mengelola keamanan dan bantuan pada jaringan adalah dengan menjalankan rilis terbaru.

source: Security Fixes
es: Reparaciones de seguridad
id: Perbaikan Keamanan

source: Fix several XSS issues
es: Reparavarios problemas de XSS
id: Memperbaiki beberapa masalah XSS

source: Disable changing news feed URL from UI
es: Deshabilitar el cambio de la URL de subscripción (feed) de noticias desde la interfaz de usuario (UI)
id: Menonaktifkan perubahan URL feed berita dari UI

source: Disable plugin install
es: Deshabilita la instalación de complementos
id: Menonaktifkan instalasi plugin

source: Disable setting unsigned update URL from UI
es: Deshabilita la configuración de una URL de actualización no firmada desde la interfaz de usuario
id: Nonaktifkan pengaturan unsigned update URL dari UI

source: Disable clients.config editing from the UI
es: Deshabilita la edición de clients.config desde la interfaz de usuario
id: Menonaktifkan edit clients.config dari UI

source: Add Content-Security-Policy and X-XSS-Protection headers
es: Añade las cabeceras HTTP Content-Security-Policy y X-XSS-Protection
id: Tambahkan header Content-Security-Policy dan X-XSS-Protection

source: Disable unused ExecNamingService (thx joernchen of Phenoelit)
es: Deshabilita ExecNamingService sin uso (gracias a joernchen de Phenoelit)
id: Menonaktifkan ExecNamingService yang tidak terpakai (terima kasih untuk joernchen of Phenoelit)

source: Fix tunnel building so it doesn't get "stuck" on a single pool
es: Repara la construcción de túnel para que no se quede "estancada" en un sólo depósito (pool)
id: Memperbaiki pembangunan tunnel sehingga itu tidak "terjebak" pada satu pool

source: Reject participating tunnels when hidden
es: Rechaza los túneles participantes cuando esté oculto
id: Menolak participating tunnels ketika hidden

source: Several i2psnark improvements and fixes (GUI and DHT), including changes for better compatibility with Vuze
es: Varias mejoras de i2psnark y repara (GUI y DHT), incluyendo cambios para una mejor compatibilidad con Vuze
id: Beberapa peningkatan dan perbaikan i2psnark (GUI dan DHT), termasuk perubahan untuk kompatibilitas yang lebih baik dengan Vuze

source: Reseeding now fetches a signed zip file containing router infos for security and speed
es: Resembrado (reseeding) ahora descarga un fichero zip firmado que contiene las informaciones para seguridad y velocidad del router
id: Reseeding sekarang mengambil file zip ditandatangani yang mengandung router infos untuk keamanan dan kecepatan

source: Use JVM's AES implementation if it is faster
es: Usa la implementación AES de la maquina virtual de Java (JVM) si es más rápida
id: Menggunakan implementasi JVM's AES jika itu lebih cepat

source: More advanced options shown in the i2ptunnel edit pages
es: Más opciones avanzadas mostradas en las páginas de edición de i2ptunnel
id: Opsi lanjutan ditunjukkan di dalam halaman edit i2ptunnel

source: Per-message reliabilitiy settings in I2CP and error propagation back from router to client
es: Configuraciones de fiabilidad por-mensaje en I2CP, y de propagación de errores de vuelta desde el router I2P al cliente.
id: Penaturan reliabilitas per-pesan di dalam I2CP dan error propagation kembali dari router ke klien

source: Lots of findbugs fixes and cleanups
es: Muchas reparaciones de fallos FindBugs y aseamientos
id: Banyak perbaikan dan pembersihan findbugs

source: Support signature types in SAM, bump rev to 3.1
es: Soporta los tipos de firmas en SAM, salta de revisión hasta la 3.1
id: Mendukung jenis signature di SAM, meningkatkan rev menjadi 3.1

source: New event log page in console
es: Nueva página de registro (log) de eventos en la consola
id: Halaman log event baru di console

source: Wrapper 3.5.25 (new installs and PPA only)
es: Wrapper 3.5.25 (sólo nuevas instalaciones y archivos PPA)
id: Wrapper 3.5.25 (hanya untuk instalasi baru dan PPA)

source: ================ 0.9.14.1 Release ================
es: ================ Versión 0.9.14.1 ================
id: ============== Rilis 0.9.14.1 ==============

source: 0.9.14.1 includes i2psnark and console fixes
es: 0.9.14.1 incluye i2psnark y reparaciones de consola
id: 0.9.14.1 mencakup perbaikan i2psnark dan console

source: 0.9.14.1 includes fixes for the "Add Torrent" form in i2psnark and some other web forms. We've restored the ability to install plugins via the console, but you must first edit your router.config file (in ~/.i2p/ or /var/lib/i2p/i2p-config/ or %APPDATA%\I2P\) to add the line routerconsole.enablePluginInstall=true. Other rarely-used advanced features that were removed in 0.9.14 may be restored by adding the line routerconsole.advanced=true.
es: 0.9.14.1 incluye reparaciones para el formulario "Añadir Torrent" en i2psnark, y algunos otros formularios web. Hemos recuperado la capacidad de instalar complementos (plugins) a través de la consola, pero primero tiene que editar su fichero router.config (en ~/.i2p/ o /var/lib/i2p/i2p-config/ o %APPDATA%\I2P\) para añadir la línea: routerconsole.enablePluginInstall=true Otras características avanzadas raramente-usadas que fueron eliminadas en 0.9.14 pueden ser recuperadas añadiendo la línea: routerconsole.advanced=true
id: 0.9.14.1 mencakup perbaikan untuk formulir "Add Torrent" di i2psnark dan beberapa formulir web lainnya. Kami telah memulihkan kemampuan untuk menginstal plugin melalui console, namun Anda harus terlebih dahulu mengedit file router.config Anda (di ~/.i2p/ atau /var/lib/i2p/i2p-config/ atau %APPDATA%\I2P\) lalu tambahkan baris routerconsole.enablePluginInstall=true. Fitur canggih lain yang jarang digunakan yang telah dihapus di 0.9.14 dapat dipulihkan dengan menambahkan perintah routerconsole.advanced=true.

source: As usual, if configured with the default "Download and Verify", the router will automatically download the update and display a button to restart. However, due to a bug in 0.9.14, if your update is configured for "Notify only", the download button will not be displayed. You must change your configuration to "Download and Verify" or "Download, Verify, and Restart" to update.
es: Como es habitual, si está configurado el predeterminado "Descargar y verificar", el router I2P automáticamente descargará la actualización y mostrará un botón para reiniciar. Sin embargo, debido a un fallo en 0.9.14, si su actualización está configurada para "Sólo notificar", el botón de descarga no se mostrará. Tiene que cambiar su configuración a "Descagar y verificar" o "Descagar, verificar, y reiniciar" para actualizar.
id: Seperti biasa, jika dikonfigurasi dengan default "Download and Verify", router akan mendownload update secara otomatis dan menampilkan tombol untuk restart. Namun, karena bug di 0.9.14, jika pembaruan Anda dikonfigurasi untuk "Hanya pemberitahuan", tombol unduhan tidak akan ditampilkan. Anda harus mengubah konfigurasi Anda menjadi "Download and Verify" atau "Download, Verify, and Restart" untuk memperbarui.

source: If you are still running 0.9.13 or older, we recommend that you update to this release as soon as possible. If you don't often check your router console, please consider changing your configuration to "Download, Verify, and Restart" to ensure you are always running the latest release.
es: Si aún está ejecutando la versión 0.9.13 o anterior, le recomendamos que actualice a esta versión tan pronto como sea posible. Si no comprueba a menudo la consola de su router I2P, por favor considere cambiar su configuración a "Descargar, verificar, y reiniciar" para asegurarse de que siempre está ejecutando la última versión.
id: Jika Anda masih menjalankan 0.9.13 atau lebih tua, sebaiknya perbarui rilis ini sesegera mungkin. Jika Anda tidak sering memeriksa router console Anda, pertimbangkan untuk mengubah konfigurasi Anda menjadi "Download, Verifikasi, dan Mulai Ulang" untuk memastikan Anda selalu menjalankan rilis terbaru.

source: Fix i2psnark add torrent form
es: Repara el formulario de añadido de torrent de i2psnark
id: Memperbaiki formulir tambahkan torrent di i2psnark

source: Fix iptunnel custom options form
es: Repara el formulario de opciones personalizadas de i2ptunnel
id: Memperbaiki formulir opsi pilihan di iptunnel

source: Fix update download buttons
es: Repara los botones de descarga de actualización
id: Memperbaiki tombol update download

source: Restore all console features if routerconsole.advanced=true
es: Restaura todas las características de la consola si routerconsole.advanced=true
id: Mengembalikan semua fitur console jika routerconsole.advanced=true

source: Restore plugin install if routerconsole.enablePluginInstall=true
es: Restaura la instalación de complementos (plugins) si routerconsole.enablePluginInstall=true
id: Mengembalikan plugin install jika routerconsole.enablePluginInstall=true

source: Restpre client adds/changes if routerconsole.enableClientChange=true
es: Restaura los añadidos/cambios de cliente si routerconsole.enableClientChange=true
id: Klien Restpre tambah/berubah jika routerconsole.enableClientChange=true

source: Plugin signing keys are now whitelisted unless routerconsole.allowUntrustedPlugins=true
es: Las claves de los complementos firmados están en lista blanca, a no ser que se autoricen también los no firmados con routerconsole.allowUntrustedPlugins=true
id: Signing key plugin sekarang masuk daftar putih kecuali jika routerconsole.allowUntrustedPlugins=true

source: More escaping and cleanups in forms and messages
es: Más descartes y aseados en formularios y mensajes
id: Lebih banyak escaping dan pembersihan dalam formulir dan pesan

source: ============================== The birth of Privacy Solutions ==============================
es: ================================== El nacimiento de Privacy Solutions ==================================
id: ============================== Lahirnya organisasi Privacy Solutions ==============================

source: Organization launch
es: Lanzamiento de la organización
id: Peluncuran organisasi
