Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Hello all! Today we announce the Privacy Solutions project, a new organization that develops and maintains I2P software. Privacy Solutions includes several new development efforts designed to enhance the privacy, security, and anonymity for users, based on I2P protocols and technology. These efforts include 1) The Abscond browser bundle. 2) The i2pd C++ router project. 3) The "BigBrother" I2P network monitoring project. 4) The Anoncoin crypto-coin project. 5) The Monero crypto-coin project. Privacy Solutions' initial funding was provided by the supporters of the Anoncoin and Monero projects. Privacy Solutions is a Norway-based non-profit type of organization registered within the Norwegian government registers. ( Kind of like US 501(c)3. ) Privacy Solutions plans to apply for funding from the Norwegian goverment for network research, because of BigBrother (We'll get back to what that is) and the coins that are planned to use low-latency networks as primary transport layer. Our research will support advances in software technology for anonymity, security, and privacy. First a little bit about the Abscond Browser Bundle. This was first a one-man project by Meeh, but later on friends started sending patches, the project is now trying to create the same easy access to I2P as Tor has with their browser bundle. Our first release isn't far away, it's just some gitian script tasks left, including setup of the Apple toolchain. But again we will add monitoring with PROCESS_INFORMATION (A C struct keeping vital proces information about an process) from the Java instance to check on I2P before we declare it stable. I2pd will also switch with the Java version once it's ready, and there is no point in shipping a JRE in the bundle anymore. You can read more about the Abscond Browser Bundle at https://hideme.today/dev
es: ¡Hola a todos! Hoy anunciamos el proyecto Privacy Solutions, una nueva organización que desarrolla y mantiene software I2P. Privacy Solutions incluye varios esfuerzos de nuevos desarrollos diseñados para mejorar la privacidad, seguridad, y anonimato para los usuarios, basados en los protocolos y la tecnología I2P. Estos esfuerzos incluyen 1) El Paquete de Navegador Abscond. 2) El proyecto de router I2Pd C++. 3) El proyecto de monitorización de la red I2P "BigBrother" (gran hermano). 4) El proyecto de cripto-moneda Anoncoin. 5) El proyecto de cripto-moneda Monero. La financiación inicial de Privacy Solutions fue proporcionada por quienes daban soporte a los proyectos Anoncoin y Monero. Privacy Solutions es una organización de tipo no-lucrativo radicada-en-Noruega, y registrada en los registros del Gobierno noruego (algo parecido al 501(c)3 de los EEUU). Privacy Solutions planea solicitar fondos del Gobierno noruego para investigación en redes, a causa de BigBrother (volveremos sobre lo que es esto) y las monedas, que se planea que usen redes de baja-latencia como capa de transporte primaria. Nuestra investigación dará soporte a avances en tecnología de software para el anonimato, la seguridad, y la privacidad. Primero un poco acerca de Paquete de Navegador Abscond. Este fue inicialmente un proyecto de un-solo-hombre de Meeh, pero a continuación varios amigos comenzaron a enviar parches. El proyecto ahora está intentado crear el mismo acceso fácil a I2P que tiene Tor con su paquete de navegador. Nuestra primera versión no está muy lejos, tan sólo faltan algunos trabajos de scripts de git, incluyendo la instalación de la cadena de herramientas de Apple. Pero de nuevo añadiremos monitorización con PROCESS_INFORMATION (una struct (estructura de datos) en C que mantiene la información vital acerca de un proceso) desde la instancia Java para comprobarla sobre I2P antes de declararla estable. i2pd también cambiará con la versión de Java una vez esté listo, y en adelante ya no hay razón para seguir distribuyendo un JRE (entorno de ejecución Java) en el paquete. Puede leer más acerca del Paquete de Navegador Abscond en https://hideme.today/dev
id: Halo semua! Hari ini kami mengumumkan proyek Privacy Solutions, sebuah organisasi baru yang mengembangkan dan memelihara perangkat lunak I2P. Privacy Solutions mencakup beberapa upaya pengembangan baru yang dirancang untuk meningkatkan privasi, keamanan, dan anonimitas pengguna, berdasarkan protokol dan teknologi I2P. Upaya ini meliputi 1) bundel browser Abscond. 2) proyek router i2pd C++. 3) Proyek pemantauan jaringan IBP "BigBrother". 4) Proyek koin kripto Anoncoin. 5) Proyek koin kripto Monero. Pembiayaan awal Privacy Solutions disediakan oleh para pendukung proyek Anoncoin dan Monero. Privacy Solutions adalah jenis organisasi nirlaba berbasis di Norwegia yang terdaftar di dalam register pemerintah Norwegia. (Sejenis US 501 (c) 3. ) Privacy Solutions berencana mengajukan dana kepada pemerintah Norwegia untuk penelitian jaringan, karena BigBrother (kami akan menjelaskannya nanti) dan koin yang direncanakan untuk menggunakan jaringan laten rendah sebagai lapisanan transport utama. Penelitian kami akan mendukung kemajuan teknologi perangkat lunak untuk anonimitas, keamanan, dan privasi. Pertama-tama, ini sedikit penjelasan tentang Abscond Browser Bundle. Ini awalnya proyek satu orang yang dilakukan oleh Meeh, namun kemudian teman-teman mulai mengirimkan pathc, proyek tersebut sekarang berusaha menciptakan akses mudah yang sama dengan I2P seperti yang dimiliki Tor dengan bundel browser mereka. Rilis pertama kami tidak lama, hanya beberapa tugas skrip gitian yang tersisa, termasuk penyiapan toolchain Apple. Tapi sekali lagi kita akan menambahkan pemantauan dengan PROCESS_INFORMATION (A C struct menjaga informasi proses vital tentang suatu proses) dari sebuah instance di Java untuk memeriksa I2P sebelum kita menyatakannya stabil. I2pd juga akan beralih menggunakan versi Java begitu sudah siap, dan tidak ada gunanya mengirim JRE di dalam bundel lagi. Anda dapat membaca lebih banyak tentang Bundel Browser Abscond di https://hideme.today/dev

source: We would also like to inform of the current status of i2pd. I2pd supports bi-directional streaming now, that allows to use not only HTTP but long-lived communication channels. Instant IRC support has been added. I2pd users are able to use it same way as Java I2P for access to I2P IRC network. I2PTunnel is one of key features of I2P network, allowing non-I2P applications communicate transparently. That's why it's vital feature for i2pd and one of key milestones.
es: También nos gustaría informar del actual estado de i2pd. i2pd ahora soporta streaming bi-direccional, lo cual permite usar no sólo HTTP sino canales de comunicación de larga-vida. Ha sido añadido soporte para IRC instantáneo. Los usuarios de i2pd pueden usarlo de la misma manera que Java I2P para acceder a la red IRC de I2P. I2PTunnel es una de las características clave de la red I2P, que permite que las aplicaciones no-I2P se comuniquen de forma transparente. Esta es la razón de que esta sea una característica vital para i2pd y uno de los logros clave.
id: Kami juga ingin menginformasikan status i2pd saat ini. I2pd sekarang mendukung streaming dua arah, yang memungkinkan untuk tidak hanya menggunakan HTTP tapi juga saluran komunikasi yang long-lived. Dukungan IRC instan telah ditambahkan. Pengguna I2pd dapat menggunakannya dengan cara yang sama seperti Java I2P untuk akses ke jaringan I2P IRC. I2PTunnel adalah salah satu fitur utama jaringan I2P, yang memungkinkan aplikasi non-I2P berkomunikasi secara transparan. Itulah mengapa ini adalah fitur vital untuk i2pd dan salah satu tonggak utama.

source: At last, if you are familiar with I2P you probably know about Bigbrother.i2p, which is a metrics system Meeh made over a year back. Recently we noticed that Meeh actually have 100Gb of non-duplicated data from nodes reporting in since initial launch. This will also be moved to Privacy Solutions and be rewritten with a NSPOF backend. With this we will aslo start using the Graphite ( http://graphite.wikidot.com/screen-shots ). This will give us a great overview over the network without privacy issues for our end users. The clients filter all data except country, router hash and success rate on tunnel buildings. The name of this service is as always a little joke from Meeh.
es: Por último, si está familiarizado con I2P probablemente tiene conocimiento de Bigbrother.i2p, que es una sistema de métricas que Meeh hizo hace alrededor de un año. Recientemente nos hemos dado cuenta de que Meeh tiene actualmente 100Gb de datos no-duplicados de nodos que vierten información desde su lanzamiento incial. Esto también se trasladará a Privacy Solutions y se reescribirá con un backend NSPOF (estructura de motor sin-puntos-de-fallo). Con esto también comenzaremos a usar Graphite ( http://graphite.wikidot.com/screen-shots ). Esto nos dará una gran perspectiva acerca de la red sin problemas de privacidad para nuestros usuarios finales. Los clientes filtran todos los datos excepto el país, el identificador criptográfico (hash) del router I2P y el índice de éxito en la construcción de túneles. El nombre de este servicio como siempre es una pequeña broma de Meeh.
id: Akhirnya, jika Anda mengenal I2P, Anda mungkin tahu tentang Bigbrother.i2p, yang merupakan sistem metrik yang dibuat Meeh lebih dari satu tahun yang lalu. Baru-baru ini kami menyadari bahwa Meeh memiliki 100Gb data non-duplikat dari nodus yang dilaporkan sejak peluncuran awal. Ini juga akan dipindahkan ke Privacy Solutions dan ditulis ulang dengan backend NSPOF. Dengan ini, kami juga akan mulai menggunakan Graphite ( http://graphite.wikidot.com/screen-shots ). Ini akan memberi kita gambaran besar tentang jaringan tanpa masalah privasi bagi pengguna akhir kami. Klien-klien akan menyaring semua data kecuali negara, router hash, dan tingkat kesuksesan pembangunan tunnel. Nama servis ini adalah lelucon dari Meeh.

source: We have shorted down a bit of the news here, if you're interested in more information please visit https://blog.privacysolutions.no/ We're still under construction and more content will come! For further information contact: press@privacysolutions.no Best regards, Mikal "Meeh" Villa
es: Hemos abreviado un poco las noticias aquí. Si está interesado en más información, por favor, visite https://blog.privacysolutions.no/ ¡Aún estamos en construcción y están por venir más contenidos! Para más información contacte con: press@privacysolutions.no Un gran saludo, Mikal "Meeh" Villa
id: Kami telah merapihkan beberapa berita di sini, jika Anda tertarik dengan info lebih lanjut, silakan kunjungi https://blog.privacysolutions.no/ Situs ini masih dalam pengembangan dan konten lebih banyak akan muncul! Untuk info lebih lanjut silakan kontak: press@privacysolutions.no Salam, Mikal "Meeh" Villa

source: ============================================= Android test release on Google Play in Norway =============================================
es: ======================================================== Versión de prueba para Android en Google Play en Noruega ========================================================
id: ============================================= Rilis tes Android di Google Play di Norwegia =============================================

source: I2P Android and Bote have been released on Google Play in Norway, as a test run for a future worldwide release.
es: I2P Android y Bote han sido publicados en Google Play en Noruega, como prueba realizada para una futura publicación mundial.
id: I2p Android dan Bote telah dirilis di Google Play di Norwegia, sebagai uji coba untuk masa mendatang di seluruh dunia.

source: I2P Android has existed for over three years. In that time, it has evolved from a simple test project into a usable, useful Android port of the I2P router. Our eventual goal has been to release I2P Android on Google Play, to make it easier for users to discover, install and use I2P on their Android devices. After much work improving the user interface, fixing bugs and testing, we think that I2P Android is finally ready to go where the users are.
es: I2P Android ha existido durante más de tres años. En ese tiempo, ha evolucionado desde un simple proyecto de prueba hasta un útil y manejable router I2P portado a Android. Nuestro objetivo eventual ha sido la publicación de I2P Android en Google Play, para hacerle más fácil a los usuarios descubrir, instalar y usar I2P en sus dispositivos Android. Después de mucho trabajo mejorando la interfaz de usuario, reparando fallos y probando, pensamos que I2P Android finalmente está listo para ser entregado a los usuarios.
id: I2P Android sudah ada lebih dari tiga tahun. Dari awal, ini berevolusi dari proyek tes sederhana menjadi Android porting dari I2P router yang berfungsi . Tujuan akhir kami selalu merilis I2P Android di Google Play, untuk memudahkan mengguna menemukan, memasang, dan menggunakan I2P di Android. Setelah banyak pekerjaan untuk memperbaiki antar muka, bugs, dan pengujian, kami pikir I2P Android akhirnya siap pergi ke tempat pengguna.

source: Initially, we are only releasing to Android users in Norway, as a test run. I2P Android will have far more exposure on Google Play than it has ever had before, and there will be bugs and usability issues that we need to fix. It will be much easier (and less stressful!) to respond to feedback if we only need to deal with reports from hundreds of users instead of thousands (already orders of magnitude more feedback than we have ever had).
es: Inicialmente, sólo estamos publicando para los usuarios de Android en Noruega, a modo de prueba. I2P Android tendrá mucha más exposición en Google Play que la que ha tenido nunca antes, y habrá fallos y problemas de manejabilidad que tendremos que arreglar. Será mucho más fácil (¡y menos estresante!) atender la respuesta de los usuarios si sólo tenemos que tratar con los informes de cientos de usuarios en lugar de miles (ya de hecho varios órdenes de magnitud más respuesta de los usuarios de la que nunca hemos tenido).
id: Awalnya kami hanya merilis ini ke pengguna Android di Norwegia sebagai tempat pengujian. I2p Android akan memiliki jauh lebih banyak eksposur di Google Play dari sebelumnya, dan akan ada bug dan masalah penggunaan yang butuh diperbaiki. Ini akan menjadi jauh lebih mudah (dan kurang membuat stres!) untuk menanggapi umpan balik jika kita hanya perlu berurusan dengan laporan dari ratusan pengguna, bukan ribuan (sudah berlipat lebih banyak umpan balik dari yang kita pernah miliki).

source: As lead developer for I2P Android and Bote, I look forward to your comments. You are the people who will be using them, and your perspectives will help me craft simple, intuitive apps that make privacy accessible to everyone.
es: Como desarrollador líder para IP2 Android y Bote, busco vuestros comentarios. Vosotros sois las personas que vais a usarlo, y vuestras perspectivas me ayudarán a elaborar aplicaciones simples e intuitivas que hagan la privacidad accesible para todos.
id: Sebagai pengembang utama I2P Android and Bote, saya mengharapkan komentar Anda. Anda adalah orang yang akan menggunakannya, dan sudut pandang anda akan membantu saya membuat aplikasi yang sederhana, intuitif yang membuat privasi dapat didapat semua orang.

source: Website release details
es: Detalles de la versión del sitio web
id: Detail rilis situs

source: We have also updated I2P Android on the website to match the release candidate deployed in Norway. This version will be updated with changes as we respond to feedback from Norwegian users, heading towards our next stable release.
es: También hemos actualizado I2P Android en el sitio web para que coincida con la versión candidata desplegada en Noruega. Esta versión se actualizará con los cambios que realicemos atendiendo a la respueta de los usuarios noruegos, encaminándonos hacia nuestra próxima versión estable.
id: Kami telah memperbarui I2P Android di situs untuk menyamakan kandidat rilis yang disebarkan di Norway. Versi ini akan diperbarui dengan perubahan sejalan dengan respon terhadap umpan balik dari pengguna di Norwegia, mengarah ke rilis stabil berikutnya.

source: Please note that we have upgraded the Android API to 9. This means that Froyo Android 2.2 will not be supported anymore; the minimum requirement is now Gingerbread Android 2.3.
es: Por favor observe que hemos actualizado la API de Android a su versión 9. Esto significa que Android 2.2 Froyo en adelante deja de estar soportado; el requisito mínimo ahora es Android 2.3 Gingerbread.
id: Harap dicatat bahwa kami telah memperbarui Android API ke 9. Ini artinya Froyo Android 2.2 sudah tidak didukung; syarat minimum sekarang adalah Gingerbread Android 2.3.

source: Also note that if you have an earlier version of I2P Android, you will need to uninstall and reinstall because we have changed the release keys. Further information about this will be provided in a subsequent blog post.
es: Observe también que si tiene una versión anterior de I2P Android, tendrá que desinstalar y reinstalar porque hemos cambiado las claves de versión. Se proporcionará más información sobre esto en un post subsiguiente del blog.
id: Juga perhatikan bahwa jika anda menggunakan versi lama I2P Android, Anda perlu uninstall dan reinstall karena kami telah mengubah release keys. Info lebih lanjut akan diberikan di posting blog.

source: ============== 0.9.15 Release ==============
es: ============== Versión 0.9.15 ==============
id: ============== Rilis 0.9.15 ==============

source: 0.9.15 includes Ed25519 crypto and many fixes
es: La versión 0.9.15 incluye criptografía Ed25519 y muchas reparaciones
id: 0.9.15 mencakup kripto Ed25519 dan banyak perbaikan

source: 0.9.15 adds preliminary support for Ed25519 EdDSA signatures. It includes a new persistent configuration backend for i2psnark and fixes several issues with i2psnark's handling of file names. There are several improvements to speed up SAM. Plugins now support stronger signatures in the su3 file format. Plugin installation via the console, which was disabled in 0.9.14, is re-enabled.
es: La versión 0.9.15 añade soporte preliminar para firmas Ed25519 EdDSA. Incluye un nuevo mecanismo (backend) de configuración persistente para la aplicación i2psnark y repara varios problemas con el tratamiento de nombres de fichero de i2psnark. Hay varias mejoras para la velocidad de la aplicación SAM. Los complementos (plugins) ahora soportan firmas más robustas en el formato de fichero su3. La instalación de complementos vía consola, que fue deshabilitada en la versión 0.9.14, está habilitada de nuevo.
id: 0.9.15 Menambah dukungan untuk tanda tangan Ed25519 Ini termasuk persistent configuration backend baru untuk i2psnark dan beberapa perbaikan penanganan nama file di i2psnark. Ada beberapa peningkatan untuk mempercepat SAM. Plugins sekarang mendukung signature yang lebih kuat dalam format file su3. Instalasi plugin lewat console, yang dinonaktifkan di 0.9.14, sekarang diaktifkan kembali.

source: We have supported ECDSA signatures since 0.9.12, and we would like to start using ECDSA by default. Unfortunately, some of you are still running older I2P versions, and for others, their distribution or Java runtime does not support ECDSA. Red Hat (RHEL, Fedora) distributions are reported to be missing ECDSA. Some have fixed the Java issues by upgrading from Java 6 to Java 7; others have had success with installing the "unlimited strength policy files". We've added information about missing crypto to the log file and the /logs page in the console. After you update to 0.9.15, please check if you are missing ECDSA support, and attempt to fix it if necessary. This is particularly important for those that run popular eepsites and services.
es: Hemos incorporado soporte para firmas ECDSA desde la vesión 0.9.12, y deseamos comenzar a usar ECDSA por defecto. Desafortunadamente, algunos de ustedes aún están ejecutando versiones más antiguas de I2P, y para otros, su distribución o su entorno de ejecución de Java no soporta ECDSA. Hay constancia de que las distribuciones Red Hat (RHEL, Fedora) carecen de ECDSA. Algunos han solventado los problemas con Java actualizando de Java 6 a Java 7; otros han tenido éxito instalando los "ficheros de política de fuerza ilimitada". Hemos añadido información sobre ausencia de criptografía en el fichero de registro (log) y la página /logs en la consola. Después de que actualice a la versión 0.9.15, por favor compruebe si carece de soporte ECDSA, y trate de arreglarlo si es necesario. Esto es particularmente importante para aquellos que mantienen eepsites y servicios populares.
id: Kami telah mendukung tanda tangan ECDSA sejak versi 0.9.12, dan kami ingin mulai menggunakan ECDSA secara default. Sayangnya, beberapa dari Anda masih menjalankan versi I2P yang lama, dan untuk yang lain, distribusi atau Java runtime mereka tidak mendukung ECDSA. Distribusi Red Hat (RHEL, Fedora) dilaporkan tidak mempunyai ECDSA. Beberapa telah memperbaiki masalah Java dengan mengupgrade dari Java 6 ke Java 7; yang lain telah berhasil dengan menginstal "unlimited strength policy files". Kami telah menambahkan informasi tentang kripto yang hilang ke file log dan halaman /log di console. Setelah Anda memperbarui ke 0.9.15, periksa apakah Anda kehilangan dukungan ECDSA, dan coba perbaiki jika perlu. Hal ini sangat penting bagi mereka yang menjalankan eepsites dan layanan populer.

source: Changes
es: Cambios
id: Beberapa perubahan

source: Add support for Ed25519 signatures
es: Añade soporte para firmas Ed25519
id: Menambah dukungan untuk tanda tangan Ed25519

source: i2psnark move to separate config file for each torrent to better support per-torrent settings
es: La aplicación i2psnark cambia para usar ficheros de configuración distintos para cada torrent para dar mejor soporte para configuraciones por-torrent
id: i2psnark pindah ke file konfigurasi terpisah untuk setiap torrent untuk mendukung pengaturan per-torrent yang lebih baik

source: Add i2psnark support for data outside the i2psnark/ directory
es: Añade soporte de i2psnark para datos fuera del directorio i2psnark/
id: Menambah dukungan i2psnark untuk data di luar direktori i2psnark/

source: Enable stronger signatures (su3 format) for plugins
es: Habilita firmas más robustas (formato su3) para complementos
id: Mengaktifkan tanda tangan yang lebih kuat (format su3) untuk plugin

source: Speed up SSU introductions by responding to hole punch messages
es: Incrementa la velocidad de las 'introducciones' SSU al responder a los mensajes de apertura dinámica de puertos (hole punch)
id: Mempercepat SSU introduction dengan menanggapi hole punch

source: Several improvements in SAM efficiency
es: Varias mejoras en la eficiencia de la aplicación SAM
id: Beberapa perbaikan dalam efisiensi SAM

source: Form submission fixes in the console and i2psnark
es: Reparaciones al envío de formularios en la consola y en i2psnark
id: Perbaikan formulir penyerahan di console dan i2psnark

source: Streaming fixes for long signatures
es: Reparaciones en los flujos de datos (streaming) para firmas largas
id: Perbaikan streaming untuk tanda tangan yang panjang

source: i2psnark fixes for file name character mapping when seeding
es: Reparaciones en i2psnark para mapeado de caracteres de nombre de fichero al sembrar (seeding)
id: Perbaikan i2psnark untuk pemetaan karakter nama file saat seeding

source: I2PTunnel fixes stopping client tunnels
es: Reparaciones en I2PTunnel en la detención de túneles de cliente
id: Perbaikan I2PTunnel dalam menghentikan client tunnel

source: I2PTunnel fix updating options on a running delay-open client tunnel
es: Reparación de I2PTunnel al actualizar opciones sobre un túnel de cliente de retardo-abierto en ejecución
id: Perbaikan I2PTunnel dalam opsi pembaruan pada delay-open client tunnel yang terus berjalan
