Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Re-enable plugin installation via the console, removed in 0.9.14
es: Vuelve a habilitar la instalación de complementos (plugins) vía consola, eliminado en la 0.9.14
id: Mengaktifkan kembali pemasangan plugin melalui console, yang dihapus di 0.9.14

source: i2psnark now remembers uploaded count across restarts
es: i2psnark ahora recuerda el recuento de subidas entre reinicios
id: i2psnark sekarang mengingat jumlah upload saat me-restart

source: i2psnark increase max piece size to 8 MB
es: i2psnark incrementa el tamaño máximo del fragmento a 8 MB
id: i2psnark meningkatkan ukuran potongan maksimal menjadi 8 MB

source: i2psnark several UI fixes
es: Varias reparaciones de interfaz de usuario (UI) de i2psnark
id: Beberapa perbaikan UI di i2psnark

source: Prohibit SSU peer test requests unless a connection is established
es: Prohibe solicitudes de prueba de par (peer) SSU a menos que se establezca una conexión
id: Melarang uji coba SSU peer kecuali jika koneksi dibuat

source: i2ptunnel add support for local SSL connections for standard and IRC client tunnels
es: i2ptunnel añade soporte para conexiones SSL locales para túneles de cliente de IRC y estándar
id: i2ptunnel menambahkan dukungan untuk koneksi SSL lokal untuk client tunnel standar dan IRC

source: Console and log warnings for unavailable crypto
es: Advertencias en consola y registro (log) por criptografía no disponible
id: Console dan peringatan log untuk kripto yang tidak tersedia

source: More consistent routing for Delivery Status Messages to reduce network connections
es: Enrutado más consistente para que los Mensajes de Estado de Entrega reduzcan conexiones de red
id: Routing yang lebih konsisten untuk Pesan Status Pengiriman untuk mengurangi koneksi jaringan

source: Disable external entities in UPnP XML parser
es: Deshabilita entidades externas en el analizador XML de UPnP
id: Menonaktifkan entitas eksternal di parser XML UPnP

source: Update GeoIP data (in both new installs and updates)
es: Actualiza los datos GeoIP (tanto en nuevas instalaciones como actualizaciones)
id: Perbarui data GeoIP (untuk instalasi baru dan pembaruan)

source: ============== 0.9.16 Release ==============
es: ============== Versión 0.9.16 ==============
id: ============== Rilis 0.9.16 ==============

source: 0.9.16 includes crypto migration and many fixes
es: 0.9.16 incluye cripto migración y muchas reparaciones
id: 0.9.16 mencakup migrasi kripto dan banyak perbaikan

source: 0.9.16 is a significant step forward in our plan to migrate from DSA to ECDSA and then EdDSA cryptographic signatures, and makes several other changes to increase your anonymity and security. Client tunnels for standard, IRC, and SOCKS IRC will use ECDSA signatures by default. In addition, we've fixed a large number of serious bugs, including console lockups.
es: 0.9.16 es un significativo paso hacia delante en nuestro plan para migrar desde firmas criptográficas DSA, a ECDSA y luego a EdDSA, y realiza varios otros cambios para incrementar su anonimato y seguridad. Los túneles de cliente para IRC estándar e IRC por SOCKS utilizarán firmas ECDSA por defecto. Además, hemos reparado un gran número de fallos graves, incluyendo bloqueos de consola.
id: 0.9.16 merupakan langkah maju yang signifikan dalam rencana kami untuk bermigrasi dari DSA ke ECDSA dan kemudian tanda tangan kriptografi EdDSA, dan membuat beberapa perubahan lain untuk meningkatkan anonimitas dan keamanan Anda. Terowongan klien untuk IRC standar, IRC, dan SOCKS akan menggunakan tanda tangan ECDSA secara default. Selain itu, kami telah memperbaiki sejumlah besar bug serius, termasuk console lockups.

source: Changes in router data structures will require i2pcontrol plugin users to update to version 0.0.9.
es: Los cambios en las estructuras de datos del router I2P requerirán que los usuarios del complemento i2pcontrol actualicen a la versión 0.0.9.
id: Perubahan pada struktur data router memerlukan pengguna plugin i2pcontrol untuk mengupdate ke versi 0.0.9.

source: If you run an eepsite or a service and you are not running a recent release, or your Java or OS does not support ECDSA (as noted in the logs and on the /logs page in the console), please fix the issue as soon as possible or your users will soon be unable to connect.
es: Si usted ejecuta un eepsite o un servicio, y no está ejecutando una versión reciente, o su Java o su sistema operativo no soporta ECDSA (como se refleja en los registros ('logs') y en la página /logs en la consola), por favor arregle el problema tan pronto como sea posible o sus usuarios en breve no podrán conectarse.
id: Jika Anda menjalankan eepsite atau service dan Anda tidak menjalankan rilis terbaru, atau Java atau OS Anda tidak mendukung ECDSA (seperti yang tercatat di log dan di halaman /log di console), tolong perbaiki masalah ini segera setelah mungkin atau pengguna Anda akan segera tidak dapat terhubung.

source: Add support for stronger Router Info signatures
es: Añade soporte para firmas más robutas de Router Info ('RI')
id: Tambahkan dukungan untuk tanda tangan Router Info yang lebih kuat

source: Encrypt RI lookups and responses on faster boxes
es: Cifra las búsquedas y respuestas de RI en máquinas rápidas
id: Enkripsi pencarian dan tanggapan RI pada kotak yang lebih cepat

source: Require I2CP authorization for all messages when enabled (requires 0.9.11 or higher client)
es: Requiere autorización I2CP para todos los mensajes cuando se habilite (precisa un cliente 0.9.11 o superior)
id: Mengharuskan otorisasi I2CP untuk semua pesan bila diaktifkan (memerlukan klien 0,9.11 atau lebih tinggi)

source: Disable SSLv3 and older ciphers for reseeding and other uses of SSL
es: Deshabilita SSLv3 y cifrados más antiguos para el resembrado y otros usos de SSL
id: Menonaktifkan SSLv3 dan ciphers yang lebih lama untuk reseeding dan penggunaan SSL lainnya

source: Use ECDSA by default for i2ptunnel IRC, SOCKS-IRC, and standard client tunnels
es: Utiliza ECDSA por defecto para IRC por i2ptunnel, IRC por SOCKS, y túneles de cliente estándar.
id: Gunakan ECDSA secara default untuk i2ptunnel IRC, SOCKS-IRC, dan client tunnel standar

source: Don't prefer floodfills in some countries
es: Evita priorizar routers I2P de inundación ('floodfills') en algunos países
id: Menambah preferensi tidak menggunakan floodfill di beberapa negara

source: New column sorting, set-all priority buttons, and upload ratio display in i2psnark
es: Nueva ordenación de columna, botones de prioridad establecer-todos, y marcador de la tasa de subida en i2psnark
id: Pemilahan kolom baru, tombol set-all priority, dan tampilan rasio upload di i2psnark

source: Increase i2psnark tunnel default to 3 hops
es: Incrementa a 3 saltos la configuración predeterminada de túneles de i2psnark
id: Meningkatkan tunnel i2psnark menjadi 3 hop

source: Implement bundling of multiple fragments in a single SSU message for efficiency
es: Implementa el empaquetado de múltiples fragmentos en un sólo mensaje SSU por eficiencia
id: Menerapkan bundling beberapa fragmen dalam pesan SSU tunggal untuk efisiensi

source: New add-to-addressbook links on netdb leaseset page
es: Nuevos enlaces añadir-a-la-libreta-de-direcciones en la página de leasesets de netdb
id: Menambah tautan add-to-addressbook di halaman netdb leasinget

source: Implement I2NP DatabaseLookupMessage search type field to improve lookup efficiency
es: Implementa un campo de tipo búsqueda DatabaseLookupMessage I2NP para mejorar la eficiencia de la búsqueda.
id: Menerapkan formulir pencarian DatabaseLookupMessage I2NP untuk meningkatkan efisiensi pencarian

source: CPUID fixes and updates for recent processors
es: Reparaciones de CPUID y actualizaciones para procesadores recientes
id: Perbaikan CPUID dan update untuk prosesor terbaru

source: i2psnark fix magnet links with %(pc)s-encoding
es: i2psnark repara enlaces magnet con codificación-%(pc)s
id: i2psnark memperbaiki magnet link dengan %(pc)s-encoding

source: Improve handling of SSU socket closing out from under us (hopefully fix 100%(pc)s CPU)
es: Mejora la gestión del socket SSU cerrándolo desde nosotros hacia abajo (con suerte reparará el 100%(pc)s de las CPU)
id: Meningkatkan penanganan soket SSU dari bawah kita (mudah-mudahan memperbaiki 100%(pc)s CPU)

source: SSU bitfield handling fixes
es: Reparaciones del tratamiento del campo de bits ('bitfield') SSU
id: Perbaikan penanganan bitfield SSU

source: Fix HTTP header issues in i2psnark
es: Repara problemas con la cabecera HTTP en i2psnark
id: Perbaikan masalah header HTTP di i2psnark

source: Fix rare NPE when building garlic message
es: Repara una extraña excepción de puntero nulo ('NPE') al crear mensajes garlic
id: Perbaikan NPE langka saat membangun garlic message

source: Fix console lockups (hopefully)
es: Repara bloqueos de consola (eso esperamos)
id: Perbaikan console lockups (mudah-mudahan)

source: Fix i2ptunnel js confirm-delete
es: Repara el js confirmar-borrar de i2ptunnel
id: Perbaikan i2ptunnel js confirm-delete

source: Move router data structures from i2p.jar to router.jar (breaks i2pcontrol plugin)
es: Mueve estructuras de datos del router desde i2p.jar a router.jar (estropea el funcionamiento del complemento i2pcontrol)
id: Memindahkan struktur data router dari i2p.jar ke router.jar (menghentikan i2pcontrol plugin)

source: New router keys now stored in router.keys.dat (eepPriv.dat format) instead of router.keys
es: Las nuevas claves de router I2P ahora se almacenan en router.keys.dat (formato eepPriv.dat) en lugar de en router.keys
id: Kunci router baru sekarang tersimpan di router.keys.dat (format eepPriv.dat), bukan router.keys

source: Improve handling of unsupported encryption throughout
es: Mejora en cualquier parte el tratamiento del cifrado no soportado
id: Peningkatan penanganan enkripsi throughout yang tidak didukung

source: More error checking of client I2CP messages by the router
es: Más comprobación de errores para mensajes de cliente I2CP por el router I2P
id: Lebih banyak pengecekan kesalahan pada pesan I2CP klien oleh router

source: Initial work on hooks for pluggable transports
es: Trabajo inicial en enganches ('hooks') para transportes enchufables
id: Pekerjaan awal pada hooks untuk pluggable transport

source: Enforce request timestamp in tunnel build messages
es: Pone en marcha la petición de marca de tiempo en los mensajes de creación de túnel
id: Menerapkan stempel waktu permintaan dalam pesan pembangunan tunnel

source: Re-enable message status in streaming, but treat no leaseset as a soft failure for now
es: Vuelve a habilitar el mensaje de estado en streaming, pero no trata ningún leaseset como un fallo leve por ahora
id: Mengaktifkan kembali status pesan dalam streaming, tapi tidak memperlakukan leasinget sebagai kegagalan lunak, untuk saat ini

source: Return unused DH keypairs to the pool for efficiency
es: Devuelve los pares de claves Diffie-Hellman ('DH') no usados al depósito, por eficiencia
id: Mengembalikan keypairs DH yang tidak terpakai ke pool untuk efisiensi

source: Raise failsafe tagset limit and improve deletion strategy when hit
es: Eleva el límite del conjunto de etiquetas ('tagset') a prueba de fallos y mejora la estrategia de borrado cuando se alcanza
id: Menaikkan batas tagset failsafe dan memperbaiki strategi penghapusan saat hit terjadi

source: Change eepsite Jetty threadpool and queue configuration (new installs only)
es: Cambia el depósito de hilos ('threadpool') Jetty del eepsite y la configuración de la cola (sólo en nuevas instalaciones)
id: Mengubah konfigurasi eepsite Jetty threadpool dan konfigurasi antrian (hanya untuk pemasangan baru)

source: NTCP establishment refactoring in prep for NTCP2 and PT
es: Refactorizado del establecimiento NTCP en preparación para NTCP2 y transporte enchufable ('PT')
id: Penetapan ulang NTCP dalam persiapan untuk NTCP2 dan PT

source: ============== 0.9.17 Release ==============
es: ============== Versión 0.9.17 ==============
id: ============== Rilis 0.9.17 ==============

source: 0.9.17 with more crypto migration and many fixes
es: 0.9.17 con más migración de criptografía y muchas reparaciones
id: 0.9.17 dengan lebih banyak lagi migrasi kripto dan banyak perbaikan

source: 0.9.17 is primarily a bugfix release, but it also continues our migration to stronger cryptographic signatures.
es: La 0.9.17 es principalmente una versión de reparación de fallos, pero también continúa nuestra migración a firmas criptográficas más robustas.
id: 0.9.17 terutama merupakan rilis bugfix, namun juga meneruskan migrasi ke tanda tangan kriptografi yang lebih kuat.

source: We have moved the news feed system used for the news on your console and the latest router version indication to a signed format using RSA 4096-bit keys for enhanced security.
es: Hemos cambiado el sistema de suscripción (feed) de noticias, usado para las noticias en su consola y la indicación de la última versión del router I2P, a un formato firmado mediante claves RSA de 4096-bits para una seguridad reforzada.
id: Kami telah memindahkan sistem news feed yang digunakan untuk berita di console Anda dan indikasi versi router terbaru ke format yang ditandatangani menggunakan kunci RSA 4096-bit untuk keamanan yang ditingkatkan.

source: New eepsites and servers will be ECDSA-signed by default, if ECDSA is available. There is now a warning in the console sidebar if ECDSA is not available. For RedHat users, we have reports of successful installs of the BouncyCastle Provider (bcprov) jar to add ECDSA support.
es: Los nuevos eepsites y servidores estarán firmados-con-ECDSA por defecto, si ECDSA está disponible. Ahora se muestra una advertencia en la barra lateral de la consola si ECDSA no está disponible. Para usuarios de RedHat, nos han informado de instalaciones exitosas del jar del Bouncy Castle Provider (bcprov) para añadir soporte de ECDSA.
id: Eepsites dan server baru akan ditandatangani oleh ECDSA secara default, jika ECDSA tersedia. Sekarang ada peringatan di console sidebar jika ECDSA tidak tersedia. Untuk pengguna RedHat, kami mendapat laporan tentang pemasangan yang berhasil dari BouncyCastle Provider (bcprov) jar untuk menambahkan dukungan ECDSA.

source: We've fixed several serious bugs, including an SSU packet corruption problem, and a SAM bug affecting i2p-messenger and other SAM applications. There are several fixes for the preliminary ECDSA router signatures added in the last release but not yet enabled.
es: Hemos reparado varios fallos graves, incluyendo un problema de corrupción de paquete SSU, y un fallo de SAM que afecta a i2p-messenger y otras aplicaciones SAM. Hay varias reparaciones de fallos para las firmas ECDSA preliminares del router I2P añadidas en la última versión, pero aún no están habilitadas.
id: Kami telah memperbaiki beberapa bug serius, termasuk masalah korupsi paket SSU, dan bug SAM yang mempengaruhi i2p-messenger dan aplikasi SAM lainnya. Ada beberapa perbaikan untuk tanda tangan router awal ECDSA yang ditambahkan pada rilis terakhir namun belum diaktifkan.

source: Many of us will be attending 31C3 in Hamburg in December. Stop by our table and say hi!
es: Muchos de nosotros asistiremos al 31C3 en Hamburgo en diciembre. ¡Déjese caer por nuestra mesa y salúdenos!
id: Banyak dari kami akan menghadiri 31C3 di Hamburg pada bulan Desember. Mampir ke meja kami dan sapa!

source: Signed news
es: Noticias firmadas
id: Berita penting

source: ECDSA default for new server tunnels
es: ECDSA por defecto para los nuevos túneles de servidor
id: ECDSA secara default diterapkan untuk server tunnel baru

source: Reseeding now SSL-only by default
es: El resembrado ahora es sólo-SSL por defecto
id: Reseeding sekarang hanya menggunakan SSL secara default

source: Fix SSU sending corrupt ack-only packets with partial bitfields
es: Repara SSU al enviar paquetes sólo-ack (completos) corruptos con campos de bits parciales (como incompletos)
id: Perbaikan SSU dalam mengirim paket ack-only yang korup dengan bitfields parsial

source: Fix SSU inbound connection fail from non-DSA router
es: Repara un fallo de conexión entrante de SSU desde un router I2P no-DSA
id: Perbaikan koneksi inbound SSU gagal dari router non-DSA

source: Don't select incompatible peers if we are a non-DSA router
es: No selecciona pares (peers) incompatibles si somos un router I2P no-DSA
id: TIdak memilih peer yang tidak kompatibel untuk router non-DSA

source: Fix EdDSA signature verification bug
es: Repara un fallo de verificación de firma EdDSA
id: Perbaikan bug verifikasi tanda tangan EdDSA

source: Set I2NP lookup type flags in all cases, not just when a reply tunnel is used
es: Establece indicativos de tipo de búsqueda I2NP (protocolo de red IP2) en todos los casos, no sólo cuando se usa un túnel de respuesta
id: Menetapkan I2NP lookup type flags dalam semua kasus, tidak hanya saat reply tunnel digunakan

source: Stop i2ptunnel server acceptor thread after close
es: Detiene el hilo aceptante de servidor de i2ptunnel después de cerrar
id: Menghentikan i2ptunnel server acceptor thread setelah ditutup

source: Fix bug preventing some plugins from stopping completely
es: Repara un fallo que evita que algunos complementos se detengan por completo
id: Perbaikan bug yang mencegah beberapa plugin berhenti sepenuhnya

source: Fix SAM v3 bug causing failures in incoming connections
es: Repara un fallo de SAM v3 que causa fallos en las conexiones entrantes
id: Perbaikan bug SAM v3 yang menyebabkan kegagalan pada koneksi masuk

source: Add a warning in the console sidebar if ECDSA not supported
es: Añade una advertencia en la barra lateral de la consola si ECDSA no está soportado
id: Menambahkan peringatan di console sidebar jika ECDSA tidak didukung

source: Log warnings for Java 6 that we will eventually require Java 7
es: Añade advertencias al registro (log) para Java 6 acerca de que eventualmente requeriremos Java 7
id: Peringatan log untuk Java 6 yang pada akhirnya akan membutuhkan Java 7

source: Don't let proxied routers auto-floodfill
es: No permite auto-inundar a los routers I2P proxyficados
id: Tidak membiarkan proxied router auto-floodfill

source: Don't resend SSU acks that are too old
es: No reenvía acks (acuses de recibo) SSU que sean demasiado antiguos
id: Tidak mengirim ulang SSU acks yang sudah terlalu tua

source: Don't publish direct info in SSU address if introducers are required
es: No publica información directa en la dirección SSU si se requieren introductores
id: Tidak mempublikasikan info langsung di alamat SSU jika diperlukan

source: New default opentrackers in i2psnark
es: Nuevos rastreadores-abiertos (opentrackers) predeterminados en i2psnark
id: Opentrackers default baru di i2psnark

source: Add support for specifiying data directory per-torrent in i2psnark
es: Añade soporte para especificar un directorio de datos por-torrent en i2psnark
id: Menambahkan dukungan untuk menentukan data directory per-torrent di i2psnark

source: Changes in streaming accept() error behavior
es: Cambia el comportamiento del error accept() de streaming
id: Perubahan dalam perilaku accept() error streaming

source: Minor blockfile format changes
es: Cambios menores del formato de fichero de bloques (blockfile)
id: Perubahan kecil dalam format blockfile

source: New option for persistent random key to preserve peer ordering across restarts
es: Nueva opción para que la clave aleatoria persistente preserve el orden de los pares (peers) entre reinicios
id: Opsi baru untuk kunci acak persisten untuk melestarikan peer ordering di restart

source: ==================== Android app releases ====================
es: =========================== Versiones de la aplicación de Android ===========================
id: ==================== Rilis Aplikasi Android ====================

source: I2P Android 0.9.17 and Bote 0.3 have been released on the website, Google Play and F-Droid.
es: I2P Android 0.9.17 y Bote 0.3 han sido publicados en los sitios web de Google Play y F-Droid
id: I2P Android 0.9.17 dan Bote 0.3 telah dirilis di situs web, Google Play, dan F-Droid.

source: It has been some time since I last posted updates about our Android development, and several I2P releases have gone by without any matching Android releases. At last, the wait is over!
es: Ha pasado algún tiempo desde que publiqué por última vez novedades acerca de nuestro desarrollo para Android, y varias versiones de I2P han quedado atrás sin ninguna versión correpondiente de la aplicación de Android. ¡Finalmente, la espera se acabó!
id: Sudah beberapa lama sejak saya terakhir memposting pembaruan tentang pengembangan Android kami, dan beberapa rilis I2P telah berlalu tanpa rilis Android yang sesuai. Akhirnya, penantian sudah berakhir!

source: New app versions ----------------
es: Nuevas versiones de la aplicación ----------------
id: Versi aplikasi baru ----------------

source: New versions of I2P Android and Bote have been released! They can be downloaded from these URLs:
es: ¡Se han publicado nuevas versiones de I2P Android y de Bote! Pueden descargarse desde estas URLs:
id: Versi baru Android dan Bote I2P telah dirilis! Mereka dapat diunduh dari URL berikut:

source: The main change in these releases is the transition to Android's new Material design system. Material has made it much easier for app developers with, shall we say, "minimalist" design skills (like myself) to create apps that are nicer to use. I2P Android also updates its underlying I2P router to the just-released version 0.9.17. Bote brings in several new features along with many smaller improvements; for example, you can now add new email destinations via QR codes.
es: El principal cambio en estas versiones es la transición hacia Material, el nuevo sistema de diseño de Android. Material ha hecho mucho más fácil para los desarrolladores de aplicaciones con, pongamos, destrezas de diseño "minimalistas" (como las mías), crear aplicaciones que sean más agradables de usar. I2P Android también actualiza su propio router I2P subyacente a la versión 0.9.17 recién publicada. Bote trae varias características nuevas junto con muchas mejoras más pequeñas; por ejemplo, ahora puede añadir nuevos destinatarios de correo electrónico mediante códigos QR.
id: Perubahan utama dalam rilis ini adalah transisi ke sistem perancangan Material baru Android. Material telah membuat pengembang aplikasi menjadi lebih mudah, dengan dapat dikatakan, keterampilan desain "minimalis" (seperti saya) untuk membuat aplikasi yang lebih bagus. I2P Android juga memperbarui router I2P yang mendasarinya ke versi 0.9.17 yang baru dirilis. Bote menghadirkan beberapa fitur baru seiring dengan banyak perbaikan yang lebih kecil; Sebagai contoh, Anda sekarang dapat menambahkan tujuan email baru melalui kode QR.

source: The fingerprint (SHA-256) of the new signing key is:
es: La huella de validación (SHA-256) de la nueva clave de firmado es:
id: Sidik jari (SHA-256) dari kunci penanda-tangan yang baru adalah:
