Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Fix major i2psnark DHT bug that prevented magnets from working well
es: Arregla un fallo importante de la (tabla de hash distribuida) DHT de I2PSnark que evitaba que los enlaces magnet funcionaran bien
id: Memperbaiki bug besar di DHT i2psnark yang mencegah magnet untuk bekerja dengan baik

source: Fix client tunnels that fail due to name resolution failure at startup, particularly with b32 hostnames
es: Arregla túneles cliente que fallaban debido a un error en la resolución de nombres al iniciar, particularmente con nombres de equipos b32
id: Memperbaiki tunnel klien yang gagal karena kegagalan resolusi nama saat startup, terutama dengan hostname b32

source: Fix changing client i2ptunnel target list
es: Arregla el cambio de lista de objetivos I2PTunnel cliente
id: Memperbaiki pengubahan daftar target klien i2ptunnel

source: Fix major bugs preventing reception of encrypted responses to leaseset lookups and verifies
es: Arregla fallos importantes que evitaban la recepción de respuestas cifradas a búsquedas de LeaseSets y verificaciones
id: Memperbaiki bug besar yang mencegah penerimaan respon terenkripsi terhadap pencarian leaseset dan verifikasi

source: Fix bad links on some i2psnark buttons in Opera and text-mode browsers
es: Arregla enlaces erróneos en algunos botones I2PSnark en Opera y navegadores en modo-texto
id: Memperbaiki link buruk pada beberapa tombol i2psnark di Opera dan browser modus teks

source: Fix NPE in Susimail
es: Arregla la NPE (excepción de puntero nulo) en SusiMail
id: Memperbaiki NPE di Susimail

source: Start work on supporting stronger signing keys in the router
es: Inicia trabajo para soportar claves de firmado más fuertes en el router
id: Mulai mengerjakan dukungan signing key yang kuat di router

source: Reduce thread usage for HTTP Server tunnels
es: Reduce el uso del hilos de ejecución para túneles de servidor HTTP
id: Mengurangi penggunaan thread di server tunnel HTTP

source: Auto-stop update torrent after some time
es: Auto-detener actualización de torrents tras cierto tiempo
id: Auto-stop update torrent setelah beberapa waktu

source: Add ability to stop webapp via console
es: Añade capacidad de detener la aplicación web mediante consola
id: Menambahkan kemampuan untuk menghentikan webapp melalui console

source: New POST throttler in HTTP server tunnel
es: Nuevo regulador de llamadas POST en túneles de servidor HTTP
id: Pengurangan POST baru di server tunnel HTTP

source: Improve connection throttling
es: Mejora el regulado de la conexión
id: Memperbaiki koneksi throttling

source: More work to reduce number of connections
es: Más trabajo para reducir el número de conexiones
id: Lebih banyak pekerjaan untuk mengurangi jumlah koneksi

source: Re-enable router info expiration job
es: Re-habilita la tarea para la expiración de la información del router
id: Mengaktifkan ulang router info pekerjaan kadaluarsa

source: Extend router info expiration and other changes to reduce load on floodfills
es: Extiende la expiración de la información del router y otros cambios para reducir la carga durante las inundaciones de red
id: Memperpanjang kadaluarsa router info dan perubahan lain untuk mengurangi beban pada floodfills

source: Support multiple servers through a single server tunnel
es: Soporta múltiples servidores a través de un único túnel de servidor
id: Mendukung beberapa server melalui sebuah tunnel server tunggal

source: Support specification of server port in i2ptunnel clients
es: Soporta la configuración de un puerto de servidor en clientes I2PTunnel
id: Dukungan spesifikasi port server di klien i2ptunnel

source: Add support for SSL connections from i2ptunnel to external server
es: Añade soporte para conexiones SSL desde I2PTunnel hacia servidor externo
id: Menambahkan dukungan untuk koneksi SSL dari i2ptunnel ke server eksternal

source: SSL and crypto code refactoring
es: Refactorización del código SSL y de criptografía
id: refactoring SSL dan kode kripto

source: i2psnark storage code refactoring
es: Refactorización del código del almacenamiento de I2PSnark
id: refactoring kode penyimpanan i2psnark

source: New destination cache
es: Caché de nuevo destino
id: Cache destinasi baru

source: Lots of code cleanup and resolution of findbugs warnings
es: Mucho acicalamiento del código y resolución de advertencias por fallos encontrados
id: Banyak pembersihan kode dan penyelesaian peringatan di findbugs

source: New Japanese translation (partial)
es: Nueva traducción al japonés (parcial)
id: Terjemahan baru bahasa Jepang (sebagian)

source: Translation updates: French, German, Italian, Romanian, Russian, Spanish, Swedish, and others
es: Actualización de traducciones: francés, alemán, italiano, rumano, ruso, español, sueco, y otros
id: Pembaruan terjemahan: Perancis, Jerman, Italia, Rumania, Rusia, Spanyol, Swedia, dan lainnya.

source: Wrapper 3.5.22 (new installs and PPA only)
es: Wrapper 3.5.22 (sólo nuevas instalaciones y PPA)
id: Wrapper 3.5.22 (hanya untuk instalasi baru dan PPA)

source: ===================== Syndie 1.105b Release =====================
es: ===================== Syndie versión 1.105b =====================
id: ===================== Rilis Syndie 1.105b =====================

source: Update to HSQLDB 2.3.1
es: Actualizar a HSQLDB 2.3.1
id: Pembaruan ke HSQLDB 2.3.1

source: This is the first stable release since February 2013. It is essentially the same as 1.104b-7-rc, with some translation updates.
es: Esta es la primera versión estable desde febrero de 2013. Es esencialmente la misma que 1.104b-7-rc, con algunas actualizaciones de la traducción.
id: Adalah rilis stable pertama sejak Februari 2013. Hal ini pada dasarnya sama dengan 1.104b-7-rc, dengan beberapa update terjemahan.

source: All binaries and source packages are at `syndie.de`_ and `syndie.i2p`_. Plugins are available at `plugins.i2p`_ and `stats.i2p`_.
es: Todos los binarios y los paquetes de código fuente están en `syndie.de`_ y `syndie.i2p`_. Los complementos están disponibles en `plugins.i2p`_ and `stats.i2p`_.
id: Semua paket binari dan sumber kode ada di `syndie.de`_ dan `syndie.i2p`_. Plugins tersedia di `plugins.i2p`_ dan `stats.i2p`_.

source: For those of you upgrading from 1.103b, you will find syndie startup and shutdown much faster due to the new version of HSQLDB.
es: Para aquellos que están actualizando desde la versión 1.103b, encontrará el inico y el cierre de Syndie mucho más rápido debido a la nueva versión de HSQLDB.
id: Bagi Anda yang memperbarui dari 1.103b, Anda akan menemukan syndie startup dan shutdown yang jauh lebih cepat karena versi baru dari HSQLDB.

source: If you have a large database or an identity you wish to preserve, you may wish to back up your entire ~/.syndie directory before you start. The upgrade process does make its own backup, however you may find it easier to use your own backup if the upgrade fails.
es: Si tiene una base de datos grande o una identidad, puede querer preservarla, puede que desee hacer una copia de seguridad de su directorio ~/.syndie completo antes de iniciar. El proceso de actualización hace su propia copia de seguridad, sin embargo puede que encuentre más fácil usar su propia copia de respaldo si la actualización falla.
id: Jika Anda memiliki database besar atau ada identitas yang ingin disimpan, Anda mungkin ingin mencadangankan seluruh direktori ~/.syndie Anda sebelum Anda mulai. Proses pembaruan membuat cadangan sendiri, namun Anda mungkin akan lebih mudah untuk menggunakan cadangan Anda sendiri jika pembaruan gagal.

source: Upgrades from 1.103b may fail for some people due to database corruption due to bugs in the old HSQLDB. Unfortunately, we don't know how to fix it. Your alternatives are to start over with a clean database, or stay with 1.103b forever. Sorry about that.
es: Las actualizaciones desde la 1.103b puede que fallen para algunas personas debido a corrupción de la base de datos provocada por fallos en el antiguo HSQLDB. Desafortunadamente, no sabemos cómo repararlo. Sus alternativas son iniciar de nuevo con una base de datos limpia, o permanecer con la versión 1.103b para siempre. Lo sentimos por ello.
id: Pembaruan dari 1.103b mungkin gagal untuk beberapa orang karena korupsi database karena bug di HSQLDB lama. Sayangnya, kita tidak tahu bagaimana memperbaikinya. Alternatifnya adalah untuk memulai lagi dengan database bersih, atau tetap dengan 1.103b selamanya. Maaf tentang itu.

source: As usual, we recommend that you update to this release. The best way to maintain security and help the network is to run the latest release.
es: Como es habitual, le recomendamos que actualice a esta versión. La mejor manera de mantener la seguridad y ayudar a la red es ejecutar la última versión.
id: Seperti biasanya, kami merekomendasikan agar Anda memperbarui ke rilis ini. Cara terbaik mempertahankan keamanan dan membantu jaringan adalah menjalankan rilis terbaru.

source: GUI Improvements and Fixes
es: Mejoras y reparaciones en la GUI (interfaz gráfica de usuario)
id: Perbaikan GUI dan perbaikan

source: Syndication
es: Sindicación
id: Sindikasi

source: New translations
es: Nuevas traducciones
id: Terjemahan baru

source: Translation updates
es: Actualizaciones de traducción
id: Pembaruan terjemahan

source: ============== 0.9.10 Release ==============
es: ============== Versión 0.9.10 ==============
id: ============== Rilis 0.9.10 ==============

source: 0.9.10 changes the mechanism for doing LeaseSet lookups, making it more difficult for an attacker to correlate a Destination with a Router.
es: La versión 0.9.10 cambia el mecanismo para hacer búsquedas de LeaseSets (túneles a un mismo destino), poniéndole más difícil a una atacante relacionar un destino con un router I2P.
id: 0.9.10 mengubah mekanisme untuk melakukan pencarian LeaseSet, membuatnya lebih sulit bagi penyerang untuk mengkorelasikan Destinasi dengan Router.

source: 0.9.10 changes the mechanism for doing LeaseSet lookups, making it more difficult for an attacker to correlate a Destination with a Router. It also fixes character encoding bugs in susimail, and includes lots of other bug fixes and translation updates. Most of you will update via torrent, using the new "su3" update format with stronger keys.
es: La versión 0.9.10 cambia el mecanismo para hacer búsquedas de LeaseSets, poniéndole más difícil a un atacante relacionar un destino con un router I2P. También arregla fallos en la codificación de caracteres de Susimail, e incluye muchas otras reparaciones de fallos y actualizaciones de la traducción. La mayoría de ustedes actualizarán vía torrent, usando el nuevo formato de actualización "su3" con claves más fuertes.
id: 0.9.10 mengubah mekanisme untuk melakukan pencarian LeaseSet, membuatnya lebih sulit bagi penyerang untuk mengkorelasikan Destinasi dengan Router. Juga perbaikan bug encoding karakter di susimail, dan mencakup banyak perbaikan bug dan pembaruan terjemahan lainnya. Sebagian besar dari Anda akan memperbarui melalui torrent, menggunakan format update "su3" yang baru dengan key yang kuat.

source: Use client tunnels for LeaseSet lookups
es: Usa túneles de cliente para búsquedas de LeaseSets
id: Menggunakan client tunnel untuk pencarian LeaseSet

source: Flood netdb stores to new location before midnight to prevent lookup fails after midnight
es: Inunda almacenamientos netDb en ubicaciones nuevas antes de medianoche, para prevenir fallos en las búsquedas después de medianoche
id: Flood netdb menyimpan ke lokasi baru sebelum tengah malam untuk mencegah lookup gagal setelah tengah malam

source: Fix setting I2CP host/port in BOB
es: Repara la configuración equipo/puerto de I2CP en BOB
id: Memperbaiki pengaturan I2CP host/port di BOB

source: Fix several character encoding issues in susimail
es: Repara varios problemas con la codificación de caracteres en Susimail
id: Memperbaiki beberapa masalah character encoding di susimail

source: Fix StandardServerSocket.close()
es: Repara StandardServerSocket.close()
id: Memperbaiki StandardServerSocket.close()

source: Fix exception in PrivateKeyFile
es: Repara una excepción en PrivateKeyFile
id: Memperbaiki exeption di PrivateKeyFile

source: Fixes in RouterInfo expiration task
es: Varias reparaciones en la tarea de expiración de la RouterInfo
id: Perbaikan dalam RouterInfo expiration task

source: Tweaks to reduce number of peer connections
es: Ajustes para reducir el número de conexiones entre pares ('peers')
id: Perbaikan untuk mengurangi jumlah koneksi peer

source: Several threading fixes to reduce blocking in the timer queues
es: Varias reparaciones en la creación de hilos para reducir el bloqueo en las colas con periodo de expiración
id: Beberapa perbaikan threading untuk mengurangi blocking di antrian timer

source: Disable streaming ping handling for clients
es: Deshabilita la gestión del ping de la transmisión tipo streaming para los clientes
id: Menonaktifkan penanganan ping streaming untuk klien

source: Use i2psnark's Kademlia library for the router netdb also
es: Usa la librería Kademlia de I2PSnark también para la netDb del router I2P
id: Menggunakan library i2psnark's Kademlia untuk router netdb juga

source: Increase outbound exploratory default to 2 + 0-1 hops, part of gradual increase to 3 hops in/out
es: Incrementa en 2 + 0-1 los saltos exploratorios salientes, como parte de un incremento gradual de 3 saltos entrantes/salientes
id: Meningkatkan default untuk outbound exploratory ke 2 + 0-1 hop, sebagian dari peningkatan bertahap 3 hop masuk/keluar

source: More findbugs fixes
es: Más reparaciones de fallos detectados por FindBugs
id: Tambahan perbaikan findbugs

source: Support country-specific translations
es: Soporte para traducciones específicas-para-países
id: Dukungan terjemahan negara spesifik

source: New Brazilian Portuguese translation
es: Nueva traducción de portugués de Brasil
id: Terjemahan baru untuk Portugis Brasil

source: ============== 0.9.11 Release ==============
es: ============== Versión 0.9.11 ==============
id: ============== Rilis 0.9.11 ==============

source: 0.9.11 adds support for outproxy plugins, improves lease set lookup security, and reduces memory usage.
es: La versión 0.9.11 añade soporte para complementos de outproxy, mejora la seguridad para las búsquedas de lease sets, y reduce el uso de memoria.
id: 0.9.11 menambahkan dukungan untuk plugin outproxy, meningkatkan keamanan lease set lookup, dan mengurangi penggunaan memori.

source: 0.9.11 continues improving LeaseSet lookup and storage to prevent an attacker from correlating a Destination with a Router. It adds support for the %(orchid)s outproxy plugin which is available at %(url)s. There is a reduction in memory usage due to fixes in the transports. We have some I2CP protocol improvements that will provide better lookup facilities and authorization protection for external clients. Of course, there's also the usual collection of bug fixes. All users should update.
es: La versión 0.9.11 continúa mejorando la búsqueda de LeaseSets y el almacenamiento para prevenir que un atacante correlacione un destino con un router I2P. Añade soporte para el complemento de outproxy %(orchid)s que está disponible en %(url)s. Hay una reducción en el uso de memoria debido a la reparación de fallos en los transportes. Tenemos algunas mejoras del protocolo I2CP que proporcionarán mejores capacidades de búsqueda y protección de autorización para clientes externos. Por supuesto, también está la colección habitual de reparaciones de fallos. Todos los usuarios deben actualizar.
id: 0.9.11 terus meningkatkan LeaseSet lookup dan penyimpanan untuk mencegah penyerang melakukan korelasi Destinasi dengan Router. Menambahkan dukungan untuk plugin outproxy %(orchid)s yang tersedia di %(url)s. Ada penurunan dalam penggunaan memori karena perbaikan di transport. Kami melakukan beberapa perbaikan protokol I2CP yang akan memberikan fasilitas lookup yang lebih baik dan perlindungan otorisasi untuk klien eksternal. Tentu saja, ada juga beberapa perbaikan bug rutin. Semua pengguna harus melakukan pembaruan.

source: This may be the last release that works with Java 5, which is very old and unsupported. If you are using a Java 5 or 6 runtime, we strongly recommend that you upgrade to Java 7.
es: Esta puede que sea la última versión que funcione con Java 5, que es muy antigua y no tiene soporte. Si está usando un entorno de ejecución ('runtime') Java 5 o 6, le recomendamos con énfasis que actualice a Java 7.
id: Ini mungkin rilis terakhir yang menggunakan Java 5, yang sudah sangat tua dan tidak didukung. Jika Anda menggunakan runtime Java 5 atau 6, kami sangat menyarankan Anda memperbarui ke Java 7.

source: As usual, we recommend that you update to this release. The best way to maintain security and help the network is to run the latest release.
es: Como es habitual, recomendamos que actualice a esta versión. La mejor manera de mantener la seguridad y ayudar a la red es ejecutar la última versión.
id: Seperti biasanya, kami merekomendasikan agar Anda memperbarui ke rilis ini. Cara terbaik untuk mengelola keamanan dan bantuan pada jaringan adalah dengan menjalankan rilis terbaru.

source: More leaseset handling improvements
es: Más mejoras en el manejo de LeaseSets.
id: Lebih banyak perbaikan penanganan leaseset

source: Fix NPE after client shutdown
es: Reparación de la NPE (excepción de puntero nulo) tras el cierre del cliente
id: Memperbaiki NPE setelah shutdown klien

source: Fix wrapper log encoding on logs page
es: Reparación de la codificación del registro ('log') del encapsulador ('wrapper') en la página de logs
id: Memperbaiki pengkodean log wrapper pada halaman log

source: Streaming ping and I2Ping fixes
es: Reparaciones en el ping del transporte streaming y en I2Ping
id: Perbaikan streaming ping dan I2Ping

source: Add support for Orchid plugin
es: Adición de soporte para el complemento Orchid
id: Menambahkan dukungan untuk plugin Orchid

source: Add HTTPS support to HTTP client proxy
es: Adición de soporte HTTPS para el proxy del cliente HTTP
id: Menambahkan dukungan proxy klien HTTP

source: New I2CP support for hostname lookups by external clients
es: Nuevo soporte I2CP de búsquedas de nombres de equipo por los clientes externos
id: Dukungan I2CP baru untuk pencarian nama host oleh klien eksternal

source: Stricter I2CP authorization enforcement of external clients (incompatible change)
es: Aplicación más estricta de autorización I2CP de los clientes externos (cambio incompatible)
id: penegakan otorisasi I2CP lebih ketat dari klien eksternal (perubahan tidak kompatibel)

source: Increase default inbound exploratory tunnel length variance
es: Incremento del margen de divergencia de la longitud de túnel exploratorio entrante
id: Meningkatkan varians dari panjangnya default inbound exploratory tunnel

source: Big reduction in memory usage by transports
es: Gran reducción del uso de memoria por los transportes
id: Pengurangan besar di penggunaan memori oleh Transport

source: All in-net updates via torrent
es: Todas las actualizaciones en-red a través de torrent
id: Semua pembaruan via jaringan melalui torrent

source: ========================= Malware at i2pbrowser.net =========================
es: ========================= Malware en i2pbrowser.net =========================
id: ========================= Malware di i2pbrowser.net =========================

source: The site i2pbrowser.net is a fake I2P website mirror serving up malware for Windows.
es: El sitio i2pbrowser.net sirve malware para Windows, es una réplica falsa del sitio web de I2P.
id: Situs I2pbrowser.net adalah situs palsu I2P situs yang menyebarkan malware untuk Windows.

source: We have recently been made aware of the existence of i2pbrowser.net. This website copies our homepage and download page, and attempts to trick users into downloading Windows malware.
es: Recientemente hemos sido advertidos de la existencia de i2pbrowser.net. Este sitio web reproduce nuestra página principal y nuestra página de descargas, e intenta engañar a los usuarios para que descarguen malware para Windows.
id: Kami baru-baru baru tahu keberadaan i2pbrowser.net. Situs ini menyalin halaman homepage dan download kami, serta berusaha untuk menipu pengguna untuk mengunduh Windows malware.

source: There are several indicators that point to i2pbrowser.net being a malware site:
es: Hay varios indicadores que delatan a i2pbrowser.net como un sitio de malware:
id: Ada beberapa indikasi yang mengarah ke i2pbrowser.net adalah sebuah situs malware:

source: The domain was registered on February 10th, 2014.
es: El dominio está registrado el 10 de febrero de 2014.
id: Domain ini terdaftar pada tanggal 10 Februari tahun 2014.

source: The download URLs for Windows, Mac OSX, Linux, Android etc. all link to the same .exe file.
es: Las URLs de descarga para Windows, Mac OSX, Linux, Android, etc. todas enlazan al mismo fichero .exe
id: Semua URL unduh untuk Windows, Mac OSX, Linux, Android, dll mentaut ke file .exe yang sama.

source: The .exe is only 741 KB; the official Windows installer for I2P is 13 MB.
es: El .exe tiene sólo 741 KB; el instalador oficial de I2P para Windows es de 13 MB.
id: FIle .exe hanya sebesar 741 KB; Windows installer resmi untuk I2P adalah sebesar 13 MB.

source: ============== 0.9.12 Release ==============
es: ============== Versión 0.9.12 ==============
id: ============== Rilis 0.9.12 ==============

source: 0.9.12 adds support for ECDSA and updates to Jetty 8
es: La versión 0.9.12 añade soporte para ECDSA y actualizaciones a Jetty 8
id: 0.9.12 menambahkan dukungan untuk ECDSA dan update ke Jetty 8

source: I2P now requires Java 6 or higher. We strongly recommend that you upgrade to Java 7. If you are still using Java 5, you must upgrade your Java before installing I2P 0.9.12.
es: I2P ahora requiere Java 6 o superior. Le recomendamos firmemente que actualice a Java 7. Si aún está usando Java5, debe actualizar su Java antes de instalar I2P 0.9.12.
id: I2p sekarang memerlukan Java 6 atau lebih tinggi. Kami sangat menyarankan Anda memperbarui ke Java 7. Jika Anda masih menggunakan Java 5, Anda harus memperbarui Java Anda sebelum menginstal I2P 0.9.12.

source: 0.9.12 adds preliminary support for ECDSA-signed Destinations. It contains several fixes for the handling of Delivery Status Messages (acknowledgements) and those messages are now end-to-end encrypted for increased security.
es: La versión 0.9.12 añade soporte preliminar para destinos firmados-con-ECDSA. Contiene varias reparaciones para el manejo de mensajes de estado de entrega (acuses de recibo) y estos mensajes ahora se cifran de extremo-a-extremo para mejorar la seguridad.
id: 0.9.12 menambahkan dukungan awal untuk destinasi ECDSA-signed. Ini berisi beberapa perbaikan untuk penanganan Pesan Status Pengiriman (acknowledgements) dan pesan tersebut sekarang dienkripsi end-to-end untuk peningkatan keamanan.

source: We have upgraded to Jetty 8. Jetty 8 is almost identical to Jetty 7, so there are no complex configuration file conversions as there have been in past Jetty upgrades. No manual changes should be necessary.
es: Hemos actualizado a Jetty 8. Jetty 8 es casi idéntico a Jetty 7, así que no hay complejas conversiones de ficheros de configuración como ha habido en anteriores actualizaciones de Jetty. No debería ser necesario ningún cambio manual.
id: Kami telah memperbarui ke Jetty 8. Jetty 8 hampir identik dengan Jetty 7, sehingga ada tidak ada konversi file konfigurasi yang rumit seperti yang ada di pembaruian Jetty masa lalu. Tidak ada perubahan manual yang diperlukan.

source: Encrypt Delivery Status Messages
es: Cifra mensajes de estado de entrega
id: Mengenkripsi Pesan Status Pengiriman
