Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: This unscheduled release disables the RouterInfo verification messages that were used in the attack published in the UCSB paper, which should make correlating a LeaseSet and a Router much more difficult. We have also included a limited number of other fixes listed below. Our 0.9.8 release, which will include IPv6 support, is still on-schedule for late September.
es: Esta versión no programada desactiva los mensajes de verificación RouterInfo que se usaron en el ataque publicado en el estudio de UCSB, que debería hacer que sea mucho más difícil relacionar un LeaseSet y un Ruter. También hemos incluido un número limitado de mejoras, listadas más abajo. Nuestra versión 0.9.8, la cual incluirá soporte para IPV6, está prevista para finales de Septiembre.
id: Rilis tidak terjadwal ini menonaktifkan pesan verifikasi RouterInfo yang digunakan dalam serangan yang diterbitkan di makalah UCSB, yang seharusnya membuat korelasi LeaseSet dan Router jauh lebih sulit. Kami juga telah menyertakan sejumlah perbaikan yang tercantum di bawah ini. Rilis 0.9.8, yang akan menyertakan dukungan IPv6, masih terjadwal untuk akhir September.

source: As usual, we recommend that all users update to this release.
es: Como siempre, recomendamos que todos los usuarios se actualicen a esta versión.
id: Seperti biasa, kami merekomendasikan bahwa semua pengguna memperbarui ke rilis ini.

source: Disable RouterInfo verification messages
es: Desactivados los mensajes de verificación RouterInfo
id: Menonaktifkan pesan verifikasi RouterInfo

source: Extend inbound tunnel expiration
es: Aumentado el tiempo de caducidad de los túneles de entrada
id: Memperpanjang kadaluarsa tunnel inbound

source: i2prouter: bashism fix
es: i2prouter: arreglo de bashism
id: i2prouter: memperbaiki bashism

source: i2psnark: increase max piece size, mime type updates
es: i2psnark: aumentado el tamaño máximo de cada cacho, actualizaciones de los mimetypes
id: i2psnark: meningkatkan ukuran maks potongan, pembaruan tipe mime

source: New reseed host
es: Nuevo servidor de resiembra
id: Host reseed baru

source: New update hosts, thanks Meeh and dg
es: Nuevo servidor de actualizaciones, gracias a Meeh y dg
id: Host update baru, terima kasih kepada Meeh dan dg

source: Streaming: RTO changes
es: Streaming: cambios en RTO
id: Streaming: perubahan RTO

source: Updater: Increase update-via-torrent to 30 percent
es: Actualizador: Aumento de las actualizaciones a través de torrents al 30 porcent
id: Updater: Meningkatkan pembaruan melalui torrent menjadi 30 persen

source: UPnP fix for some hardware
es: Arreglo de UPnP para algunos sistemas
id: Perbaikan UPnP untuk beberapa hardware

source: 0.9.8 Release
es: Versión 0.9.8
id: 0.9.8 Rilis

source: 0.9.8 includes the long-awaited support for IPv6. It's enabled by default, but of course you need a public IPv6 address to use it. Configuration is on the 'network' configuration tab in your console. We also have anonymity improvements including padding of SSU packets and longer router private keys.
es: La versión 0.9.8 incluye el largamente esperado soporte para IPv6. Está habilitado por defecto, pero por supuesto necesita una dirección IPv6 pública para usarlo. La configuración está en la pestaña de configuración 'red' en su consola. También tenemos mejoras en el anonimato, incluyendo el uso de datos de relleno en los paquetes SSU (UDP seguro semiconfiable) y claves privadas de router más largas.
id: 0.9.8 termasuk dukungan untuk IPv6 yang lama ditunggu-tunggu. Diaktifkan secara default, tapi tentu saja Anda perlu alamat IPv6 publik untuk menggunakannya. Konfigurasi ada pada tab konfigurasi 'jaringan' di console Anda. Kami juga memiliki perbaikan anonimitas termasuk padding SSU paket dan private key router yang lebih panjang.

source: 30%(pc)s of you will update via in-network torrent in this update cycle.
es: El 30%(pc)s de ustedes actualizará mediante torrent interno-a-la-red para esta actualización.
id: 30%(pc)s dari anda akan melakukan pembaruan dengan torrent dalam jaringan di siklus pembaruan ini.

source: IPv6 Details
es: Detalles de IPv6
id: Detail IPv6

source: IPv6 is enabled and preferred by default. If you have a public IPv6 address and you are connecting to another router with a published IPv6 address, it will connect via IPv6. There is a new IPv6 configuration section on /confignet in the router console. If IPv6 is causing problems you may disable it there.
es: IPv6 está habilitado y es preferido por defecto. Si tiene una dirección IPv6 pública y se está conectando a otro router con una dirección IPv6 publicada, se conectará mediante IPv6. Hay una nueva sección de configuración de IPv6 en /confignet en la consola del router. Si IPv6 está causando problemas puede deshabilitarlo allí.
id: IPv6 diaktifkan dan dipilih secara default. Jika Anda memiliki alamat IPv6 publik dan Anda berhubungan dengan router lain dengan alamat IPv6 diterbitkan, ini akan terhubung melalui IPv6. Ada bagian konfigurasi IPv6 baru di /confignet di router console. Jika IPv6 menyebabkan masalah, Anda dapat menonaktifkannya di sana.

source: As a part of the IPv6 development effort, I2P now supports multiple published IP addresses. If you have multiple public IP addresses (IPv4, IPv6, or both), you may enable or disable them individually on /confignet. The default is to use the first IPv4 and IPv6 addresses it discovers. If you have multiple addresses you should review the configuration on /confignet and adjust it if necessary. Note that while you may enable multiple IPv4 and IPv6 addresses on /confignet, we recommend that you use only one IPv4 and one IPv6 address. There are bugs still to be fixed with multiple addresses of each type.
es: Como una parte del esfuerzo de desarrollo para IPv6, I2P ahora soporta múltiples direcciones IP publicadas. Si tiene múltiples direcciones IP públicas (IPv4, IPv6, o ambas), puede habilitarlas o deshabilitarlas individualmente en /confignet. La configuración por defecto es usar las primeras direcciones IPv4 e IPv6 que descubra. Si tiene múltiples direcciones debe revisar la configuración en /confignet y ajustarla si fuera necesario. Observe que aunque pueda habilitar múltiples direcciones IPv4 e IPv6 en /confignet, le recomendamos que sólo use una dirección IPv4 y una IPv6. Todavía hay fallos por arreglar con direcciones múltiples de cada tipo.
id: Sebagai bagian dari usaha pengembangan IPv6, I2P sekarang mendukung beberapa alamat IP yang diterbitkan. Jika Anda memiliki beberapa alamat IP publik (IPv4, IPv6, atau keduanya), Anda dapat mengaktifkan atau menonaktifkan semuanya secara individual di /confignet. Secara default, alamat IPv4 dan IPv6 yang digunakan adalah alamat pertama yang ditemukan. Jika Anda memiliki beberapa alamat, Anda harus meninjau konfigurasi pada /confignet dan menyesuaikannya jika diperlukan. Perhatikan bahwa walau Anda dapat mengaktifkan beberapa alamat IPv4 dan IPv6 di /confignet, kami menyarankan agar Anda menggunakan satu IPv4 dan satu alamat IPv6. Masih ada bug yang harus diperbaiki di beberapa alamat di setiap jenis.

source: While IPv6 support was designed and developed over several years, it has only been tested by a limited number of users and is still beta. If you do have a public IPv6 address, please monitor your router and the logs for problems, and disable it necessary. Please report any bugs on http://trac.i2p2.i2p.
es: Aunque el soporte IPv6 fue diseñado y desarrollado durante varios años, sólo ha sido probado por un limitado número de usuarios y todavía está en beta. Si no tiene una dirección IPv6 pública, por favor monitorice su router y los logs (registros) en busca de problemas, y deshabilítelo si fuera necesario. Por favor informe en http://trac.i2p2.i2p de cualquier fallo.
id: Walau dukungan IPv6 dirancang dan sudah dikembangkan selama beberapa tahun, ini hanya telah diuji oleh sejumlah pengguna dan masih beta. Jika Anda memiliki alamat IPv6 publik, mohon pantau router dan log Anda untuk jika ada masalah, dan menonaktifkannya jika diperlukan. Laporkan bug pada http://trac.i2p2.i2p.

source: Rekeying Details
es: Detalles de la renovación de claves
id: Detail melakukan rekey

source: For those of you running I2P on faster hardware (generally, 64-bit x86) the router will generate a new identity using longer keys. This will substantially reduce your participating traffic for 48 hours or more, while your router re-integrates into the network. Due to the new keys, the large number of torrent updates, and the recent network growth, we expect substantial disruption to the network for a week or more after the update is released. Please be patient and things should start to improve after a few days.
es: Para aquellos que ejecuten I2P en un hardware más rápido (generalmente x86 de 64-bits) el router generará una nueva identidad usando claves más largas. Esto reducirá sustancialmente su tráfico participante durante 48 horas o más, mientras su router se re-integra en la red. Debido a las nuevas claves, el gran número de actualizaciones mediante torrent, y el reciente crecimiento de la red, esperamos una perturbación sustancial de la red durante la próxima semana o más después de que la actualización sea publicada. Por favor sea paciente, las cosas deberían comenzar a mejorar tras unos pocos días.
id: Bagi Anda yang menjalankan I2P pada hardware yang lebih cepat (umumnya, 64-bit x86) router akan menghasilkan identitas baru menggunakan key yang lebih panjang. Ini secara substansial akan mengurangi participating traffic anda selama 48 jam atau lebih, sementara router Anda kembali terintegrasi ke dalam jaringan. Karena key baru, sejumlah besar pembaruan torrent, dan pertumbuhan jaringan saat ini, kami mengharapkan gangguan substansial ke jaringan selama seminggu atau lebih setelah update dirilis. Harap bersabar dan hal-hal seharusnya mulai membaik setelah beberapa hari.

source: These changes may result in higher CPU usage for some of you. We're doing our best to increase efficiency, but stronger security generally requires more computation. Performance may also be poor during the first week due to the network churn. We will evaluate the network performace before deciding whether to change the key length on slower hardware in a future release.
es: Estos cambios pueden resultar en mayor uso de la CPU para algunos de ustedes. Estamos dando lo mejor de nosotros para incrementar la eficiencia, pero una mayor seguridad generalmente requiere más computación. El rendimiento también puede ser pobre durante la primera semana debido a la agitación de la red. Evaluaremos el rendimiento de la red antes de decidir si cambiar la longitud de la clave sobre hardware más lento en una futura versión.
id: Perubahan ini dapat mengakibatkan penggunaan CPU yang lebih tinggi untuk beberapa orang. Kami sedang melakukan hal yang terbaik untuk meningkatkan efisiensi, tetapi keamanan lebih kuat biasanya membutuhkan lebih banyak komputasi. Kinerja juga mungkin akan menurun selama minggu pertama karena churn jaringan. Kami akan mengevaluasi kinerja jaringan sebelum memutuskan apakah akan mengubah panjangnya key pada hardware yang lebih lambat di masa mendatang.

source: We are experiencing rapid network growth in the last few weeks, which is causing a bit of a bumpy ride for some, especially on weekends. However, the network is still performing fairly well, so keep spreading the word.
es: Estamos experimentando un rápido crecimiento de la red en las últimas semanas, lo que está causando que el trayecto sea un poco accidentado para algunos, especialmente en fines de semana. Sin embargo la red está rindiendo bastante bien, así que siga extendiendo el mensaje.
id: Kita mengalami pertumbuhan jaringan yang cepat dalam beberapa minggu terakhir, yang menyebabkan sedikit gangguan untuk beberapa orang, terutama pada akhir pekan. Namun, Jaringan adalah masih cukup baik, sehingga terus sebarluaskan I2P.

source: More Changes Coming
es: Más cambios en camino
id: Perubahan lebih banyak akan datang

source: We're in the initial stages of desiging major changes to strengthen our crypto. Stronger crypto will use more CPU and it may possibly require a Java 7 JRE at a minimum. We understand your desire to run I2P on low-power and/or older hardware. We're working hard to minimize the impacts, but some loss of performance is inevitable. In addition, Java 5 and 6 are no longer supported by Oracle. Now is a good time to upgrade to Java 7. Any change in minimum requirements will be announced well in advance.
es: Estamos en las etapas iniciales del diseño de cambios importantes para fortalecer nuestra criptografía. Una criptografía más fuerte usará más CPU y posiblemente puede requerir un Java 7 JRE (entorno de ejecución) al mínimo. Comprendemos su deseo de ejecutar I2P en hardware de menor consumo y/o más antiguo. Estamos trabajando duro para minimizar los impactos, pero cierta pérdida de rendimiento es inevitable. Además, Java 5 y 6 ya no están soportados por Oracle. Ahora es un buen momento para actualizar a Java 7. Cualquier cambio en los requisitos mínimos será anunciado con una buena antelación.
id: Kita berada di tahap awal dari mendesain perubahan besar dalam memperkuat kripto kami. Kripto kuat akan menggunakan CPU lebih banyak dan mungkin mungkin memerlukan minimal Java 7 JRE. Kami memahami keinginan Anda untuk menjalankan I2P pada hardware berdaya rendah dan/atau lebih tua. Kami sedang bekerja keras untuk meminimalkan dampak ini, tetapi beberapa penurunan kinerja tidak dapat dihindari. Selain itu, Java 5 dan 6 tidak didukung lagi oleh Oracle. Sekarang adalah waktu yang baik untuk meng-upgrade ke Java 7. Perubahan persyaratan minimum akan diumumkan jauh-jauh hari.

source: New Website
es: Nuevo sitio web
id: Website baru

source: After a heroic effort by str4d, the new website preview is available at http://i2hq.srv.i2p2.de. We hope to see it go live at https://geti2p.net and http://www.i2p2.i2p soon. Please contribute to the new website translations on Transifex, especially the website_priority resource.
es: Tras un esfuerzo heroico de str4d, en http://i2hq.srv.i2p2.de está disponible una nueva previsualización del sitio web. Esperamos ver su puesta en activo en https://geti2p.net y http://www.i2p2.i2p pronto. Por favor, contribuya con las traducciones del nuevo sitio web en Transifex, especialmente sobre el recurso website_priority.
id: Setelah usaha heroik oleh str4d, pratinjau situs web baru tersedia di http://i2hq.srv.i2p2.de. Kami berharap untuk melihatnya tampil di https://geti2p.net dan http://www.i2p2.i2p segera. Silakan mengkontribusi terjemahan situs baru di Transifex, terutama di sumber daya website_priority.

source: Community Participation
es: Participación de la comunidad
id: Partisipasi komunitas

source: In early August, hottuna and zzz attended DEFCON 21 in Las Vegas. Last weekend, echelon attended the CTS IV conference in Berlin and psi attended the Tahoe-LAFS hackfest at GNU 30 in Cambridge, Mass. Several of us will be at 30C3 in Hamburg late this year. It's great to see people participating at these events and representing I2P.
es: A principios de agosto, hottuna y zzz acudieron al DEFCON 21 en Las Vegas. La última semana, echelon acudió a la conferencia CTS IV en Berlín y psi acudió al Tahoe-LAFS hackfest en GNU30 en Cambridge, Massachussets. Varios de nosotros estaremos en el 30C3 en Hamburgo a finales de este año. Es estupendo ver gente participando en estos eventos y representando a I2P.
id: Di awal Agustus, hottuna dan zzz menghadiri DEFCON 21 di Las Vegas. Akhir pekan kemarin, echelon menghadiri konferensi CTS IV di Berlin dan psi menghadiri Tahoe-LAFS hackfest di GNU 30 di Cambridge, Massachusetts. Beberapa dari kami akan hadir di 30C3 di Hamburg akhir tahun ini. Senang sekali melihat banyak orang ikut acara-acara ini dan mewakili I2P.

source: IPv6 support for both NTCP and SSU
es: Soporte IPv6 para ambos NTCP (TCP basado en NIO) y SSU (UPD seguro semiconfiable)
id: Dukungan IPv6 untuk NTCP dan SSU

source: SSU protocol obfuscation by adding random padding
es: Ofuscación del protocolo SSU mediante el uso de datos aleatorios de relleno.
id: SSU protocol obfuscation dengan menambahkan padding acak

source: Longer encryption and DH private keys for users on faster platforms
es: Claves privadas de cifrado más largas y DH (Diffie-Hellman) para usuarios en plataformas más rápidas
id: Enkripsi lebih panjang dan DH private key untuk pengguna pada platform yang lebih cepat

source: Fix I2PTunnel / I2CP locking and duplicates (partial)
es: Reparación del clausurado y duplicados de I2PTunnel/I2CP (parcial)
id: Memperbaiki I2PTunnel / I2CP mengunci dan duplikat (sebagian)

source: Fix translation of HTTP proxy error pages
es: Reparación de la traducción de páginas de error del proxy HTTP
id: Memperbaiki terjemahan dari halaman error HTTP proxy

source: Fix occasional runtime exception in NTCP
es: Reparación de excepciones ocasionales de tiempo de ejecución en NTCP
id: Perbaiki runtime occasional runtime exception di NTCP

source: Big rework of transport code to accommodate multiple addresses and IPv6
es: Gran remodelación del código de transporte para acomodar múltiples direcciones e IPv6
id: Perubahan besar di transport code untuk mengakomodasi beberapa alamat dan IPv6

source: Streaming: Improved recovery from lost acks, other fixes
es: Streaming: Recuperación mejorada desde ACKs perdidos y otras reparaciones
id: Streaming: Meningkatkan pemulihan dari acks hilang, dan perbaikan lain

source: Use Transifex for translation of initial news and HTTP proxy error pages
es: Use Transifex para la traducción de las noticias introductorias y las páginas de error del proxy HTTP
id: Gunakan Transifex untuk terjemahan berita awal dan halaman error untuk HTTP proxy

source: Translation updates: Chinese, French, German, Portuguese, Russian, Swedish, Turkish
es: Actualizaciones de traducción: Chino, Francés, Alemán, Portugués, Ruso, Sueco, Turco
id: Pembaruan terjemahan: Mandarin, Perancis, Jerman, Portugis, Rusia, Swedia, Turki

source: New Romanian translation
es: Nueva traducción al Rumano
id: Terjemahan baru bahasa Rumania

source: Wrapper 3.5.20 (new installs and PPA only)
es: Wrapper 3.5.20 (sólo nuevas instalaciones y PPA)
id: Wrapper 3.5.20 (hanya untuk instalasi baru dan PPA)

source: 0.9.8.1 Release
es: Versión 0.9.8.1
id: 0.9.8.1 Rilis

source: 0.9.8.1 fixes a problem with updating to 0.9.8 on Windows for some people. New installs and non-Windows platforms are not affected, however all platforms will automatically update even if running 0.9.8.
es: La versión 0.9.8.1 arregla un problemas con la actualización de 0.9.8 en Windows. Las nuevas instalaciones y los sistemas no Windows no están afectados, aún así, todas las plataformas se actualizarán automáticamente incluso si ejecutan 0.9.8.
id: 0.9.8.1 memperbaiki masalah dengan pembaruan ke 0.9.8 pada Windows untuk beberapa orang. Instalasi baru dan platform non-Windows tidak terpengaruh, namun semua platform akan secara otomatis memperbarui bahkan jika menjalankan 0.9.8.

source: Due to recent attacks, logins are disabled on `Trac`_ and new registrations are disabled on `zzz.i2p`_. Until those services are restored, please report all bugs on IRC freenode or IRC2P #i2p-dev.
es: Debido a recientes ataques, los logins están deshabilitados en el `Trac`_ y los nuevos registros están desactivados en `zzz.i2p`_. Hasta que sean restaurados estos servicios, reporte los errores en el IRC freenode o en IRC2P #i2p-dev.
id: Karena serangan baru-baru ini, login dinonaktifkan pada 'Trac'_ dan pendaftaran baru dinonaktifkan pada 'zzz.i2p'_. Sampai layanan tersebut dipulihkan, tolong laporkan semua bug di IRC freenode atau IRC2P #i2p-dev.

source: 0.9.9 Release
es: Versión 0.9.9
id: 0.9.9 Rilis

source: 0.9.9 fixes a number of bugs in the netdb, streaming, and i2ptunnel, and starts work on a year-long plan to increase the strength of the cryptographic signing algorithms used in the router, and support multiple algorithms and key lengths simultaneously. Automatic update files will now be signed with 4096-bit RSA keys.
es: La versión 0.9.9 repara varios de los fallos en la netdb (base de datos de red), streaming (transporte de datos en flujo), y i2ptunnel (túnel I2P), y comienza a trabajar en un plan de por-un-año para incrementar la fortaleza de los algoritmos criptográficos de firma usados en el router, y soportar múltiples algoritmos y longitudes de clave simultáneamente. Los ficheros de actualización automática ahora se firmarán con claves RSA de 4096-bits.
id: 0.9.9 perbaikan beberapa bug di netdb, streaming, dan i2ptunnel, dan mulai membuat rencana setahun untuk meningkatkan kekuatan algoritma penandatanganan kriptografi yang digunakan dalam router, dan mendukung berbagai algoritma dan panjang kunci secara bersamaan. File pembaruan otomatis sekarang akan ditandatangani dengan kunci 4096-bit RSA

source: As usual, we recommend that you update to this release. The best way to maintain security and help the network is to run the latest release. Several members of the I2P team will be at 30C3 in Hamburg this year. Come say hello and ask for an I2P sticker. Thanks to everyone for their support this year.
es: Como es habitual, le recomendamos que actualice a esta versión. La mejor manera de mantener la seguridad y ayudar a la red es ejecutar la última versión. Varios miembros del equipo I2P estarán en el 30C3 en Hamburgo este año. Pase a saludar y pedirnos una pegatina de I2P. Gracias a todos por vuestro soporte este año.
id: Seperti biasanya, kami merekomendasikan agar Anda memperbarui ke rilis ini. Cara terbaik mempertahankan keamanan dan membantu jaringan adalah menjalankan rilis terbaru. Beberapa anggota dari tim I2P akan hadir di 30C3 di Hamburg tahun ini. Datanglah dan minta stiker I2P. Terima kasih kepada semua orang untuk dukungan mereka di tahun ini.

source: Don't build client tunnels through zero-hop exploratory tunnels
es: No construye túneles cliente a través de túneles exploratorios de cero-saltos
id: Jangan membangun tunnel klien melalui zero-hop exploratory tunnel

source: New "su3" file support using stronger keys
es: Nuevo soporte de fichero "su3" que usa claves más fuertes
id: Dukungan baru untuk file "su3" dengan menggunakan kunci yang lebih kuat

source: Use su3 for updates
es: Usa su3 para las actualizaciones
id: Gunakan su3 untuk pembaruan

source: Issues with losing data when closing streams
es: Problemas de pérdida de datos al cerrar streams
id: Masalah data hilang ketika menutup stream

source: Fix various streaming connection limit issues
es: Arregla problemas con el límite para varias conexiones de streaming
id: Memperbaiki beberapa masalah dalam batasan koneksi streaming

source: Issues with resource usage of closed connections
es: Problemas con el uso de recursos de conexiones cerradas
id: Masalah dengan pemakaian sumber daya koneksi tertutup

source: Clean up timer threads in close-on-idle tunnels
es: Ordena los hilos de ejecución de los temporizadores en túneles con cierre-por-inactividad
id: Membersihkan timer thread di close-on-idle tunnels

source: Several other streaming fixes
es: Otros arreglos varias del streaming
id: Beberapa perbaikan streaming

source: Reject more non-public IPv6 addresses
es: Arregla más direcciones IPv6 no-públicas
id: Menolak lebih banyak alamat IPv6 non-publik

source: Fix IPv6 GeoIP
es: Arregla la (geolocalización) GeoIP de IPv6
id: Memperbaiki IPv6 GeoIP

source: Fix peer selection in first minutes after startup
es: Arregla la selección de par ('peer') en los primeros minutos tras el arranque
id: Memperbaiki pemilihan peer di beberapa menit pertama setelah startup

source: Several I2PTunnel bug fixes
es: Arreglos varios de fallos de I2PTunnel
id: Beberapa perbaikan bug I2PTunnel
