Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: es, id

source: Improved strategies for dropping jobs on high job lag to prevent overload
es: Estrategias mejoradas para descartar tareas cuando haya un alto retraso de trabajo, para evitar la sobrecarga
id: Strategi yang lebih baik untuk menjatuhkan pekerjaan pada lag pekerjaan tinggi untuk mencegah kelebihan beban

source: Drop tunnel build requests on high job lag
es: Descarta peticiones de construcción de túneles con altos retrasos de trabajo
id: Menghentikan permintaan pembangunan tunnel pada lag pekerjaan yang tinggi

source: Increase allowed clock skew in I2CP
es: Incrementa la desincronización de reloj permitida en I2CP
id: Peningkatan batas clock skew yang diizinkan di I2CP

source: New HTTP error page when the server resets the connection
es: Nueva página de error HTTP cuando el servidor reinicia la conexión
id: Halaman kesalahan HTTP baru saat server me-reset koneksi

source: Require ECDSA support for floodfill
es: Requiere soporte EcDSA para el router I2P de inundación (floodfill)
id: Mensyaratkan dukungan ECDSA untuk floodfill

source: Republish router info faster when capabilities change
es: Republica la información del router I2P más rápido cuando las capacidades cambian
id: Publish ulang info router menjadi lebih cepat saat kemampuan berubah

source: Better feedback in console for reseed errors
es: Mejora de los mensajes en la consola para los errores de resembrado
id: Umpan balik yang lebih baik di console untuk mendeteksi kesalahan reseed

source: ============== 0.9.20 Release ==============
es: ============== Versión 0.9.20 ==============
id: ============== Rilis 0.9.20 ==============

source: 0.9.20 with performance improvements and bug fixes
es: 0.9.20 con mejoras de rendimiento y correcciones de fallos
id: 0.9.20 dengan perbaikan kinerja dan perbaikan bug

source: 0.9.20 contains many important bug fixes, and several changes to increase floodfill capacity in the network.
es: 0.9.20 contiene reparaciones de muchos fallos importantes, y varios cambios para incrementar la capacidad de inundación (despliegue) en la red.
id: 0.9.20 berisi banyak perbaikan bug yang penting, dan beberapa perubahan untuk meningkatkan kapasitas floodfill di jaringan.

source: Routers configured for 32-64 KB of shared bandwidth may now become floodfill, and routers configured for 512 KB or more of shared bandwidth will have higher connection limits. These changes may cause your router to use more resources. If the router becomes too busy, the best way to reduce usage is to lower the bandwidth settings in your console. If that doesn't help, you may now disable automatic floodfill on the advanced configuration page in the console.
es: Los routers I2P configurados para 32-64 KB de ancho de banda compartido ahora pueden convertirse en routers I2P de inundación (floodfill), y los routers I2P configurados para 512 KB o más ancho de banda compartido tendrán unos mayores límites de conexión. Estos cambios pueden causar que su router I2P use más recursos. Si el router I2P llega a estar demasiado ocupado, la mejor forma de reducir el uso es reducir la configuración de ancho de banda en su consola. Si eso no ayuda, ahora puede deshabilitar automáticamente la característica floodfill en la página de configuración avanzada en la consola.
id: Router yang dikonfigurasi untuk shared bandwidth 32-64 KB sekarang mungkin menjadi floodfill, dan router yang dikonfigurasi untuk 512 KB atau lebih shared bandwidth akan memiliki batas koneksi yang lebih tinggi. Perubahan ini dapat menyebabkan router Anda menggunakan lebih banyak sumber daya. Jika router menjadi terlalu sibuk, cara terbaik untuk mengurangi penggunaan adalah dengan menurunkan pengaturan bandwidth di console Anda. Jika itu tidak berhasil, sekarang Anda dapat menonaktifkan floodfill otomatis di halaman konfigurasi lanjutan di console.

source: We're hopeful that these changes will increase network capacity and performance, and reduce the congestion that's been affecting the network the last three months.
es: Esperamos que estos cambios incrementen la capacidad y rendimiento de la red, y reducir la congestión que ha esta afectando la red los tres últimos meses.
id: Kami berharap bahwa perubahan ini akan meningkatkan kapasitas dan kinerja jaringan, dan mengurangi kemacetan yang telah mempengaruhi jaringan dalam tiga bulan terakhir.

source: Finally, we're excited to announce our first-ever I2P meetup, in Toronto August 15-16. There will be lots of presentations and tutorials. All are welcome. For more information, see the `announcement`_.
es: Finalmente, estamos excitados de anunciar nuestro primer encuentro de I2P de la historia, 15-16 de agosto en Toronto. Habrá montones de presentaciones y tutoriales. Son todos bienvenidos. Para más información, vea el `anuncio`_.
id: Akhirnya, kami dengan senang hati mengumumkan pertemuan I2P pertama kami, di Toronto, 15-16 Agustus. Akan ada banyak presentasi dan tutorial. Semua orang boleh datang. Untuk informasi lebih lanjut, lihat `pengumuman`_.

source: Add support for address book export
es: Añade soporte para exportación de la libreta de direcciones
id: Tambahkan dukungan untuk ekspor buku alamat

source: Add support for SSL in HTTP server tunnel
es: Añade soporte para SSL en el servidor de túneles HTTP
id: Tambahan dukungan untuk SSL di tunnel server HTTP

source: Allow class 'M' (64-128 KBps share bandwidth) to become floodfill
es: Permite a la clase 'M' (64-128 KBps de ancho de banda compartido) convertirse en router I2P de inundación (floodfill)
id: Mengizinkan kelas 'M' (shared bandwidth 64-128 KBps) menjadi floodfill

source: Raise connection limits for new classes 'P' (512-2000 KBps share bandwidth) and 'X' (over 2000 KBps)
es: Eleva los límites de conexión para las nuevas clases 'P' (512-2000 KBps de ancho de banda compartido) y 'X' (más de 2000 KBps)
id: Menaikkan batas koneksi untuk kelas baru 'P' (512-2000 KBps share bandwidth) dan 'X' (lebih dari 2000 KBps)

source: Add support for signed development builds
es: Añade soporte para versiones de desarrollo firmadas
id: Tambahan dukungan untuk pengembahan software yang ditandatangani

source: Clock skew fixes
es: Correcciones de desfases de reloj
id: Perbaikan clock skew

source: Fixes and configuration for when IPv4 is firewalled but IPv6 still works
es: Correcciones y configuración para cuando IPv4 está detrás de cortafuegos pero IPv6 todavía funciona
id: Perbaikan dan konfigurasi untuk saat IPv4 dilindungi firewall namun IPv6 tetap berfungsi

source: Locking fixes for i2ptunnel clients to prevent hangs at startup
es: Reparaciones de bloqueos en clientes i2ptunnel para evitar cuelgues al inicio
id: Perbaikan penguncian untuk klien i2ptunnel untuk mencegah hang saat startup

source: Verify hostnames when reseeding
es: Verifica nombres de nodos al resembrar
id: Verifikasi nama host saat melakukan reseeding

source: Fix deletion of config files for deleted torrents in i2psnark
es: Repara el borrado de ficheros de configuración para torrents borrados en i2psnark
id: Perbaikan penghapusan file konfigurasi untuk torrents yang dihapus di i2psnark

source: Fix hangs fetching proxy.i2p local resources via Privoxy
es: Repara cuelgues al descargar recursos locales proxy.i2p mediante Privoxy
id: Perbaikan hang waktu mengambil proxy.i2p sumber daya lokal via Privoxy

source: Fixes for duplicate shared clients
es: Reparaciones para clientes compartidos duplicados
id: Perbaikan untuk duplikat shared client

source: Fix for occasional page truncation in HTTP client
es: Reparación para el truncado de página ocasional en el cliente HTTP
id: Perbaikan untuk pemotongan halaman sesekali di klien HTTP

source: Fixes for handling corrupted SSU packets
es: Reparaciones para el manejo de paquetes SSU corruptos
id: Perbaikan untuk menangani paket SSU yang rusak

source: Fix closing of SAM sessions when I2P session closes
es: Repara el cierre de sesiones SAM cuando se cierra la sesión I2P
id: Perbaikan penutupan sesi SAM saat sesi I2P ditutup

source: Fix bugs in handling streaming resets
es: Reparación de fallos en el manejo de restablecimientos de streaming
id: Perbaikan bug dalam menangani streaming ulang

source: Reduce NTCP threads
es: Reduce el número de hilos NTCP
id: Pengurangan thread NTCP

source: Eliminate SimpleScheduler threads
es: Elimina los hilos SimpleScheduler
id: Penghilangan thread SimpleScheduler

source: Add continent-based NTP servers as fallbacks for country-based ones
es: Añade servidores NTP por continentes de contingencia para los basados en países
id: Tambahan server NTP berbasis benua sebagai penggantinya untuk berbasis negara

source: Remove all default non-SSL reseed hosts
es: Elimina todos los nodos de resembrado no-SSL predeterminados
id: Menghapus semua host reseed non-SSL default

source: Disable fallback to non-su3 reseeding
es: Deshabilita la alternancia a resembrado no-su3 para contingencias
id: Nonaktifkan fallback ke non-su3 reseeding

source: Several fixes in streaming for better "loopback" performance
es: Varias reparaciones en el transporte streaming para un mejor rendimiento "loopback"
id: Beberapa perbaikan dalam streaming untuk kinerja "loopback" yang lebih baik

source: Reduce latency in i2ptunnel
es: Reduce latencia en i2ptunnel
id: Mengurangi latensi di i2ptunnel

source: Add a larger Bloom filter for very high bandwidth and memory
es: Añade un flitro Bloom mayor para anchos de banda y memoria muy altos
id: Tambahan filter Bloom yang lebih besar untuk bandwidth dan memori yang sangat tinggi

source: Add Bloom filter warning when configured for high bandwidth but not enough memory
es: Añade advertencia de filtro Bloom cuando está configurado para alto ancho de banda pero sin suficiente memoria
id: Tambahan peringatan filter Bloom bila dikonfigurasi untuk bandwidth tinggi tapi tidak cukup memori

source: Reduce max netdb search depth to reduce floodfill load
es: Reduce la profundidad máxima de la búsqueda netdb para reducir la carga del router I2P floodfill
id: mengurangi kedalaman pencarian max netdb untuk mengurangi beban floodfill

source: Improved header processing and error handling in i2ptunnel HTTP server
es: Mejorados el procesado de cabecer y la gestión de errores en el servidor HTTP de i2ptunnel
id: Pengolahan header dan penanganan kesalahan yang lebih baik di server HTTP i2ptunnel

source: Better error handling and user feedback when HTTP client tunnel is disabled
es: Mejor gestión de errores y respuesta del usuario cuando se deshabilite el túnel de cliente HTTP
id: Penangan kesalahan dan umpan balik pengguna yang lebih baik saat client tunnel HTTP dinonaktifkan

source: More changes to improve floodfill capacity
es: Más cambios para mejorar la capacidad del router I2P floodfill
id: Lebih banyak perubahan untuk memperbaiki kapasitas floodfill

source: New configuration for forcing IPv4 (only) to firewalled on /confignet
es: Nueva configuración en /confignet para forzar (sólo) IPv4 con 'detrás de cortafuegos'
id: Konfigurasi baru untuk memaksa IPv4 (hanya) ke firewall pada /confignet

source: New configuration for floodfill on /configadvanced
es: Nueva configuración en /configadvanced para router I2P floodfill
id: Konfigurasi baru untuk floodfill pada /configadvanced

source: Show separate IPv4 and IPv6 status in summary bar when appropriate
es: Muestra estados separados IPv4 e IPv6 en la barra de resumen cuando sea adecuado
id: Menampilkan status IPv4 dan IPv6 yang terpisah di bar ringkasan bila sesuai

source: Better handling of corrupt SSU packets
es: Mejor manejo de paquetes SSU corruptos
id: Penanganan yang lebih baik untu paket SSU yang rusak

source: The I2P team is proud to announce that we are going to host a meetup in Toronto on August 15-16. A number of members of our community will be attending and are going to host talks, workshops and discussions about and relating to I2P. This event is not just for I2P people though, it's meant for everyone.
es: El equipo de I2P se enorgullece de anunicar que vamos a alojar un encuentro en Toronto los días 15-16 de agosto. Varios de los miembros de nuestra comunidad asistirán y van a alojar charlas, talleres, y debates acerca de y relacionado con I2P. Este evento no es sólo para la gente de I2P, sino que más bien está pensado para cualquiera.
id: Tim I2P dengan bangga mengumumkan bahwa kami akan mengadakan pertemuan di Toronto pada 15-16 Agustus. Sejumlah anggota komunitas kami akan hadir dan akan mengadakan pembicaraan, lokakarya, dan diskusi tentang dan yang terkait dengan I2P. Acara ini bukan hanya untuk orang-orang I2P, tetapi untuk semua orang.

source: If you're curious about I2P, interested in privacy/cryptography/anonymity or just want to come by and talk to us, please do. This is an event for everyone. If you're not familiar with any of these topics, come by anyway and we'll show you how I2P works and what you can do with it. The event is entirely free, you don't need to sign up or register.
es: Si tiene curiosidad acerca de I2P, está interesado en privacidad/criptografía/anonimato, o tan solo quiere darse una vuelta y charlar con nosotros, por favor, hágalo. Este es un evento para todo el mundo. Si no está familiarizado con cualquiera de estos temas, dese una vuelta de todos modos y le mostraremos cómo funciona I2P y qué puede hacer con ello. El evento es enteramente gratuito, no necesita inscribirse o registrarse.
id: Jika Anda penasaran dengan I2P, tertarik pada privasi / kriptografi / anonimitas atau hanya ingin datang dan berbicara dengan kami, silakan datang. Ini adalah acara untuk semua orang. Jika Anda asing dengan topik ini, datanglah dan kami akan menunjukkan kepada Anda bagaimana cara kerja I2P dan apa yang dapat Anda lakukan dengannya. Acara ini sepenuhnya gratis, Anda tidak perlu mendaftar.

source: The meetup couldn't have been arranged without our friends at `Toronto Crypto <https://torontocrypto.org/>`_ which have been helping us organize the event, and our friends at `Hacklab <https://hacklab.to/>`_ which are providing us with a very nice space.
es: El encuentro no podría haber sido organizado sin nuestros amigos en `Toronto Crypto <https://torontocrypto.org/>`_ que han estado ayudándonos a organizar el evento, y nuestros amigos en `Hacklab <https://hacklab.to/>`_ que están proporcionándonos un espacio muy adecuado.
id: Pertemuan tidak bisa diatur tanpa teman-teman kita di `Toronto Crypto <https://torontocrypto.org/> `_ yang telah membantu kami mengatur acara, dan teman-teman kami di `Hacklab <https://hacklab.to/> `_ yang memberi kita ruang yang sangat bagus.

source: If you have any questions, feel free to contact us on `@geti2p`_.
es: Si tiene alguna pregunta, tómese la libertad de contactar con nostros en `@geti2p`_.
id: Jika ada pertanyaan, silakan hubungi kami di `@ geti2p`_.

source: Details
es: Detalles
id: Detail

source: Location
es: Localización
id: Lokasi

source: `Hacklab <https://hacklab.to/>`_ at 1266 Queen Street West, Toronto.
es: `Hacklab <https://hacklab.to/>`_ en el 1266 de Queen Street West, Toronto.
id: `Hacklab <https://hacklab.to/>`_ di 1266 Queen Street West, Toronto.

source: The focus will be on an introduction to topics surrounding I2P, privacy and anonymity online. People of all backgrounds and knowledge levels are welcome to attend.
es: El foco se pondrá sobre una introducción a los temas que rodean I2P, privacidad y anonimato en línea. Las personas de todo tipo de bagajes y niveles de conocimiento son bienvenidas a asistir.
id: Fokusnya adalah perkenalan pada topik seputar I2P, privasi, dan anonimitas secara online. Orang-orang dari semua latar belakang dan tingkat pengetahuan dipersilahkan untuk hadir.

source: I2P Presentation
es: Presentación de I2P
id: Presentasi I2P

source: Crypto party introduction
es: Crypto fiesta de presentación
id: Pengantar pesta kripto

source: Crypto party
es: Crypto fiesta
id: Pesta kripto

source: The crypto party will contain a number of stations where privacy/anonymity software will be demoed. The goal is to provide people with the tools they need to communicate securely.
es: La crypto fiesta constará de varias estaciones donde el software de privacidad/anonimato estará en demostración. El objetivo es proveer a las personas las herramientas que necesitan para comunicarse de forma segura.
id: Pesta kripto akan berisi sejumlah stasiun di mana perangkat lunak privasi / anonimitas akan didemonstrasikan. Tujuannya adalah untuk memberi orang alat yang mereka butuhkan untuk berkomunikasi dengan aman.

source: `Vuze/I2P`_ - Downloading torrents anonymously
es: `Vuze/I2P`_ - Descarga de torrents de forma anónima
id: `Vuze / I2P`_ - Mengunduh torrents secara anonim

source: `Veracrypt`_ - Encrypt your data
es: `Veracrypt`_ - Cifra sus datos
id: `Veracrypt`_ - Mengenkripsi data Anda

source: `I2PBote`_ - Anonymous decentralized email
es: `I2PBote`_ - Correo electrónico descentralizado
id: `I2PBote`_ - Email anonim terdesentralisasi

source: Your station idea here
es: La idea de su estación aquí
id: Masukkan ide stasiun Anda disini

source: We're currently looking for help staffing the stations. If you want to help out, you can! Bring a monitor/laptop and run a station. The station could be any of the ones listed above, or any other privacy/anonymity related one you would like to run. Please contact us at `@geti2p`_ if you're interested.
es: Actualmente estámos buscando ayuda para dotar de personal a las estaciones. ¡Si quiere ayudar, puede! Traiga un monitor/portátil y ejecute una estación. La estación podría ser cualquiera de las que están listadas arriba, o cualquier otra relacionada con la privacidad/anonimato que desee ejecutar. Por favor, contacte con nosotros en `@geti2p`_ si está interesado.
id: Kami sedang mencari bantuan untuk menjaga stasiun. Jika Anda ingin membantu, Anda bisa! Bawa monitor / laptop dan jalankan stasiun. Stasiun bisa menjadi salah satu yang tercantum di atas, atau privasi / anonimitas lainnya yang terkait dengan yang ingin Anda jalankan. Silahkan hubungi kami di `@ geti2p`_ jika Anda tertarik.

source: The focus will be on in-depth topics surrounding I2P, the roadmap and development. Anyone is welcome to attend, but the content will be somewhat technical.
es: El foco estará sobre temas que rodean I2P tratados en profundidad, la hora de ruta y el desarrollo. Cualquiera es bienvenido a asistir, pero el contenido será un tanto técnico.
id: Fokusnya akan berada pada topik yang mendalam seputar I2P, peta jalan, dan pengembangan. Siapapun dipersilahkan untuk hadir, namun kontennya akan agak teknis.

source: I2P Technical presentation
es: Presentación técnica de I2P
id: Presentasi teknis I2P

source: Technical discussion
es: Discusión técnica
id: Diskusi teknis

source: I2P App Dev Into
es: Desarrollo de aplicaciones I2P en
id: Pengenalan pengembangan aplikasi I2P

source: I2PD presentation
es: Presentación de I2PD
id: Presentasi I2PD

source: I2P on Android
es: I2P en Android
id: I2P di Android

source: I2PCon will be in Toronto on August 15-16.
es: I2PCon se celebrará en Toronto el 15-16 de Agosto
id: I2PCon akan berada di Toronto pada tanggal 15-16 Agustus.

source: I2PCon is the first event of its kind. It has two short term goals. Where the first one is to provide the general public with an event where knowledge about privacy and privacy concerns can be obtained. The second goal is to further the I2P project and its community. This will take the shape of technical discussions about cryptography, anonymity and I2P centric topics.
es: I2PCon es el primer evento de este tipo. Tiene dos metas a corto plazo. Donde la primera es proporcionar al público general un evento donde se puede obtener conocimiento sobre privacidad y asuntos de privacidad . La segunda meta es llevar más allá el proyecto I2P y su comunidad. Esto dará forma a los debates técnicos sobre criptografía, anonimato y temas I2P-céntricos.
id: I2PCon adalah acara pertama yang diadakan untuk jenisnya. Ini memiliki dua tujuan jangka pendek. Dimana yang pertama adalah mengadakan sebuah acara untik masyarakat umum di mana pengetahuan tentang privasi dan masalah privasi dapat diperoleh. Tujuan kedua adalah untuk melanjutkan proyek I2P dan komunitasnya. Ini akan menjadi bentuk diskusi teknis tentang topik kriptografi, anonimitas, dan topik menyangkut I2P.

source: There is a larger and more long-term goal of this event, and it is to build a commnutiy of privacy-conscious individuals. By connecting people who recognize the importance of privacy, we would like to provide a forum where this community can grow.
es: Hay una meta más grande y a más largo plazo para este evento, y es construir una comunidad de individuos conscientes de la importancia de la privacidad. Al conectar personas que reconocen la importancia de la privacidad, deseamos proporcionar un foro donde esta comunidad pueda crecer.
id: Ada tujuan yang lebih besar dan lebih jangka panjang dari acara ini, dan ini adalah untuk membangun sebuah komunitas dari individu yang sadar privasi. Dengan menghubungkan orang-orang yang menyadari pentingnya privasi, kami ingin menyediakan forum di mana komunitas ini dapat berkembang.

source: The idea for this event was first spawned by our wonderful friends at `Toronto Crypto`_. The venue and everything relating to it is provided by `Hacklab`_. Without either of them this event would not have been possible, so thank you both.
es: La idea para este evento fue concebida en primer término por nuestros maravillosos amigos en `Toronto Crypto`_. El lugar de reunión y todo lo relacionado con este es proporcionado por `Hacklab`_. Sin alguno de ellos este evento no habría sido posible, así que gracias a ambos.
id: Ide untuk acara ini adalah pertama dilahirkan oleh teman-teman kita yang luar biasa di <a href="https://torontocrypto.org/">Toronto Crypto</a>. Listrik dan WiFi akan disediakan oleh `Hacklab`_. Tanpa mereka acara ini akan tidak mungkin dilaksanakan.

source: `Hacklab`_ at 1266 Queen Street West, Unit #6, Toronto.
es: `Hacklab`_ 1266 Queen Street West, Unit #6, Toronto.
id: `Hacklab`_ di 1266 Queen Street West, Unit #6, Toronto.

source: Power and WiFi access will be provided by `Hacklab`_.
es: El acceso a electricidad y WiFi será proporcionado por `Hacklab`_.
id: Listrik dan WiFi akan disediakan oleh `Hacklab`_.

source: Schedule
es: Programación
id: Jadwal

source: ============== 0.9.21 Release ==============
es: ============== Versión 0.9.21 ==============
id: ============== Rilis 0.9.21 ==============

source: 0.9.21 with performance improvements and bug fixes
es: 0.9.21 con mejoras de rendimiento y reparaciones de fallos
id: 0.9.21 dengan perbaikan kinerja dan perbaikan bug

source: 0.9.21 contains several changes to add capacity to the network, increase the efficiency of the floodfills, and use bandwidth more effectively. We have migrated the shared clients tunnels to ECDSA signatures and added a DSA fallback using the new "multisession" capability for those sites that don't support ECDSA.
es: La 0.9.21 contiene varios cambios para añadir capacidad a la red, incrementar la eficiencia de los routers I2P floodfill, y usar el ancho de banda de forma más efectiva. Hemos migrado los túneles de clientes compartidos a firmas ECDSA y como respaldo hemos añadido DSA usando la nueva capacidad "multisesión" para aquellos sitios que no soportan ECDSA.
id: 0.9.21 berisi beberapa perubahan untuk menambahkan kapasitas ke jaringan, meningkatkan efisiensi floodfills, dan menggunakan bandwidth dengan lebih efisien. Kami telah memindahkan klien saluran berbagi ke signatur ECDSA dan menambahkan fallback DSA dengan menggunakan kemampuan "multisession" untuk situs yang tidak mendukung ECDSA.
