Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/comparison.po
Languages: tr

source: Small enough that it hasn't been blocked or DOSed much, or at all
tr: Çok fazla engellenmemiş veya DOS uygulanmamış olması için yeterince küçük

source: Peer-to-peer friendly
tr: Eşler arası dostu

source: Packet switched instead of circuit switched
tr: Devre anahtarlamalı yerine paket anahtarlamalı

source: implicit transparent load balancing of messages across multiple peers, rather than a single path
tr: mesajların örtük şeffaf yük dengelemesi tek bir yol yerine birden çok eş arasında

source: resilience vs. failures by running multiple tunnels in parallel, plus rotating tunnels
tr: birden çok çalıştırarak dayanıklılığa karşı başarısızlık paralel tüneller, artı dönen tüneller

source: scale each client's connections at O(1) instead of O(N) (Alice has e.g. 2 inbound tunnels that are used by all of the peers Alice is talking with, rather than a circuit for each)
tr: bunun yerine her müşterinin bağlantısını O (1) olarak ölçeklendirin O (N) (Alice'in örneğin 2 gelen tüneli vardır. Alice'in konuştuğu tüm meslektaşları tarafından kullanılıyor, her biri için bir devre yerine)

source: Unidirectional tunnels instead of bidirectional circuits, doubling the number of nodes a peer has to compromise to get the same information.
tr: Çift yönlü yerine tek yönlü tüneller devreler, bir eşin sahip olması gereken düğüm sayısını ikiye katlar aynı bilgiyi almak için uzlaşmak.

source: Counter-arguments and further discussion <a href="%(netdb)s">here</a>.
tr: Karşı argümanlar ve <a href="%(netdb)s">burada daha fazla tartışma</a>

source: Protection against detecting client activity, even when an attacker is participating in the tunnel, as tunnels are used for more than simply passing end to end messages (e.g. netDb, tunnel management, tunnel testing)
tr: Müşteri aktivitesini tespit etmeye karşı koruma, hatta bir saldırgan tünele katıldığında, tüneller, sadece sondan geçmekten daha fazlası için kullanılır mesajları sonlandırmak için (ör. netDb, tünel yönetimi, tünel testi)

source: Tunnels in I2P are short lived, decreasing the number of samples that an attacker can use to mount an active attack with, unlike circuits in Tor, which are typically long lived.
tr: I2P'deki tüneller kısa ömürlüdür, sayıları azalır bir saldırganın bir Tor'daki devrelerin aksine, aktif saldırı tipik olarak uzun ömürlüdür.

source: I2P APIs are designed specifically for anonymity and security, while SOCKS is designed for functionality.
tr: I2P API'leri özellikle anonimlik için tasarlanmıştır ve güvenlik, SOCKS ise işlevsellik için tasarlanmıştır.

source: Essentially all peers participate in routing for others
tr: Esasen tüm akranlar başkaları için yönlendirmeye katılır

source: The bandwidth overhead of being a full peer is low, while in Tor, while client nodes don't require much bandwidth, they don't fully participate in the mixnet.
tr: Tam bir eş olmanın bant genişliği ek yükü düşüktür, Tor'da iken, istemci düğümleri çok fazla bant genişliği, mixnet'e tam olarak katılmazlar.

source: Integrated automatic update mechanism
tr: Entegre otomatik güncelleme mekanizması

source: Both TCP and UDP transports
tr: Hem TCP hem de UDP aktarımları

source: Java, not C (ewww)
tr: Java, C (ewww) değil

source: Other potential benefits of I2P but not yet implemented
tr: I2P'nin diğer potansiyel faydaları ancak henüz uygulanmadı

source: ...and may never be implemented, so don't count on them!
tr: ... ve asla uygulanamayabilir, bu yüzden onlara güvenmeyin!

source: Defense vs. message count analysis by garlic wrapping multiple messages
tr: Sarımsak sarma ile savunma ve mesaj sayısı analizi birden çok mesaj

source: Defense vs. long term intersection by adding delays at various hops (where the delays are not discernible by other hops)
tr: Çeşitli duraklarda gecikmeler ekleyerek savunma ve uzun dönemli kesişme (gecikmelerin diğer duraklar nedeniyle fark edilemediği yerlerde)

source: Various mixing strategies at the tunnel level (e.g. create a tunnel that will handle 500 messages / minute, where the endpoint will inject dummy messages if there are insufficient messages, etc)
tr: Tünel seviyesinde çeşitli karıştırma stratejileri (ör. dakikada 500 mesajı işleyecek bir tünel oluşturmak, uç nokta varsa sahte mesajlar enjekte edecek yetersiz mesajlar, vb.)
