Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/comparison.po
Languages: tr

source: I2P Compared to Freenet
tr: I2P, Freenet'e kıyasla

source: Freenet is a fully distributed, peer to peer anonymous publishing network, offering secure ways to store data, as well as some approaches attempting to address the loads of a flash flood. While Freenet is designed as a distributed data store, people have built applications on top of it to do more generic anonymous communication, such as static websites and message boards.
tr: Freenet, tamamen dağıtılmış, eşler arası anonim bir yayıncılık ağıdır. verileri depolamanın güvenli yollarının yanı sıra yükleri ele almaya çalışan bazı yaklaşımlar ani bir sel. Freenet dağıtılmış bir veri deposu olarak tasarlanırken, insanlar üzerine daha genel anonim iletişim yapmak için uygulamalar oluşturdu, örneğin statik web siteleri ve ileti panoları.

source: Compared to I2P, Freenet offers some substantial benefits - it is a distributed data store, while I2P is not, allowing people to retrieve the content published by others even when the publisher is no longer online. In addition, it should be able to distribute popular data fairly efficiently. I2P itself does not and will not provide this functionality. On the other hand, there is overlap for users who simply want to communicate with each other anonymously through websites, message boards, file sharing programs, etc. There have also been some attempts to develop a distributed data store to run on top of I2P, (most recently a port of <a href="%(tahoe)s">Tahoe-LAFS</a>) but nothing is yet ready for general use.
tr: I2P ile karşılaştırıldığında, Freenet bazı önemli avantajlar sunar - bu dağıtılmış bir veridir I2P olmasa da, insanların başkaları tarafından yayınlanan içeriği almasına izin verin yayıncı artık çevrimiçi olmasa bile. Ek olarak, yapabilmelidir popüler verileri oldukça verimli bir şekilde dağıtın. I2P'nin kendisi sağlamaz ve sağlamayacaktır bu işlevsellik. Öte yandan, yalnızca şunu yapmak isteyen kullanıcılar için bir örtüşme vardır: Web siteleri, mesaj panoları, dosya paylaşımı yoluyla birbirleriyle anonim olarak iletişim kurun programlar, vb. Dağıtılmış bir veri geliştirmek için bazı girişimler de olmuştur. I2P üzerinde çalışmak için mağaza, (en son bir <a href="%(tahoe)s">Tahoe-LAFS limanı</a>) ancak hiçbir şey henüz genel kullanıma hazır değil.

source: However, even ignoring any implementations issues, there are some concerns about Freenet's algorithms from both a scalability and anonymity perspective, owing largely to Freenet's heuristic driven routing. The interactions of various techniques certainly may successfully deter various attacks, and perhaps some aspects of the routing algorithms will provide the hoped for scalability. Unfortunately, not much analysis of the algorithms involved has resulted in positive results, but there is still hope. At the very least, Freenet does provide substantial anonymity against an attacker who does not have the resources necessary to analyze it further.
tr: Ancak, herhangi bir uygulama sorunu göz ardı edilse bile, bazı endişeler var. hem ölçeklenebilirlik hem de anonimlik açısından Freenet algoritmaları hakkında büyük ölçüde Freenet'in sezgisel yönlendirmeli yönlendirmesine. Çeşitli tekniklerin etkileşimleri kesinlikle çeşitli saldırıları başarıyla caydırabilir ve belki de yönlendirme algoritmaları, ölçeklenebilirlik için umulanları sağlayacaktır. Maalesef çok değil ilgili algoritmaların analizi olumlu sonuçlarla sonuçlandı, ancak hala var umut. En azından, Freenet bir saldırgana karşı önemli ölçüde anonimlik sağlar

source: Comparing I2P to other projects
tr: I2P'yi diğer projelerle karşılaştırma

source: There are a great many other applications and projects working on anonymous communication and I2P has been inspired by much of their efforts. This is not a comprehensive list of anonymity resources - both freehaven's <a href="http://freehaven.net/anonbib/topic.html">Anonymity Bibliography</a> and GNUnet's <a href="https://www.gnunet.org/links/">related projects</a> serve that purpose well. That said, a few systems stand out for further comparison. The following have individual comparison pages:
tr: Anonim olarak çalışan birçok başka uygulama ve proje var. iletişim ve I2P, çabalarının çoğundan ilham almıştır. Bu değil kapsamlı bir anonimlik kaynakları listesi - her ikisi de freehaven'ın <a href="http://freehaven.net/anonbib/topic.html">Anonimlik Kaynakça</a> ve GNUnet'in<a href="https://www.gnunet.org/links/">İlgili Projeler</a> bu amaca iyi hizmet et. Bununla birlikte, birkaç sistem daha fazlası için öne çıkıyor karşılaştırma. Aşağıdakilerin ayrı karşılaştırma sayfaları vardır:

source: The following are discussed on the <a href="%(othernetworks)s">other networks page:</a>
tr: Aşağıdakiler tartışılmaktadır <a href="%(othernetworks)s">diğer ağlar sayfası:</a>

source: The content of this page is subject to update, discussion and dispute, and we welcome comments and additions. You may contribute an analysis by entering a <a href="%(trac)s">new ticket on Trac</a>.
tr: Bu sayfanın içeriği güncellenebilir, tartışılabilir ve tartışılabilir ve yorum ve eklemelere açığız. <a href="%(trac)s">Trac'e yeni bir bilet girerek bir analize katkıda bulunabilirsiniz.</a>

source: I2P Compared to Other Anonymous Networks
tr: Diğer Anonim Ağlarla Karşılaştırıldığında I2P

source: The following networks are discussed on this page.
tr: Aşağıdaki ağlar bu sayfada tartışılmaktadır.

source: Most of the following sections are fairly old, and may not be accurate. For an overview of available comparisons, see the <a href="%(comparison)s">main network comparisons page</a>. You may contribute an analysis by entering a <a href="%(trac)s">new ticket on Trac</a>.
tr: Aşağıdaki bölümlerin çoğu oldukça eskidir ve doğru olmayabilir. Mevcut karşılaştırmalara genel bir bakış için bkz. <a href="%(comparison)s">ana ağ karşılaştırmaları sayfası.</a> <a href="%(trac)s">Trac'te yeni bilet girerek</a> bir analize katkıda bulunabilirsiniz.

source: RetroShare is a set of peer-to-peer applications running in a <a href="%(f2fwiki)s">Friend-to-friend (F2F)</a> network. Each peer of such F2F network makes direct IP connections only to authenticated peers ("friends") after explicit certificates exchange. It can discover unauthenticated peers (e.g. friends of friends), but connections to them are relayed over "friend" peers for providing privacy and anonymity.
tr: RetroShare, bir grupta çalışan bir uçtan uca uygulama kümesidir. <a href="%(f2fwiki)s">Arkadaş-arkadaş (F2F) </a>ağı. Böyle bir F2F'nin her eşi ağ, açıktan sonra yalnızca kimliği doğrulanmış eşlere ("arkadaşlar") doğrudan IP bağlantıları yapar sertifika değişimi. Kimliği doğrulanmamış akranları (örneğin, arkadaşların arkadaşları) keşfedebilir, ancak bunlarla olan bağlantılar, gizlilik ve anonimlik sağlamak için "arkadaş" akranları üzerinden aktarılır.

source: RetroShare is designed to build a private network of trusted peers, while I2P is designed to be a large-scaled public anonymous network. Recent versions of RetroShare have options to run as a public "darknet" by using I2P or Tor as a transport. That way all connections are anonymized and no trust is required for adding new "friends".
tr: RetroShare, I2P tasarlanırken, güvenilir eşlerden oluşan özel bir ağ oluşturmak için tasarlanmıştır büyük ölçekli, halka açık anonim bir ağ olmak. RetroShare'in son sürümlerinde çalıştırma seçenekleri var I2P veya Tor'u aktarım olarak kullanarak halka açık bir "darknet" olarak. Bu şekilde tüm bağlantılar anonimdir ve yeni "arkadaşlar" eklemek için güven gerekmez.

source: Morphmix and Tarzan are both fully distributed, peer to peer networks of anonymizing proxies, allowing people to tunnel out through the low latency mix network. Morphmix includes some very interesting collusion detection algorithms and Sybil defenses, while Tarzan makes use of the scarcity of IP addresses to accomplish the same. The two primary differences between these systems and I2P are related to I2P's <a href="%(threatmodel)s">threat model</a> and their out-proxy design (as opposed to providing both sender and receiver anonymity). There is source code available to both systems, but we are not aware of their use outside of academic environments.
tr: Morphmix ve Tarzan'ın her ikisi de tamamen dağıtılmış, eşler arası ağlar vekillerin anonimleştirilmesi, insanların düşük gecikme süresi boyunca tünel açmasına izin verir karışık ağ. Morphmix, bazı çok ilginç gizli anlaşma tespiti içerir algoritmalar ve Sybil savunmaları, Tarzan IP'nin kıtlığından yararlanırken aynı şeyi gerçekleştirmek için adresler. Arasındaki iki temel fark bu sistemler ve I2P, I2P'nin <a href="%(threatmodel)s">tehdit modeliyle</a> ilgilidir ve proxy dışı tasarımları (hem gönderen hem de alıcı sağlamanın aksine anonimlik). Her iki sistem için de kullanılabilir kaynak kodu var, ancak farkında değiliz akademik ortamlar dışında kullanımları.

source: Mixminion and Mixmaster are networks to support anonymous email against a very powerful adversary. High-latency messaging applications running on top of I2P (for example <a href="%(syndie)s">Syndie</a> or I2PBote) may perhaps prove adequate to meet the threat model of those adversaries, while running in parallel along side the needs of low latency users, to provide a significantly larger anonymity set. High-latency support within the I2P router itself may or may not be added in a distant future release. It is too early to say if I2P will meet the needs of users requiring extreme protection for email.
tr: Mixminion ve Mixmaster, anonim e-postayı çok güçlü düşman. I2P üzerinde çalışan yüksek gecikmeli mesajlaşma uygulamaları (örneğin <a href="%(syndie)s">Syndie </a>veya I2PBote) belki tehdidi karşılamaya yeterli olabilir bu rakiplerin modeli, düşük gecikmeli kullanıcıların ihtiyaçlarının yanında paralel olarak koşarken, önemli ölçüde daha büyük bir anonimlik kümesi. I2P yönlendiricinin kendi içindeki yüksek gecikmeli destek, uzak gelecekteki bir sürümde eklenebilir veya eklenmeyebilir. I2P'nin e-posta için aşırı korumaya ihtiyaç duyan kullanıcıların ihtiyaçlarını karşılayıp karşılamayacağını söylemek için henüz çok erken.

source: As with Tor and Onion Routing, both Mixminion and Mixmaster take the directory based approach as well.
tr: Tor ve Soğan Yönlendirmede olduğu gibi, Mixminion ve Mixmaster da dizin tabanlı yaklaşımı benimsiyor.

source: JAP (Java Anonymous Proxy) is a network of mix cascades for anonymizing web requests, and as such it has a few centralized nodes (participants in the cascade) that blend and mix requests from clients through the sequence of nodes (the cascade) before proxying out onto the web. The scope, threat model, and security is substantially different from I2P, but for those who don't require significant anonymity but still are not satisfied with an Anonymizer-like service, JAP is worth reviewing. One caution to note is that anyone under the jurisdiction of the German courts may want to take care, as the German Federal Bureau of Criminal Investigation (FBCI) has successfully mounted an <a href="%(url)s">attack</a> on the network. Even though the method of this attack was later found to be illegal in the German courts, the fact that the data was successfully collected is the concern. Courts change their minds based upon circumstance, and this is evidence that if a government body or intelligence agency wanted to, they could gather the data, even if it may be found inadmissible in some courts later)
tr: JAP (Java Anonim Proxy), web isteklerini anonimleştirmek için bir karma kademeler ağıdır, ve bu nedenle, karıştıran birkaç merkezi düğüme (kademedeki katılımcılar) sahiptir. ve istemcilerden gelen istekleri düğüm dizisi (basamaklı) aracılığıyla karıştırın web üzerinde vekaleten. Kapsam, tehdit modeli ve güvenlik büyük ölçüde I2P'den farklı, ancak önemli bir anonimlik gerektirmeyen ancak yine de Anonymizer benzeri bir hizmetten memnun değilseniz, JAP incelemeye değer. Bir Alman mahkemelerinin yargı yetkisi altındaki herkesin isteyebileceği Alman Federal Ceza Soruşturma Bürosu'nun (FBCI) yaptığı gibi başarıyla monte edilmiş <a href="%(url)s">saldırı</a> ağda. Bu saldırının yöntemi daha sonra yasadışı bulunsa da Alman mahkemelerinde, verilerin başarıyla toplandığı gerçeği, ilgilendirmek. Mahkemeler duruma göre fikirlerini değiştirir ve bu, bir devlet kurumu veya istihbarat teşkilatı isterse, verileri toplayabilir, hatta daha sonra bazı mahkemelerde kabul edilemez bulunursa)

source: Both of these systems work through the same basic <a href="%(antnet)s">antnet</a> routing, providing some degree of anonymity based on the threat model of providing plausible deniability against a simple non-colluding adversary. With the antnet routing, they first either do a random walk or a broadcast search to find some peer with the data or identity desired, and then use a feedback algorithm to optimize that found path. This works well for applications that merely want to know what other people around them have to offer - "How are y'all doing" vs. "Hey Alice, how are you" - you basically get a local cluster of nodes that can share files with and maintain some degree of anonymity (though you don't have much control over who is in that group of peers).
tr: Bu sistemlerin her ikisi de aynı temelde çalışır antnet yönlendirme, bir dereceye kadar basit bir duruma karşı inandırıcı bir inkar sağlama tehdit modeline dayalı anonimlik gizli düşman. <a href="%(antnet)s">Antnet </a>yönlendirmesiyle, önce ya rastgele bir yürüyüş yaparlar ya da İstenen veriye veya kimliğe sahip bir eş bulmak için yayın araması yapın ve ardından bir geri bildirim kullanın bulunan yolu optimize etmek için algoritma. Bu, yalnızca bilmek isteyen uygulamalar için işe yarar çevrelerindeki diğer insanların sunduğu şeyler - "Nasılsınız?" ile "Hey Alice, nasılsınız?" - temel olarak dosyaları paylaşabilen ve bir dereceye kadar koruyabilen yerel bir düğüm kümesi elde edersiniz. anonimlik (bu grupta kimin olduğu konusunda fazla kontrolünüz olmasa da).

source: However, the algorithm does not scale well at all - if the application wants to speak with a particular peer it ends up doing a broadcast search or random walk (though if they are lucky enough for that to succeed, the antnet routing should optimize that found connection). This means that while these networks can work great at small scales, they are not suitable for large networks where someone wants to get in touch with another specific peer. That does not mean that there is no value in these systems, just that their applicability is limited to situations where their particular issues can be addressed.
tr: Bununla birlikte, algoritma hiç iyi ölçeklenmiyor - uygulama bir belirli bir akran, bir yayın araması veya rastgele bir yürüyüşle sonuçlanır (yine de yeterince şanslılarsa bunun başarılı olması için, antnet yönlendirmesi bulunan bağlantıyı optimize etmelidir). Bunun anlamı şudur ki bu ağlar küçük ölçeklerde harika çalışabilirken, büyük ağlar için uygun değildir. birisi başka bir belirli akranla temasa geçmek istiyor. Bu, olmadığı anlamına gelmez bu sistemlerdeki değer, sadece uygulanabilirliklerinin belirli konular ele alınabilir.

source: This was a closed-source network targeted at Iranian users. Tor did a <a href="%(torpost)s">good writeup on what to look for in a circumvention tool</a>. Suffice it to say that being closed source and publicly targeting a specific country are not good ideas. I2P is, of course, open source. However, that source, and our <a href="%(docs)s">technical documentation</a>, need much more review.
tr: Bu, İranlı kullanıcıları hedefleyen kapalı kaynaklı bir ağdı. Tor, bir <a href="%(torpost)s">hileli atlatma aracında ne arayacağı konusunda iyi bir yazı yazdı.</a> Kapalı kaynak olmanın ve belirli bir ülkeyi alenen hedeflemenin iyi fikirler olmadığını söylemek yeterli. I2P elbette açık kaynaktır. Ancak bu kaynak ve bizim <a href="%(docs)s">teknik dokümantasyon</a>, daha fazla incelemeye ihtiyaç duyar.

source: Paid VPN Services
tr: Ücretli VPN Hizmetleri

source: You may contribute an analysis by entering a <a href="%(trac)s">new ticket on Trac</a>.
tr: <a href="%(trac)s">Trac'te yeni bilet</a> girerek bir analize katkıda bulunabilirsiniz.

source: Others
tr: Diğerleri

source: I2P Compared to Tor
tr: I2P, Tor ile Karşılaştırıldığında

source: November 2016
tr: Kasım 2016

source: Tor and Onion Routing are both anonymizing proxy networks, allowing people to tunnel out through their low latency mix network. The two primary differences between Tor / Onion-Routing and I2P are again related to differences in the threat model and the out-proxy design (though Tor supports hidden services as well). In addition, Tor takes the directory-based approach - providing a centralized point to manage the overall 'view' of the network, as well as gather and report statistics, as opposed to I2P's distributed <a href="%(netdb)s">network database</a> and <a href="%(peerselection)s">peer selection</a>.
tr: Tor ve Onion Routing, proxy ağlarını anonimleştiriyor, insanların düşük gecikmeli karışımları aracılığıyla tünel açmalarına olanak tanır ağ. Tor / arasındaki iki temel fark Onion-Routing ve I2P, yine tehdit modeli ve proxy dışı tasarım (Tor gizli hizmetleri de destekler). Ek olarak, Tor dizin tabanlı yaklaşımı alır - genel 'bakış açısını' yönetmek için merkezi nokta ağın yanı sıra istatistikleri toplamak ve raporlamak I2P'nin dağıtılmış ağının aksine <a href="%(netdb)s">veritabanı </a>ve <a href="%(peerselection)s">eş seçimi</a>.

source: The I2P/Tor outproxy functionality does have a few substantial weaknesses against certain attackers - once the communication leaves the mixnet, global passive adversaries can more easily mount traffic analysis. In addition, the outproxies have access to the cleartext of the data transferred in both directions, and outproxies are prone to abuse, along with all of the other security issues we've come to know and love with normal Internet traffic.
tr: I2P / Tor outproxy işlevselliğinin birkaç belirli saldırganlara karşı önemli zayıflıklar - iletişim mixnet'i terk ettiğinde, global pasif rakipler trafik analizini daha kolay gerçekleştirebilir. İçinde ek olarak, dış kaynaklar açık metne erişebilir. her iki yönde aktarılan verilerin oranı ve dış kaynaklar kötüye kullanıma eğilimlidir ve tüm bildiğimiz ve sevdiğimiz diğer güvenlik sorunları normal İnternet trafiği.

source: However, many people don't need to worry about those situations, as they are outside their threat model. It is, also, outside I2P's (formal) functional scope (if people want to build outproxy functionality on top of an anonymous communication layer, they can). In fact, some I2P users currently take advantage of Tor to outproxy.
tr: Ancak birçok insanın bunlar için endişelenmesine gerek yok tehdit modellerinin dışında oldukları için durumlar. O aynı zamanda I2P'nin (resmi) işlevsel kapsamı dışındadır (insanlar isterse anonim bir profilin üzerine proxy işlevselliği oluşturmak için iletişim katmanı yapabilirler). Aslında, bazı I2P kullanıcıları şu anda dış vekil için Tor'dan yararlanıyor.

source: Comparison of Tor and I2P Terminology
tr: Tor ve I2P Terminolojisinin Karşılaştırılması

source: While Tor and I2P are similar in many ways, much of the terminology is different.
tr: Tor ve I2P birçok yönden benzer olsa da, terminolojinin çoğu farklıdır.

source: Cell
tr: Hücre

source: Message
tr: İleti

source: Client
tr: İstemci

source: Router or Client
tr: Yönlendirici veya İstemci

source: Circuit
tr: Devre

source: Tunnel
tr: Tünel

source: Directory
tr: Klasör

source: Directory Server
tr: Dizin Sunucusu

source: Floodfill Router
tr: Taşkın Yönlendirici

source: Entry Guards
tr: Giriş Muhafızları

source: Fast Peers
tr: Hızlı Akranlar

source: Entry Node
tr: Giriş Düğümü

source: Inproxy
tr: Vekil

source: Exit Node
tr: Düğümden Çık

source: Outproxy
tr: Giden Vekil Sunucusu

source: Hidden Service
tr: Gizli Hizmet

source: Eepsite or Destination
tr: Eepsite veya Hedef

source: Hidden Service Descriptor
tr: Gizli Servis Tanımlayıcısı

source: LeaseSet
tr: Kiralama Kümesi

source: Introduction point
tr: Giriş noktası

source: Inbound Gateway
tr: Geliş Bağlantısı Ağ Geçidi

source: Node
tr: Düğüm

source: Router
tr: Yöneltici

source: I2PTunnel Client (more or less)
tr: I2PTunnel İstemcisi (az ya da çok)

source: Onion Service
tr: Soğan Servisi

source: Relay
tr: Röle

source: Rendezvous Point
tr: Buluşma noktası

source: somewhat like Inbound Gateway + Outbound Endpoint
tr: biraz Inbound Gateway + Outbound Endpoint gibi

source: Router Descriptor
tr: Yönlendirici Tanımlayıcı

source: RouterInfo
tr: Yönlendirici bilgisi

source: Server
tr: Sunucu

source: Benefits of Tor over I2P
tr: Tor'un I2P'ye Göre Faydaları

source: Much bigger user base; much more visibility in the academic and hacker communities; benefits from formal studies of anonymity, resistance, and performance; has a non-anonymous, visible, university-based leader
tr: Çok daha büyük kullanıcı tabanı; akademik ve hacker topluluklarında çok daha fazla görünürlük; faydaları anonimlik, direnç ve performansla ilgili resmi çalışmalar; anonim olmayan, görünür, üniversite merkezli bir lidere sahip

source: Has already solved some scaling issues I2P has yet to address
tr: I2P'nin henüz çözmediği bazı ölçeklendirme sorunlarını zaten çözdü

source: Has significant funding
tr: Önemli miktarda fonu var

source: Has more developers, including several that are funded
tr: Finanse edilen birkaç dahil olmak üzere daha fazla geliştiriciye sahip

source: More resistant to state-level blocking due to TLS transport layer and bridges (I2P has proposals for "full restricted routes" but these are not yet implemented)
tr: TLS taşıma katmanı ve köprüleri sayesinde devlet düzeyinde engellemeye daha dirençli (I2P'nin "tam kısıtlanmış yollar" için önerileri var, ancak bunlar henüz uygulanmadı)

source: Big enough that it has had to adapt to blocking and DOS attempts
tr: Engellemeye ve DOS girişimlerine uyum sağlamak zorunda kalacak kadar büyük

source: Designed and optimized for exit traffic, with a large number of exit nodes
tr: Çok sayıda çıkış düğümü ile çıkış trafiği için tasarlanmış ve optimize edilmiştir

source: Better documentation, has formal papers and specifications, better website, many more translations
tr: Daha iyi dokümantasyon, resmi belgeler ve şartnamelere sahip, daha iyi web sitesi, çok daha fazla çeviri

source: More efficient with memory usage
tr: Bellek kullanımıyla daha verimli

source: Tor client nodes have very low bandwidth overhead
tr: Tor istemci düğümlerinin bant genişliği ek yükü çok düşüktür

source: Centralized control reduces the complexity at each node and can efficiently address Sybil attacks
tr: Merkezi kontrol, karmaşıklığı azaltır. düğüm ve Sybil saldırılarını verimli bir şekilde ele alabilir

source: A core of high capacity nodes provides higher throughput and lower latency
tr: Yüksek kapasiteli düğümlerden oluşan bir çekirdek daha yüksek verim ve daha düşük gecikme

source: C, not Java (ewww)
tr: C, Java değil (ewww)

source: Benefits of I2P over Tor
tr: I2P'nin Tor'a Göre Faydaları

source: Designed and optimized for hidden services, which are much faster than in Tor
tr: Tor'dan çok daha hızlı olan gizli hizmetler için tasarlanmış ve optimize edilmiştir

source: Fully distributed and self organizing
tr: Tamamen dağıtılmış ve kendi kendini organize eden

source: Peers are selected by continuously profiling and ranking performance, rather than trusting claimed capacity
tr: Akranlar, sürekli profilleme ve sıralama performansı ile seçilir, iddia edilen kapasiteye güvenmek yerine

source: Floodfill peers ("directory servers") are varying and untrusted, rather than hardcoded
tr: Floodfill eşleri ("dizin sunucuları") çeşitlidir ve güvenilmezdir, kodlanmış değil
