Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: fr

source: Donate
fr: Faire un don

source: Tax Status
fr: Statut fiscal

source: Stickers
fr: Autocollants

source: Get Involved!
fr: Impliquez-vous !

source: We need your help!
fr: Nous avons besoin de votre aide !

source: To get involved, please feel free to join us on the #i2p-dev IRC channel (on irc.freenode.net, irc.oftc.net, or within I2P on irc.echelon.i2p, irc.dg.i2p or irc.postman.i2p).
fr: Pour vous impliquer, n’hésitez à vous joindre à nous sur le canal IRC #i2p-dev (sur irc.freenode.net, irc.oftc.net ou dans I2P par irc.echelon.i2p, irc.dg.i2p ou irc.postman.i2p).

source: If you're interested in joining our <a href="%(team)s">team</a>, please get in touch as we're always looking for eager contributors!
fr: Si vous êtes intéressé à vous joindre à notre <a href="%(team)s">équipe</a>, veuillez nous contacter, car nous recherchons toujours des contributeurs enthousiastes&nbsp;!

source: We need help in many areas, and you don't need to know Java to contribute! Here's a list to help get you started!
fr: Nous avons besoin d’aide dans de nombreux domaines et vous n’avez pas besoin de connaître Java pour contribuer ! Voici une liste pour vous aider à démarrer !

source: Spread the Word!
fr: Passez le mot !

source: Tell people about I2P on forums, blogs, and comments to articles. Fix up the Wikipedia article about I2P in your language. Tell your friends.
fr: Informer les gens au sujet d’I2P sur les forums, les blogues et les commentaires à des articles. Corriger l’article Wikipédia concernant I2P dans votre langue. En parler à vos amis.

source: Testing
fr: En test

source: Run the latest builds from <a href="%(monotone)s">monotone</a> and report results on #i2p or as bugs on <a href="http://%(trac)s/report/1">Trac</a>.
fr: Exécutez les dernières versions de <a href="%(monotone)s">monotone</a> et signalez ​​les résultats sur #i2p ou comme bogues sur <a href="http://%(trac)s/report/1">Trac</a>.

source: Help fix the parts of the website that are outdated or incomplete. Translate pages into other languages.
fr: Aider à améliorer les parties du site qui ne sont pas à jour ou incomplètes. Traduisez des pages dans d’autres langues.

source: Pictures
fr: Images

source: Make some more pictures, fix the old ones on the website
fr: Faites davantage d’images, corrigez les anciennes sur le site

source: Content
fr: Contenu

source: Make an eepsite! Add some content! Contribute to the community!
fr: Créez un site eep, ajoutez-y du contenu, contribuez à la communauté !

source: Run a service on an eepsite. It could be a proxy, a forum, a tracker, a naming service, a search engine, an eepsite monitor... many of these aren't that hard.
fr: Faites tourner un service sur un site eep. Cela pourrait être un mandataire, un forum, un traqueur, un système de noms, un moteur de recherche, un moniteur de sites eep... beaucoup d’entre eux ne sont pas si compliqués.

source: Write or port applications for I2P! There's some guidelines and a list of ideas on the <a href="%(apps)s">applications page</a>.
fr: Écrivez ou portez des applications vers I2P ! Il y a quelques directives et une liste d’idées sur la <a href="%(apps)s">page des applications</a>.

source: Coding
fr: Programmation

source: There's plenty to do if you know Java or are ready to learn. Check for open tickets on <a href="http://%(trac)s/report/1">Trac</a> or the TODO list on <a href="http://%(zzz)s">%(zzz)s</a> for some ideas on where to start. See the <a href="%(newdevs)s">new developer's guide</a> for details.
fr: Il y a beaucoup à faire si vous connaissez Java ou êtes prêts à apprendre. Vérifiez les tickets ouverts sur <a href="http://%(trac)s/report/1">Trac</a> ou la liste des choses à faire sur <a href="http://%(zzz)s">%(zzz)s</a> pour quelques idées afin de savoir où commencer. Consultez le guide du <a href="%(newdevs)s">nouveau développeur</a> pour plus de précisions.

source: Translation
fr: Traduction

source: Help translate the website and the software into your language. See the <a href="%(newtrans)s">new translator's guide</a> for details.
fr: Aidez à traduire le site et le logiciel dans votre langue. Consultez le guide du <a href="%(newtrans)s">nouveau traducteur</a> pour plus de précisions.

source: Analysis
fr: Analyse

source: Study or test the code to look for vulnerabilities. Both anonymity vulnerabilities from the various <a href="%(threatmodel)s">threat models</a>, and DOS and other weaknesses due to securities holes, need researching.
fr: Étudiez ou testez le code afin de chercher des vulnérabilités. À la fois les vulnérabilités d’anonymat depuis les différents <a href="%(threatmodel)s">modèles de menaces</a>, et DOS et d’autres faiblesses dues à des trous de sécurité, ont besoin de recherche.

source: Reseeding
fr: Réensemencement

source: Set up a reseed server for new routers to bootstrap from. Detailed instructions are on our <a href="%(reseed)s">reseed server page</a>.
fr: Mettre en place un serveur de réensemencement afin que les nouveaux routeurs puissent amorcer à partir de ce dernier. Des instructions détaillées se trouvent sur notre <a href="%(reseed)s">page sur le serveur de réensemencement</a>.

source: Roadmap
fr: Feuille de route

source: January 2016
fr: Janvier 2016

source: Reachability Mapping / handle peers partially reachable / enhanced <a href="%(todo)s#fullRestrictedRoutes">restricted routes</a>
fr: Cartographie d’accessibilité / traitement des pairs partiellement accessibles / <a href="%(todo)s#fullRestrictedRoutes">routes restreintes</a> améliorées

source: Full restricted routes
fr: Routes entièrement restreintes

source: Tunnel mixing and padding
fr: Mélange de tunnels et remplissage

source: User defined message delays
fr: Retards des messages définis par l’utilisateur

source: Please see the <a href="%(todo)s">TODO</a> list for more detailed info about some of these tasks.
fr: Pour des renseignements plus détaillés sur certaines de ces tâches veuillez voir la liste <a href="%(todo)s">À FAIRE</a>.

source: January 2017
fr: Janvier 2017

source: I2P Project Targets
fr: Objectifs du projet I2P

source: Core functionality
fr: Fonctionnalité de base

source: NetworkDB and profile tuning and ejection policy for large nets
fr: NetworkDB et réglage de profil et politique d’éjection pour grands réseaux

source: Security / anonymity
fr: Sécurité / anonymat

source: Full blown n-hop restricted routes with optional trusted links
fr: Routes restreintes "full blown n-hop" avec des liens de confiance facultatifs

source: Hashcash for routerIdentity, destination, and tunnel request
fr: Hashcash pour routerIdentity, destination, et requête de tunnel

source: Advanced tunnel operation (batching/mixing/throttling/padding)
fr: Fonctionnement évolué des tunnels (traitement par lot/mélange/limitation de la bande passante/remplissage)

source: Stop &amp; go mix w/ garlics &amp; tunnels
fr: Stop &amp; go mélangé avec tunnels ail

source: Note: This page is not up-to-date. See <a href="%(roadmap)s">the roadmap</a> for current plans.
fr: Note : Cette page n’est pas à jour. Vous trouverez les plans actuels dans <a href="%(roadmap)s">la feuille de route</a>.

source: Below is a more detailed (yet still incomplete) discussion of the major areas of future development on the core I2P network, spanning the plausibly planned releases. This does not include stego transports, porting to wireless devices, or tools to secure the local machine, nor does it include client applications that will be essential in I2P's success. There are probably other things that will come up, especially as I2P gets more peer review, but these are the main 'big things'. See also <a href="%(roadmap)s">the roadmap</a>. Want to help? <a href="%(volunteer)s">Get involved</a>!
fr: Ci-dessous une discussion plus détaillée (quoiqu’encore incomplète) des principales zones de développement dans le réseau I2P central, couvrant les versions plausibles prévues. Les transports stego, le portage sur des dispositifs sans fil ni les outils pour sécuriser la machine locale, ne sont inclus, pas plus que les applications client qui seront essentielles au succès d’I2P. D’autres choses feront probablement surface, plus particulièrement au fur et à mesure qu’I2P sera évalué par des pairs, mais ce sont les « choses principales ». Consultez aussi <a href="%(roadmap)s">la feuille de route. Voulez-vous aider ? <a href="%(volunteer)s">Impliquez-vous !</a>

source: Within the current network database and profile management implementation, we have taken the liberty of some practical shortcuts. For instance, we don't have the code to drop peer references from the K-buckets, as we don't have enough peers to even plausibly fill any of them, so instead, we just keep the peers in whatever bucket is appropriate. Another example deals with the peer profiles - the memory required to maintain each peer's profile is small enough that we can keep thousands of full blown profiles in memory without problems. While we have the capacity to use trimmed down profiles (which we can maintain 100s of thousands in memory), we don't have any code to deal with moving a profile from a "minimal profile" to a "full profile", a "full profile" to a "minimal profile", or to simply eject a profile altogether. It just wouldn't be practical to write that code yet, since we aren't going to need it for a while.
fr: Dans la base de données de réseau actuelle et la mise en œuvre de gestion de profil, nous avons pris la liberté de quelques raccourcis pratiques. Par exemple, nous n’avons pas le code pour laisser tomber les références du pair depuis les seaux-K, comme nous n’avons pas assez de pairs afin de même plausiblement les remplir tous, car au lieu de cela, nous gardons juste les pairs dans n’importe quel seau approprié. Un autre exemple traite des profils les pairs - la mémoire exigée pour maintenir le profil de chaque pair est si petite que nous pouvons garder des milliers de profils pleinement soufflés dans la mémoire sans problèmes. Tandis que nous avons la capacité d’utiliser des profils à coupe basse (que nous pouvons maintenir 100s de milliers dans la mémoire), nous n’avons aucun code à traiter concernant le déplacement d’un profil depuis un "profil minimal" vers un "profil complet", un "profil complet" vers un "profil minimal" ou pour simplement éjectez un profil tout ensemble. Il ne serait simplement pas pratique d’écrire ce code dès maintenant, puisque nous n’allons pas en avoir besoin pendant un certain temps.

source: That said, as the network grows we are going to want to keep these considerations in mind. We will have some work to do, but we can put it off for later.
fr: Cela dit, comme le réseau grandit nous allons vouloir garder ces considérations à l’esprit. Nous aurons du travail à faire, mais nous pouvons le remettre à plus tard.

source: The restricted route functionality described before was simply a functional issue - how to let peers who would not otherwise be able to communicate do so. However, the concept of allowing restricted routes includes additional capabilities. For instance, if a router absolutely cannot risk communicating directly with any untrusted peers, they can set up trusted links through those peers, using them to both send and receive all of its messages. Those hidden peers who want to be completely isolated would also refuse to connect to peers who attempt to get them to (as demonstrated by the garlic routing technique outlined before) - they can simply take the garlic clove that has a request for delivery to a particular peer and tunnel route that message out one of the hidden peer's trusted links with instructions to forward it as requested.
fr: La fonction de route restreinte décrite auparavant était simplement un problème fonctionnel - comment laisser communiquer des pairs qui autrement n’en seraient pas capables. Cependant, le concept de permettre des routes restreintes inclut des capacités supplémentaires. Par exemple, si un routeur ne peut pas absolument pas risquer de communiquer directement avec n’importe quels pairs non éprouvés, il peut installer des liens éprouvés à travers ces pairs, les utilisant pour à la fois envoyer et recevoir tous ses messages. Ces pairs cachés qui veulent être complètement isolés refuseraient aussi de se connecter aux pairs qui essayent de s’y connecter (comme démontré par la technique de routage en ail décrite auparavant) - ils peuvent simplement prendre le clou de girofle ail qui a une requête de livraison vers un pair particulier et une route tunnel qui sort le message hors des liens de confiance du pairs caché avec instruction de le faire suivre comme demandé.

source: Within the network, we will want some way to deter people from consuming too many resources or from creating so many peers to mount a <a href="%(link)s">Sybil</a> attack. Traditional techniques such as having a peer see who is requesting a resource or running a peer aren't appropriate for use within I2P, as doing so would compromise the anonymity of the system. Instead, we want to make certain requests "expensive".
fr: Dans le réseau, nous voudrons une façon de dissuader des gens de consommer trop de ressources ou de créer suffisamment de pairs leur permettant de monter une attaque <a href="%(link)s">Sybil</a>. Des techniques traditionnelles comme avoir un pair capable de voir qui demande une ressource ou exécute un pair ne sont pas appropriées à l’usage dans I2P, car faire ainsi mettrait en péril l’anonymat du système. Au lieu de cela, nous voulons rendre certaines requêtes "chères".

source: <a href="http://www.hashcash.org/">Hashcash</a> is one technique that we can use to anonymously increase the "cost" of doing certain activities, such as creating a new router identity (done only once on installation), creating a new destination (done only once when creating a service), or requesting that a peer participate in a tunnel (done often, perhaps 2-300 times per hour). We don't know the "correct" cost of each type of certificate yet, but with some research and experimentation, we could set a base level that is sufficiently expensive while not an excessive burden for people with few resources.
fr: <a href="http://www.hashcash.org/">Hashcash</a> est une technique que nous pouvons utiliser pour augmenter anonymement le "coût" de faire certaines activités, telles que la création d’une nouvelle identité de routeur (faite une seule fois par installation), la création d’une nouvelle destination (faite une seule fois lors de la création d’un service), ou la requête vers un pair afin qu’il participe à un tunnel (faite souvent, peut-être 2-300 fois par heure). Nous ne savons pas encore le coût "correct" de chaque type de certificat, mais avec un peu de recherche et d’expérimentation, nous pourrions mettre un niveau de base qui soit suffisamment cher tout en n’étant pas un fardeau excessif pour les gens ayant peu de ressources.

source: There are a few other algorithms that we can explore for making those requests for resources "nonfree", and further research on that front is appropriate.
fr: Il y a quelques autres algorithmes que nous pouvons explorer pour rendre ces requêtes de ressources "non gratuites", et davantage de recherches sur ce front seront appropriées.

source: To powerful passive external observers as well as large colluding internal observers, standard tunnel routing is vulnerable to traffic analysis attacks - simply watching the size and frequency of messages being passed between routers. To defend against these, we will want to essentially turn some of the tunnels into its own mix cascade - delaying messages received at the gateway and passing them in batches, reordering them as necessary, and injecting dummy messages (indistinguishable from other "real" tunnel messages by peers in the path). There has been a significant amount of <a href="%(pdf)s">research</a> on these algorithms that we can lean on prior to implementing the various tunnel mixing strategies.
fr: Pour les observateurs externes passifs puissants aussi bien que les observateurs de grands attaques par collusion, le routage standard de tunnel est vulnérable aux attaques d’analyse de trafic - simplement en observant la taille et la fréquence des messages étant passés entre les routeurs. Pour se défendre contre ceci, nous voudrons essentiellement rendre certains des tunnels afin d’être leurs propres mélangeurs en cascade - retardant des messages reçus à la passerelle et les transmettant en lots, les réordonnant si nécessaire, et injectant des messages factices (indiscernables d’autre messages de tunnels "réels" par les pairs dans le chemin). Il y a eu une quantité significative de <a href="%(pdf)s">recherche</a> concernant ces algorithmes de sorte que nous pouvons nous pencher sur la mise en œuvre des diverses stratégies de mélange de tunnels.

source: In addition to the anonymity aspects of more varied tunnel operation, there is a functional dimension as well. Each peer only has a certain amount of data they can route for the network, and to keep any particular tunnel from consuming an unreasonable portion of that bandwidth, they will want to include some throttles on the tunnel. For instance, a tunnel may be configured to throttle itself after passing 600 messages (1 per second), 2.4MB (4KBps), or exceeding some moving average (8KBps for the last minute). Excess messages may be delayed or summarily dropped. With this sort of throttling, peers can provide ATM-like QoS support for their tunnels, refusing to agree to allocate more bandwidth than the peer has available.
fr: En plus des aspects d’anonymat des autres diverses opérations de tunnel, Il y a aussi une dimension fonctionnelle. Chaque pair a seulement une certaine quantité de données qu’il peut router pour le réseau, et afin d’empêcher n’importe quel tunnel de consommer une portion déraisonnable de cette bande passante, il voudra inclure quelques étrangleurs sur le tunnel. Par exemple, un tunnel peut être configuré pour s’étrangler lui-même après le passage de 600 messages (1 par seconde), 2,4 Mo (4 Kbps), ou avoir excédé une certaine moyenne mouvante (8 Kbps durant la dernière minute). Les messages en excès peuvent être retardés ou abandonnés sommairement. Avec ce type d’étranglement, les pairs peuvent fournir du soutien de QoS semblable à l’ATM pour leurs tunnels, refusant d’accorder d’allouer davantage de bande passante que les pairs en ont de disponible.

source: In addition, we may want to implement code to dynamically reroute tunnels to avoid failed peers or to inject additional hops into the path. This can be done by garlic routing a message to any particular peer in a tunnel with instructions to redefine the next-hop in the tunnel.
fr: De plus, nous pouvons vouloir mettre en œuvre le code pour dévier (reroute) dynamiquement des tunnels pour éviter pairs en échec ou injecter des étapes supplémentaires dans le chemin. Ceci peut être fait en acheminement en ail (garlic routing) un message à un pair particulier dans un tunnel avec des instructions afin de redéfinir l’étape suivante dans le tunnel.

source: Beyond the per-tunnel batching and mixing strategy, there are further capabilities for protecting against powerful attackers, such as allowing each step in a garlic routed path to define a delay or window in which it should be forwarded on. This would enable protections against the long term intersection attack, as a peer could send a message that looks perfectly standard to most peers that pass it along, except at any peers where the clove exposed includes delay instructions.
fr: Au-delà du groupage en lot par-tunnel et de la stratégie de mélange, il y a de nouvelles possibilités pour se protéger contre des attaquants puissants, comme permettre à chacun étape dans le parcours acheminé en ail de définir un retard ou une fenêtre durant lequel il devrait être expédié vers. Ceci permettrait des protections contre l’attaque d’intersection à long terme, car un pair pourrait envoyer un message qui semble parfaitement standard à la plupart des pairs qui le font passer, sauf aux pairs pour lesquels le clou de girofle (clove) exposé inclut des instructions de retard.

source: Performance related improvements are listed on the <a href="%(futureperf)s">Performance</a> page.
fr: Les améliorations en relevé avec la performance sont listées sur la page <a href="%(futureperf)s">Performance</a>.

source: Bounty Arabic translation of webpage and router console
fr: Prime pour traduction arabe de la page Web et de la console du routeur

source: Arabic translation
fr: Traduction en arabe

source: To improve I2P usage and attract more people into I2P echelon set out this bounty for translation of the I2P web page and I2P router console into Arabic.
fr: Pour augmenter l’utilisation d’I2P et afin d’attirer plus d’utilisateurs vers I2P, echelon à mis en place cette prime de traduction de la page Web d’I2P et de la console du routeur I2P en arabe.

source: This bounty is set into 2 subparts:
fr: Cette prime est composée de 2 sous-parties :

source: Part 1 is translation of the webpage.
fr: La partie 1 est la traduction de la page Web.

source: For collecting the bounty of 20 BTC you need to translate the following pages:
fr: Pour percevoir la prime de 20 BTC vous devez traduire les pages suivantes :

source: This job was done by hamada and the bounty of 20 BTC was paid to hamada.
fr: Ce travail a été fait par hamada et la prime de 20 BTC a été payée à hamada.

source: Part 2 is the translation of the router console. The router console was partly translated and the bounty of 80 BTC was paid to hamada.
fr: La seconde partie est la traduction de la console du routeur. La console du routeur a été traduite partiellement et la prime de 80 BTC a été payée à hamada.

source: Judge is echelon.
fr: Le juge est echelon.

source: Bounty creating a I2P native Bitcoin client
fr: Prime pour créer un client Bitcoin natif à I2P

source: BTC I2P native client
fr: Client natif I2P BTC

source: For a future of I2P and attract more people into I2P this bounty is to create a I2P native Bitcoin client. It should integrate with other client via the I2P network and via gateways to the existant bitcoin network.
fr: Pour l’avenir d’I2P et afin d’attirer plus d’utilisateurs vers I2P, cette prime est pour créer un client Bitcoin natif à I2P. Il devrait s’intégrer aux autres clients par le réseau I2P et par les passerelles vers le réseau Bitcoin existant.

source: Judge is psychonaut who donated the first 30 &euro; to this bounty. Bounty was almost fullfilled with <a href="http://echelon.i2p/btci2p/">btci2p</a>, only a small part of creating a plugin is leftover. User giv has been paid for the work.
fr: Le juge est psychonaut qui a fait don des 30 premiers &euro; pour cette prime. La prime était presque satisfaite avec <a href="http://echelon.i2p/btci2p/">btci2p</a>, il ne reste plus qu’une petite partie de la création du greffon. L’utilisateur giv a été payé pour ce travail.

source: Bounty datastorage
fr: Prime datastorage (système de fichiers distribués)

source: datastore
fr: système de fichiers distribué
