Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: fr

source: So you want to start work on I2P? Great! Here's a quick guide to getting started on contributing to the website or the software, doing development or creating translations.
fr: Donc vous voulez commencer à travailler sur I2P ? Très bien ! Voici un guide rapide pour commencer en contribuant au site web ou au logiciel, faire du développement ou créer des traductions.

source: Not quite ready for coding? Try <a href="%(volunteer)s">getting involved</a> first.
fr: Pas tout à fait prêt pour programmer ? essayez d’abord de <a href="%(volunteer)s">devenir impliqué</a>.

source: Basic development on the I2P router or the embedded applications uses Java as the main development language. If you don't have experience with Java, you can always have a look at <a href="http://www.mindview.net/Books/TIJ/">Thinking in Java</a>.
fr: Le développement de base concernant le routeur I2P ou les applications embarquées utilisent Java comme principal langage de développement. Si vous n’avez pas d’expérience avec Java, vous pouvez toujours regarder <a href="http://www.mindview.net/Books/TIJ/">Thinking in Java</a>.

source: Study the <a href="%(intro)s">how intro</a>, the <a href="%(docs)s">other "how" documents</a>, the <a href="%(techintro)s">tech intro</a>, and associated documents. These will give you a good overview of how I2P is structured and what different things it does.
fr: Étudiez la<a href="%(intro)s">présentation « Comment »</a>, les <a href="%(docs)s">autres documents « Comment »</a>, la<a href="%(techintro)s">présentation « Tech » </a> et les documents connexes. Ils vous donneront une bonne vue d’ensemble de la structure d’I2P et de la fonction de différents éléments.

source: For development on the I2P router or the embedded applications, there are two ways to get the source code:
fr: Pour développement concernant le routeur I2P ou les applications incorporées, il y a deux façons d’obtenir le code source :

source: Install <a href="%(git_url)s">Git</a>.
fr: Installer <a href="%(git_url)s">Git</a>.

source: Get the code from <a href="%(i2p_git)s">the GitHub mirror</a>:
fr: Obtenir le code depuis <a href="%(i2p_git)s">le miroir GitHub</a>:

source: Remarks
fr: Remarques

source: The Git repository is currently a read-only mirror. If you wish to use it for development, you will need to submit patches to <a href="%(trac)s">our issue tracker</a>. We can accept GitHub pull requests, but they must be processed manually by turning them into patches anyway.
fr: Le dépôt Git est actuellement un miroir en lecture seule. Si vous souhaitez l’utiliser pour le développement, vous devrez soumettre vos correctifs à <a href="%(trac)s">notre système de suivi de problèmes</a>. Nous pouvons accepter les requêtes d’extraction vers GitHub, mais elles doivent être traitées manuellement en les transformant en correctifs de toute façon.

source: Install <a href="http://www.monotone.ca/">monotone</a>. Monotone is a version control system. We use it because it allows us to keep track of who does what changes to the source code (and for a lot of complicated things, but 'keeping track of changes' is the basic idea).
fr: Installez <a href="http://www.monotone.ca/">Monotone</a>. Monotone est un système de contrôle de version. Nous l’utilisons parce qu’il nous permet de garder la trace de qui fait quels changements au code source (et pour beaucoup de choses compliquées, mais 'garder la trace des changements' est l’idée de base).

source: Skim over the <a href="http://www.monotone.ca/docs/Tutorial.html">monotone tutorial</a>, to make sure you understand the concepts.
fr: Lisez le <a href="http://www.monotone.ca/docs/Tutorial.html">tutoriel de Monotone</a>, pour vous assurer vous comprenez les concepts.

source: If you want to remain anonymous, you need to do an additional step, to set up a connection to a monotone server over I2P:
fr: Si vous voulez rester anonyme, vous devez faire une étape supplémentaire, pour configurer une connexion à un serveur Monotone au travers d’I2P :

source: Enable the <a href="%(i2ptunnel)s">i2ptunnel</a> client tunnel on port 8998 pointing to mtn.i2p-projekt.i2p.
fr: Activer le tunnel client d'<a href="%(i2ptunnel)s">i2ptunnel</a> sur le port 8998 dirigé vers mtn.i2p-projekt.i2p.

source: Pick a directory where you want to put all your I2P files, and create a monotone database:
fr: Choisissez un répertoire dans lequel vous voulez mettre tous vos fichiers I2P, et créez une base de données Monotone :

source: Define the trust list by creating <code>~/.monotone/monotonerc</code> (or <code>_MTN/monotonerc</code> in the i2p.i2p workspace) with the following contents:
fr: Définissez la liste de confiance en créant <code>~/.monotone/monotonerc</code> (ou <code>_MTN/monotonerc</code> dans l’espace de travail i2p.i2p) avec le contenu suivant :

source: Copy and paste the <a href="%(devkeys)s">developer's commit keys</a> into a new file (e.g. <code>keys.txt</code>) in the same directory that <code>i2p.mtn</code> is in. Import the keys into your database with <br><code><pre> mtn -d i2p.mtn read < keys.txt</pre></code>
fr: Copiez et collez les <a href="%(devkeys)s">clés d’archivage des développeurs</a> dans un nouveau fichier (p. ex. <code>clés.txt</code>) dans le même répertoire que <code>i2p.mtn</code>. Importez les clés dans votre base de données avec <br><code><pre> mtn -d i2p.mtn read < clés.txt</pre></code>

source: Pull the I2P sources to your machine. This may take a long time, especially if you are doing this over I2P!
fr: Tirez les sources d’I2P vers votre machine. Cela peut prendre longtemps, en particulier si vous le faites à travers I2P !

source: Anonymously:
fr: Anonymement :

source: Non-anonymously:
fr: Non anonyme :

source: All the sources are now present on your machine, in the database file. To make them available in a directory, you need to check them out:
fr: Toutes les sources sont maintenant présentes sur votre machine, dans le fichier de base de données. Pour les rendre disponibles dans un répertoire, vous devez les vérifier :

source: The above command creates a directory i2p.i2p, which contains all of the I2P sources.
fr: La commande susdite crée un répertoire i2p.i2p, qui contient toutes les sources d’I2P.

source: To download the website files instead of the I2P source files, use 'i2p.www' instead of 'i2p.i2p'.
fr: Pour télécharger les fichiers du site web à la place des fichiers source d’I2P, utiliser 'i2p.www' à la place de 'i2p.i2p'.

source: The initial pull may take several hours using the tunnel. If it fails after a partial pull, simply rerun it, it will start where it left off. If you are in a hurry, use the non-anonymous access.
fr: La traction initiale peut prendre plusieurs heures en utilisant le tunnel. Si elle échoue après une traction partielle, simplement relancez-la, elle commencera là où elle s’est arrêtée. Si vous êtes pressé, utilisez l’accès non-anonyme.

source: A full list of branches, including i2p.i2p and i2p.www can be found on <a href="%(viewmtn)s">viewmtn</a>.
fr: Une liste complète de branches, y compris i2p.i2p et i2p.www peuvent être trouvées sur <a href="%(viewmtn)s">viewmtn</a>.

source: A long explanation about using monotone is available on the <a href="%(monotone)s">monotone page</a>.
fr: Une longue explication concernant l’utilisation de monotone est disponible sur la <a href="%(monotone)s">page Monotone</a>.

source: To compile the code, you need the Sun Java Development Kit 6 or higher, or equivalent JDK (<a href="%(sunjdk6)s">Sun JDK 6</a> strongly recommended) and <a href="http://ant.apache.org/">Apache ant</a> version 1.7.0 or higher. If you go are working on the main I2P code, you can go into the i2p.i2p directory and run 'ant' to see the build options.
fr: Pour compiler le code, vous avez besoin de Sun Java Development Kit 6 ou plus récente, ou HDJ équivalent (<a href="%(sunjdk6)s">Sun JDK 6</a> fortement recommandé) et <a href="http://ant.apache.org/">Apache Ant</a> version 1.7.0 ou plus récente. Si vous comptez travailler sur le code principal d’I2P, vous pouvez aller au répertoire i2p.i2p et exécuter 'ant' pour voir les options de construction.

source: To build or work on console translations, you need the xgettext, msgfmt, and msgmerge tools from the <a href="http://www.gnu.org/software/gettext/">GNU gettext package</a>.
fr: Pour construire ou travailler sur les traductions de console, vous avez besoin des outils xgettext, msgfmt, et msgmerge issus du <a href="http://www.gnu.org/software/gettext/">GNU gettext package</a>.

source: For development on new applications, see the <a href="%(apps)s">application development guide</a>.
fr: Pour le développement de nouvelles applications, voyez le <a href="%(apps)s">guide de développement d’application</a>.

source: See <a href="http://%(zzz)s/forums/3">zzz's TODO lists</a>, <a href="%(todo)s">this website's TODO list</a> or <a href="%(trac)s">Trac</a> for ideas.
fr: Voir la <a href="http://%(zzz)s/forums/3">liste de zzz de TODO (choses à faire)</a>, <a href="%(todo)s">liste TODO concernant ce site web</a> ou <a href="%(trac)s">Trac</a> pour des idées.

source: See the bottom of <a href="%(licenses)s#commit">the licenses page</a> for commit privilege requirements. You need these to put code into i2p.i2p (not required for the website!).
fr: Voyez en bas de <a href="%(licenses)s#commit">la page licences</a> pour les exigences de privilège d’engagement. Vous avez besoin de ceux-ci pour mettre du code dans i2p.i2p (non exigé pour le site web !).

source: Short version of how to generate and use keys if you plan to commit:
fr: Version courte sur la façon de générer et utiliser des clés si vous planifiez de vous engager :

source: use an empty passphrase
fr: utiliser une phrase de passe vide

source: enter a passphrase
fr: saisir une phrase de passe

source: <a href="mailto:%(email)s">send</a> this to a mtn repo operator to get push privileges
fr: <a href="mailto:%(email)s">envoyer</a> ceci à un opérateur de dépôt mtn pour obtenir les privilèges de poussée

source: send this to <a href="mailto:%(email)s">a release manager</a> to get commit privileges - not required for website
fr: envoyez ceci à <a href="mailto:%(email)s">un responsable des parutions</a> pour obtenir des privilèges d’archivage - n’est pas exigé pour le site Web

source: check in with this key
fr: vérifiez avec cette clé

source: push with this key
fr: pousser avec cette clé

source: Long version: see the <a href="%(monotone)s">monotone page</a>.
fr: Version longue : voyez la <a href="%(monotone)s">page Monotone</a>.

source: The developers hang around on IRC. They can be reached on the Freenode network, OFTC, and on the I2P internal networks. The usual place to look is #i2p-dev. Join the channel and say hi! We also have <a href="%(guidelines)s">additional guidelines for regular developers</a>.
fr: Les développeurs traînent sur IRC. Ils peuvent être atteints sur le réseau Freenode, OFTC, et sur les réseaux internes d’I2P. L’endroit habituel à regarder est #i2p-dev. Rejoignez le canal et dites salut ! Nous avons aussi des <a href="%(guidelines)s">directives supplémentaires pour les développeurs habitués</a>.

source: Website and router console translators: See the <a href="%(newtrans)s">New Translator's Guide</a> for next steps.
fr: Traducteurs du site Web et de la console routeur : voyez le <a href="%(newtrans)s">Guide du nouveau traducteur</a> pour les étapes suivantes.

source: I2P is open source software that is mostly developed using open sourced toolkits. The I2P project recently acquired a license for the YourKit Java Profiler. Open source projects are eligible to receive a free license provided that YourKit is referenced on the project web site. Please get in touch if you are interested in profiling the I2P codebase.
fr: I2P est un logiciel à code source ouvert qui est surtout développé en utilisant des boîtes à outils à code source ouvert. Le projet I2P a récemment fait l’acquisition d’une licence du profileur Java YourKit. Les projets à code source ouvert peuvent recevoir une licence gratuite tant qu’ils font référence à YourKit sur le site Web du projet. Veuillez nous contacter si vous souhaitez profiler le code base d’I2P.

source: YourKit is kindly supporting open source projects with its full-featured Java Profiler. YourKit, LLC is the creator of innovative and intelligent tools for profiling Java and .NET applications. Take a look at YourKit's leading software products: <a href="%(java)s">YourKit Java Profiler</a> and <a href="%(dotnet)s">YourKit .NET Profiler</a>.
fr: YourKit soutient avec bonté des projets open source avec son Java Profiler toutes options. YourKit, LLC est le créateur d’outils novateurs et intelligents pour le profilage d’applications Java et .NET. Jetez un coup d’œil aux produits logiciels principaux de YourKit : <a href="%(java)s">YourKit Java Profiler</a> et <a href="%(dotnet)s">YourKit .NET Profiler</a>.

source: New Translator's Guide
fr: Guide du nouveau traducteur

source: Here's a very quick guide to getting started.
fr: Voici un guide très rapide pour débuter.

source: How to Translate the Website
fr: Comment traduire le site web

source: Translation of the website is done with .po files. The easiest way by far to translate the website is to sign up for an account at <a href="%(transifex)s">Transifex</a> and request to join a translation team. Alternatively it can be done "the old way" as outlined below.
fr: La traduction du site Web est faite avec des fichiers .po. De loin la façon la plus facile de traduire le site Web est de créer un compte sur <a href="%(transifex)s">Transifex</a> et demander à rejoindre une équipe de traduction. Autrement cela peut être fait de la "vieille façon" comme décrit ci-dessous.

source: Preparation
fr: Préparation

source: Come to #i2p-dev on irc and talk to people. Claim the language - To make sure other coworkers don't bump onto the files you are working on, please update the translation status on <a href="%(url)s">this wiki page</a>.
fr: Venez dans #i2p-dev sur irc et parlez aux gens. Revendiquez la langue - Pour vous assurer que d’autres collègues n’utilisent pas les fichiers sur lesquels vous travaillez, veuillez mettre à jour l’état de traduction sur <a href="%(url)s">cette page wiki</a>.

source: Follow the <a href="%(newdevs)s">new developer's guide</a>, Including the installation of monotone, checking out i2p.www branch, and generate your own monotone keys. It is not required that you sign a dev agreement.
fr: Suivez le <a href="%(newdevs)s">guide du nouveau développeur</a>, incluant l’installation de monotone, examiner la branche i2p.www, et générer vos propres clés Monotone. Il n’est pas exigé que vous signiez un accord de dév.

source: <b>Create files:</b> If the file for your language does not exist yet:
fr: <b>Créer fichiers :</b> Si le fichier pour votre langue n’existe pas encore :

source: Run "<code>./extract-messages.sh</code>" to generate a <code>messages.pot</code> in the base directory. Edit the header of this file, then run "<code>./init-new-po.sh locale</code>" to generate the file <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. "<code>mtn add</code>" this file.
fr: Exécutez "<code>./extract-messages.sh</code>" pour générer un <code>messages.pot</code> dans le répertoire de base. Éditez l’en-tête de ce fichier, puis exécutez "<code>./init-new-po.sh locale</code>" pour générer le fichier <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. "<code>mtn add</code>" ce fichier.

source: Edit <code>i2p2www/pages/global/lang.html</code> and add a line for your language (copy an existing line).
fr: Éditez <code>i2p2www/pages/global/lang.html</code> et ajoutez une ligne pour votre langue (copiez une ligne existante).

source: Add a flag image file to <code>i2p2www/static/images/flags/</code> for the menu (copy from the router).
fr: Ajoutez un fichier d’image de drapeau à <code>i2p2www/static/images/flags/</code> pour le menu (copiez depuis le routeur).

source: <b>Edit files:</b> Edit <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. To work with .po files efficiently, you may wish to use <a href="http://www.poedit.net/download.php">POEdit</a>
fr: <b>Éditer les fichiers :</b> Éditez <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. Pour travailler efficacement avec les fichiers .po, vous pourriez vouloir utiliser <a href="http://www.poedit.net/download.php">POEdit</a>

source: <b>Check in:</b> "<code>mtn pull</code>", "<code>mtn update</code>". Then check in by "<code>mtn ci -k yourname@mail.i2p file1 file2 ...</code>" This collects the diff info of your changed file into your local repo. Then "<code>mtn sync mtn.i2p2.de -k yourname-transport@mail.i2p i2p.i2p</code>". This synchronizes your local repo with the repo on the target machine.
fr: <b>Relève :</b> « <code>mtn pull</code> », « <code>mtn update</code> ». Puis vérification par « <code>mtn ci -k votrenom@mail.i2p file1 file2 ...</code> » Cela recueille les infos diff de vos fichiers modifiés dans votre dépôt local. Puis « <code>mtn sync mtn.i2p2.de -k votrenom-transport@mail.i2p i2p.i2p</code> ». Cela synchronise votre dépôt local avec le dépôt de la machine cible.

source: Repeat. Check in often. Don't wait until it is perfect.
fr: Répétez. Vérifiez souvent. N’attendez pas jusqu’à ce que tout soit parfait.

source: How to Translate the Router Console
fr: Comment traduire la console de routeur

source: The easiest way by far to translate the router console is to sign up for an account at <a href="%(transifex)s">Transifex</a> and request to join a translation team. Alternatively it can be done "the old way" as outlined below.
fr: La façon de loin la plus facile pour traduire la console de routeur est de s’inscrire pour un compte chez <a href="%(transifex)s">Transifex</a> et demander à rejoindre une équipe de traduction. Autrement cela peut être fait de la "vieille façon" comme décrit ci-dessous.

source: Follow the <a href="%(newdevs)s">new developer's guide</a>, including the installation of monotone and the gettext tools, checking out i2p.i2p branch, and generate your own monotone keys.
fr: Suivez le <a href="%(newdevs)s">guide du nouveau développeur</a>, incluant l’installation de Monotone et des outils gettext, la vérification de la branche i2p.i2p , et la génération de vos propres clés Monotone.

source: Generate your own gpg key and sign the dev agreement.
fr: Générez votre propre clé GPG et signez l’accord de dev.

source: Before starting a console translation, better help translate some i2p webpages first. At least an i2p homepage in your language would be great.
fr: Avant le départ d’une traduction de la console, il est mieux de traduire d’abord quelques pages web I2P. Au minimum une page d’accueil I2P dans votre langue serait super.

source: <b>What to translate:</b> There are about 15 files in the i2p.i2p branch that needs translation:
fr: <b>Que traduire :</b> Il y a environ 15 fichiers dans la branche i2p.i2p qui nécessitent d’être traduits :

source: Where xx is your language code like fr/de/ch/zh/... There may be or may not be files with your lang code. If not, you can create your own. by copying and renaming other language files you know with your own lang code.
fr: Où xx est votre code langue comme fr/de/ch/zh/... Il peut y avoir ou ne pas y avoir des fichiers avec votre code de langue. Sinon, vous pouvez créer le votre. En copiant et rebaptisant d’autres fichiers de langue vous connaissez avec votre propre code de langue.

source: <b>Create files:</b> If the file for your language does not exist yet, copy another language file to a new file <code>foo_xx.bar</code> for your language. Then "<code>mtn add</code>" the file. After creating a .po file, edit the headers. Then run "<code>ant distclean poupdate</code>".
fr: <b>Créer des fichiers :</b> Si le fichier pour votre langue n’existe pas encore, copiez un fichier d’une autre langue vers un nouveau fichier <code>foo_xx.bar</code> pour votre langue. Puis "<code>mtn add</code>" le fichier. Après la création d’un fichier .po, éditez les en-têtes. Puis lancez "<code>ant distclean poupdate</code>".

source: <b>Start to work:</b> Edit the HTML files with any text editor. Be sure not to use an editor in HTML mode that reformats everything. To work with .po files efficiently, you may wish to use <a href="http://www.poedit.net/download.php">POEdit</a>
fr: <b>Commenez à travailler :</b> Éditez les fichiers HTML avec n’importe quel éditeur de texte. Assuyez vous de ne pas utiliser un éditeur en mode de HTML qui reformate tout. Pour travailler efficacement avec des fichiers .po, vous pourriez vouloir utiliser <a href="http://www.poedit.net/download.php">POEdit</a>

source: As you can see, it's not that difficult. If you have questions about the meaning of the terms in the console, ask in <code>#i2p-dev</code> on IRC.
fr: Comme vous pouvez le voir, ce n’est pas si difficile. Si vous avez des questions concernant la signification de termes dans la console, demandez sur IRC dans <code>#i2p-dev</code>.

source: Q: Why do I have to install monotone, Java, jsp, learn about .po files and html, etc.? Why can't I just do a translation and email it to you?
fr: Q : Pourquoi dois-je installer Monotone, Java, jsp, me familiariser avec les fichiers .po et HTML, etc.&nbsp;? Pourquoi ne puis-je juste pas faire une traduction et vous l’envoyer par courriel&nbsp;?

source: A: Several reasons:
fr: R : Plusieurs raisons :

source: You might be interested in translating via Transifex. Request to join a translation team <a href="%(transifex)s">here</a>.
fr: Vous pourriez être intéressé à traduire dans Transifex. Demandez <a href="%(transifex)s">ici</a> à vous joindre à une équipe de traduction.

source: We don't have anybody who has time to accept manual contributions and submit them to our source control system on your behalf. Even if we did, it doesn't scale.
fr: Nous n’avons personne qui aie le temps d’accepter des contributions manuelles et les soumettre à notre système de contrôle source en votre nom. Même si nous l’avons eu fait, cela n’est pas possible à grande échelle.

source: Maybe you are thinking translation is a one-step process. It isn't. You can't do it all at once. You will make mistakes. You need to test it and tweak it to make it look right <i>before</i> you submit it. Developers will update or add to the English text, thus requiring a translation update.
fr: Peut-être pensez vous que la traduction est un processus en une seule étape. Cela ne l’est pas. Vous ne pouvez pas tout faire en une seule fois. Vous ferez des erreurs. Vous devrez la tester et l’adapter afin qu’elle paraisse bien <i>avant</i> que vous ne la soumettiez. Les développeurs mettront à jour ou feront des ajouts au texte anglais, exigeant ainsi une mise à jour des traductions.

source: Having translators use a source control system directly provides authentication and accountablility - we know who is doing what, and we can track changes, and revert them if necessary.
fr: Avoir des traducteurs utilisant directement un système de gestion des sources permet l’authentification et la responsabilité - nous savons qui fait quoi et nous pouvons suivre à la trace les changements, et les annuler si nécessaire.

source: .po files are not difficult. If you don't want to work directly with them, we recommend 'poedit'.
fr: Les fichiers .po ne sont pas difficiles. Si vous ne voulez pas travailler directement avec eux, nous recommandons 'poedit'.

source: HTML files are not difficult. Just ignore the html stuff and translate the text.
fr: Les fichiers HTML ne sont pas difficiles. Ignorez simplement les éléments HTML et traduisez le texte.
