Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: fr

source: If your application is distributed, it will require connections to a large amount of peers. Using I2PTunnel, you will need to create a new tunnel for each peer you want to contact, as shown in <a href="#tunnel.peertopeer">Figure 2</a>. This process can of course be automated, but running a lot of I2PTunnel instances creates a large amount of overhead. In addition, with many protocols you will need to force everyone to use the same set of ports for all peers - e.g. if you want to reliably run DCC chat, everyone needs to agree that port 10001 is Alice, port 10002 is Bob, port 10003 is Charlie, and so on, since the protocol includes TCP/IP specific information (host and port).
fr: Si votre application est distribuée, elle exigera des connexions vers un grand nombre de pairs. En utilisant I2PTunnel, vous devrez créer un nouveau tunnel pour chaque pair que vous voulez contacter, comme illustré sur la <a href="#tunnel.peertopeer">Figure 2</a>. Ce processus peut bien sûr être automatisé, mais exécuter beaucoup d’instances I2PTunnel augmente grandement la surcharge. De plus, avec de nombreux protocoles vous devrez forcer tout le monde à utiliser le même jeu de ports pour tous les pairs - par exemple si vous voulez exécuter de façon fiable des conversations DCC, tout le monde doit accepter que le port 10001 soit Alice, le port 10002 soit Bob, le port 10003 soit Charlie et ainsi de suite, puisque le protocole inclut des informations spécifiques TCP/IP (hôte et port).

source: General network applications often send a lot of additional data that could be used to identify users. Hostnames, port numbers, time zones, character sets, etc. are often sent without informing the user. As such, designing the network protocol specifically with anonymity in mind can avoid compromising user identities.
fr: Les applications de réseau générales envoient souvent beaucoup de données supplémentaires qui pourraient être utilisées pour identifier des utilisateurs. Noms d’hôtes, numéros de ports, fuseaux horaires, jeux de caractères, etc sont souvent envoyés sans informer l’utilisateur. Par conséquent, concevoir le protocole de réseau avec spécifiquement l’anonymat en mémoire peut éviter de mettre en péril les identités d’utilisateurs.

source: There are also efficiency considerations to review when determining how to interact on top of I2P. The streaming library and things built on top of it operate with handshakes similar to TCP, while the core I2P protocols (I2NP and I2CP) are strictly message based (like UDP or in some instances raw IP). The important distinction is that with I2P, communication is operating over a long fat network - each end to end message will have nontrivial latencies, but may contain payloads of up to several KB. An application that needs a simple request and response can get rid of any state and drop the latency incurred by the startup and teardown handshakes by using (best effort) datagrams without having to worry about MTU detection or fragmentation of messages.
fr: Il y a aussi des considérations d’efficacité à examiner en déterminant comment interagir au-dessus d’I2P. La bibliothèque de diffusion et les choses construites au-dessus d’elle fonctionnent avec des poignées de main semblables à TCP, tandis que les protocoles du cœur d’I2P (I2NP et I2CP) s’appuient strictement sur les messages (comme UDP ou dans quelques instances IP bruts). La distinction importante est qu’avec I2P, la communication fonctionne sur un long gros réseau ; chaque message de bout en bout aura des latences relativement importantes, mais peut contenir des charges utiles pesant jusqu’à plusieurs kilooctets. Une application qui a besoin d’une simple requête et d’une réponse peut se débarrasser de n’importe quel état et réduire la latence encourue par le démarrage et les poignées de main de lancement et démontage, en utilisant (meilleur effort) des datagrammes sans avoir à s’inquiéter de la détection de la MTU ni de la fragmentation des messages.

source: Creating a server-client connection using I2PTunnel only requires creating a single tunnel.
fr: La création d’une connexion client-serveur utilisant I2PTunnel exige seulement la création d’un seul tunnel.

source: Setting up connections for a peer-to-peer applications requires a very large amount of tunnels.
fr: Mettre en place des connexions pour une application pair à pair exige de très nombreux tunnels.

source: In summary, a number of reasons to write I2P-specific code:
fr: En résumé, un certain nombre de raisons d’écrire du code spécifique à I2P :

source: Creating a large amount of I2PTunnel instances consumes a non-trivial amount of resources, which is problematic for distributed applications (a new tunnel is required for each peer).
fr: Créer une grande quantité d’instances I2PTunnel consomme une quantité non-insignifiante de ressources, ce qui est problématique pour des applications distribuées (un nouveau tunnel est exigé pour chaque pair).

source: General network protocols often send a lot of additional data that can be used to identify users. Programming specifically for I2P allows the creation of a network protocol that does not leak such information, keeping users anonymous and secure.
fr: Des protocoles réseau généraux envoient souvent beaucoup de données supplémentaires qui peuvent être utilisées pour identifier des utilisateurs. Programmer spécifiquement pour I2P permet la création d’un protocole de réseau qui ne laisse pas fuiter de telles informations, gardant les utilisateurs anonymes et sécurisés.

source: Network protocols designed for use on the regular internet can be inefficient on I2P, which is a network with a much higher latency.
fr: Les protocoles réseau conçus pour être utilisés sur l’Internet ordinaire peuvent être inefficaces sur I2P qui est un réseau avec une latence beaucoup plus élevée.

source: I2P supports a standard <a href="%(plugins)s">plugins interface</a> for developers so that applications may be easily integrated and distributed.
fr: I2P prend en charge une <a href="%(plugins)s">interface de greffons</a> normale pour développeurs afin que les applications puissent facilement être intégrées et distribuées.

source: Applications written in Java and accessible/runnable using an HTML interface via the standard webapps/app.war may be considered for inclusion in the i2p distribution.
fr: Applications écrites en Java et accessibles ou exécutables par les applisWeb, app.war normaux en utilisant une interface HTML peuvent être considérées pour inclusion dans la distribution I2P.

source: There are a few changes that require adjusting to when using I2P:
fr: Il y a peu de changements qui exigent un réglage lors de l’utilisation d’I2P :

source: Destination ~= host+port
fr: Destination ~= hôte+port

source: An application running on I2P sends messages from and receives messages to a unique cryptographically secure end point - a "destination". In TCP or UDP terms, a destination could (largely) be considered the equivalent of a hostname plus port number pair, though there are a few differences.
fr: Une application fonctionnant sur I2P envoie des messages depuis et reçoit des messages vers un unique point final sécurisé cryptographiquement - "une destination". En termes TCP ou UDP, une destination pourrait (largement) être considérée l’équivalent d’un nom d’hôte plus le numéro de port du pair, quoiqu’il y ait quelques différences.

source: An I2P destination itself is a cryptographic construct - all data sent to one is encrypted as if there were universal deployment of IPsec with the (anonymized) location of the end point signed as if there were universal deployment of DNSSEC.
fr: Une destination I2P est un concept cryptographique. Toutes les données qui y sont envoyées sont chiffrés comme s’il y avait déploiement universel d’IPSEC avec l’emplacement (anonymisé) du point terminal signé comme s’il y avait déploiement universel de DNSSEC.

source: I2P destinations are mobile identifiers - they can be moved from one I2P router to another (or it can even "multihome" - operate on multiple routers at once). This is quite different from the TCP or UDP world where a single end point (port) must stay on a single host.
fr: Les destinations I2P sont des identifiants mobiles — elles peuvent être déplacées d’un routeur I2P à un autre (ou elles peuvent même multiconnectées à plusieurs multiples routeurs en même temps). Cela diffère plutôt du monde TCP ou UDP où une seule extrémité (port) doit rester sur un seul hôte.

source: I2P destinations are ugly and large - behind the scenes, they contain a 2048 bit ElGamal public key for encryption, a 1024 bit DSA public key for signing, and a variable size certificate, which may contain proof of work or blinded data.
fr: Les destinations I2P sont laides et longues — dans les coulisses, elles contiennent une clé publique 2048 bits ElGamal pour le chiffrement, une clé publique 1024 bits DSA pour la signature et un certificat à taille variable qui peuvent contenir une preuve de travail ou des données anonymes.

source: There are existing ways to refer to these large and ugly destinations by short and pretty names (e.g. "irc.duck.i2p"), but those techniques do not guarantee globally uniqueness (since they're stored locally in a database on each person's machine) and the current mechanism is not especially scalable nor secure (updates to the host list are managed using "subscriptions" to naming services). There may be some secure, human readable, scalable, and globally unique, naming system some day, but applications shouldn't depend upon it being in place, since there are those who don't think such a beast is possible. <a href="%(naming)s">Further information on the naming system</a> is available.
fr: Il existe des façons de faire référence à ces grandes et laides destinations par de courts et beaux noms (p. ex « irc.duck.i2p »), mais ces techniques ne garantissent pas l’unicité globale (puisqu’ils sont stockés localement dans une base de données sur la machine de chacun) et le mécanisme actuel n’est pas particulièrement extensible ni sécurisé (les mises à jour de la liste des hôtes sont gérées en utilisant des abonnements à des services de noms). Il pourrait un jour y avoir un système de noms sécurisé, interprétable par l’utilisateur, extensible et globalement unique, mais les applications ne devraient pas dépendre de sa mise en place, puisque certains pensent qu’un tel monstre est impossible. Il existe <a href="%(naming)s">de plus amples informations sur le système de noms</a>.

source: While most applications do not need to distinguish protocols and ports, I2P <em>does</em> support them. Complex applications may specify a protocol, from port, and to port, on a per-message basis, to multiplex traffic on a single destination. See the <a href="%(datagrams)s">datagram page</a> for details. Simple applications operate by listening for "all protocols" on "all ports" of a destination.
fr: Alors que la plupart des applications n’ont pas besoin de faire la distinction entre protocoles et ports, I2P <em>les prend en charge</em>. Des applications complexes peuvent indiquer un protocole, un port de, et un port vers, pour chaque message, afin de multiplexer le trafic sur une seule destination. Voir la <a href="%(datagrams)s">page des datagrammes</a> pour plus de précisions. Les applications simples fonctionnent en écoutant « tous les protocoles » sur « tous les ports » d’une destination.

source: Anonymity and confidentiality
fr: Anonymat et confidentialité

source: I2P has transparent end to end encryption and authentication for all data passed over the network - if Bob sends to Alice's destination, only Alice's destination can receive it, and if Bob is using the datagrams or streaming library, Alice knows for certain that Bob's destination is the one who sent the data.
fr: I2P possède un chiffrement bout à bout transparent et l’authentification de toutes les données passées sur le réseau - si Bob envoie à la destination Alice, seule la destination d’Alice peut recevoir, et si Bob utilise les datagrammes ou la bibliothèque streaming, Alice sait à coup sûr que la destination de Bob est celle qui a envoyé les données.

source: Of course, I2P transparently anonymizes the data sent between Alice and Bob, but it does nothing to anonymize the content of what they send. For instance, if Alice sends Bob a form with her full name, government IDs, and credit card numbers, there is nothing I2P can do. As such, protocols and applications should keep in mind what information they are trying to protect and what information they are willing to expose.
fr: Bien sûr, I2P rend anonyme d’une manière transparente les données envoyées entre Alice et Bob, mais il ne fait rien pour rendre anonyme le contenu de ce qu’ils envoient. Par exemple, si Alice envoie un formulaire à Bob avec son nom complet, carte d’identité gouvernementale, et numéro de carte de crédit, il n’y a rien que I2P puisse faire. En tant que tel, les protocoles et les applications devraient garder à l’esprit quelles sont les informations qu’ils essaient de protéger et quelles sont les informations qu’ils sont enclins à exposer.

source: I2P datagrams can be up to several KB
fr: Les datagrammes I2P peut avoir une taille jusqu’à plusieurs Ko

source: Applications that use I2P datagrams (either raw or repliable ones) can essentially be thought of in terms of UDP - the datagrams are unordered, best effort, and connectionless - but unlike UDP, applications don't need to worry about MTU detection and can simply fire off large datagrams. While the upper limit is nominally 32 KB, the message is fragmented for transport, thus dropping the reliability of the whole. Datagrams over about 10 KB are not currently recommended. See the <a href="%(datagrams)s">datagram page</a> for details. For many applications, 10 KB of data is sufficient for an entire request or response, allowing them to transparently operate in I2P as a UDP-like application without having to write fragmentation, resends, etc.
fr: Les applications qui utilisent des datagrammes I2P (soit bruts ou réflexibles) peuvent essentiellement être pensées en termes d’UDP - les datagrammes ne sont pas ordonnés, meilleur effort, et sans connexion - mais contrairement à UDP, les demandes ne doivent pas s’inquiéter de la détection MTU et peuvent décharger simplement de grands datagrammes. Tandis que la limite supérieure est nominalement 32 Ko, le message est fragmenté pour le transport, baissant ainsi la fiabilité de l’ensemble. On ne recommande pas actuellement les datagrammes de 10 Ko. Voyez la <a href="%(datagrams)s">page datagrammes</a> pour plus de précisions. Pour beaucoup d’applications, 10 Ko de données sont suffisantes pour une requête entière ou une réponse, leur permettant d’opérer d’une manière transparente dans I2P telle une application comme-UDP sans devoir écrire fragmentation, renvoi, etc.

source: There are several means of sending data over I2P, each with their own pros and cons. The streaming lib is the recommended interface, used by the majority of I2P applications.
fr: Il y a plusieurs moyens d’envoyer des données par I2P, chacune avec ses propres pour et contre. La bibliothèque streaming est l’interface recommandée, utilisée par la majorité des applications I2P.

source: Streaming Lib
fr: Lib streaming

source: The <a href="%(streaming)s">full streaming library</a> is now the standard interface. It allows programming using TCP-like sockets, as explained in the <a href="#start.streaming">Streaming development guide</a>.
fr: La <a href="%(streaming)s">bibliothèque full streaming</a> est maintenant l’interface standard. Elle permet de programmer en utilisant des sockets comme TCP, comme expliqué dans le <a href="#start.streaming">Guide de développement streaming</a>.

source: BOB is the <a href="%(bob)s">Basic Open Bridge</a>, allowing an application in any language to make streaming connections to and from I2P. At this point in time it lacks UDP support, but UDP support is planned in the near future. BOB also contains several tools, such as destination key generation, and verification that an address conforms to I2P specifications. Up to date info and applications that use BOB can be found at this <a href="http://%(boburl)s/">eepsite</a>.
fr: BOB est le <a href="%(bob)s">pont ouvert de base (Basic Open Bridge)</a>, qui permet à une application, dans n’importe quel langage, de faire des connexions de diffusion en continu vers et à partir d’I2P. Pour le moment, la prise en charge d’UDP lui manque, mais elle est prévue pour un avenir proche. BOB comprend aussi plusieurs outils, tels que la génération de clés de destination et la vérification de la conformité d’une adresse aux spécifications d’I2P. Des renseignements à jour et des applications qui utilisent BOB se trouvent sur ce <a href="http://%(boburl)s/">site eep</a>.

source: SAM is not recommended. SAM V2 is okay, SAM V3 is recommended.
fr: SAM n’est pas recommandé. Sam V2 est acceptable, SAM V3 est recommandée.

source: SAM is the <a href="%(sam)s">Simple Anonymous Messaging</a> protocol, allowing an application written in any language to talk to a SAM bridge through a plain TCP socket and have that bridge multiplex all of its I2P traffic, transparently coordinating the encryption/decryption and event based handling. SAM supports three styles of operation:
fr: SAM est le protocole de <a href="%(sam)s">messagerie simple et anonyme (Simple Anonymous Messaging)</a>, qui permet à une application écrite dans n’importe quel langage de parler à un pont SAM par un simple connecteur TCP, et de faire multiplexer tout son trafic I2P à ce pont, coordonnant ainsi de façon transparente le chiffrement, le déchiffrement et le traitement d’après les événements. SAM prend trois sortes d’opérations en charge :

source: streams, for when Alice and Bob want to send data to each other reliably and in order
fr: streams, pour quand Alice et Bob veulent envoyer des données l’un à l’autre de façon fiable et en ordre

source: repliable datagrams, for when Alice wants to send Bob a message that Bob can reply to
fr: datagrammes réflexibles, pour quand Alice veut envoyer un message à Bob auquel Bob puisse répondre

source: raw datagrams, for when Alice wants to squeeze the most bandwidth and performance as possible, and Bob doesn't care whether the data's sender is authenticated or not (e.g. the data transferred is self authenticating)
fr: datagrammes en brut, pour quand Alice veut serrer la plupart de la bande passante et performance autant que possible et que Bob ne se soucie pas si l’expéditeur des données est authentifié ou pas (par exemple si les données transférées sont elles-mêmes authentifiantes)

source: SAM V3 aims at the same goal as SAM and SAM V2, but does not require multiplexing/demultiplexing. Each I2P stream is handled by its own socket between the application and the SAM bridge. Besides, datagrams can be sent and received by the application through datagram communications with the SAM bridge.
fr: SAM V3 vise le même but que SAM et SAM V2, mais ne nécessite pas de multiplexage/démultiplexage. Chaque stream I2P est traité par son propre socket entre l’application et le pont SAM. En plus, les datagrammes peuvent être envoyés et reçus par l’application à travers les communications de datagramme avec le pont SAM.

source: <a href="%(samv2)s">SAM V2</a> is a new version used by imule that fixes some of the problems in <a href="%(sam)s">SAM</a>. <br /> <a href="%(samv3)s">SAM V3</a> is used by imule since version 1.4.0.
fr: <a href="%(samv2)s">SAM V2</a> est une nouvelle version utilisée par imule qui résoud certains des problèmes dans <a href="%(sam)s">SAM</a>. <br /> <a href="%(samv3)s">SAM V3</a> est utilisé par imule depuis sa version 1.4.0.

source: The I2PTunnel application allows applications to build specific TCP-like tunnels to peers by creating either I2PTunnel 'client' applications (which listen on a specific port and connect to a specific I2P destination whenever a socket to that port is opened) or I2PTunnel 'server' applications (which listen to a specific I2P destination and whenever it gets a new I2P connection it outproxies to a specific TCP host/port). These streams are 8-bit clean, and are authenticated and secured through the same streaming library that SAM uses, but there is a nontrivial overhead involved with creating multiple unique I2PTunnel instances, since each have their own unique I2P destination and their own set of tunnels, keys, etc.
fr: L’application I2PTunnel permet aux applications de construire des tunnels spécifiques, ressemblant à TCP, vers des pairs en créant soit des applications I2PTunnel « client » (qui écoutent sur un port particulier et se connectent à une destination I2P particulière quand un connecteur logiciel est ouvert vers ce port) ou des applications I2PTunnel « serveur » (qui écoutent une destination I2P particulière et, quand elles obtiennent une nouvelle connexion I2P, la relaient vers un hôte, port TCP précis). Ces flux sont compatibles 8 bits et sont authentifiés et sécurisés par la même bibliothèque de diffusion en continu que SAM utilise, mais la création de plusieurs instances d’I2PTunnel uniques impliquent une surcharge substantielle, puisque chacune a sa propre destination I2P et son propre jeu de tunnels, clés, etc.

source: I2P supports a SOCKS V4 and V5 proxy. Outbound connections work well. Inbound (server) and UDP functionality may be incomplete and untested.
fr: I2P prend en charge les mandataires SOCKS V4 et V5. Les connexions sortantes fonctionnent bien. Les fonctions entrantes (serveur) et UDP pourraient être incomplètes et non testées.

source: Removed
fr: Enlevé

source: There used to be a simple "ministreaming" library, but now ministreaming.jar contains only the interfaces for the full streaming library.
fr: Il y a eu une bibliothèque "ministreaming" simple, mais maintenant ministreaming.jar contient seulement les interfaces pour la bibliothèque ministreaming complète.

source: Datagrams
fr: Datagrammes

source: Recommended for UDP-like applications
fr: Recommandé pour les applications semblables-UDP

source: The <a href="%(datagrams)s">Datagram library</a> allows sending UDP-like packets. It's possible to use:
fr: The <a href="%(datagrams)s">Bibliothèque de datagramme</a> permet d’envoyer des paquets semblables-UDP-. Il est possible d’utiliser :

source: Repliable datagrams
fr: Datagrammes réflexibles

source: Raw datagrams
fr: Datagrammes bruts

source: Not recommended
fr: Non recommandé

source: <a href="%(i2cp)s">I2CP</a> itself is a language independent protocol, but to implement an I2CP library in something other than Java there is a significant amount of code to be written (encryption routines, object marshalling, asynchronous message handling, etc). While someone could write an I2CP library in C or something else, it would most likely be more useful to use the C SAM library instead.
fr: <a href="%(i2cp)s">I2CP</a> lui-même est un protocole indépendant du language, mais mettre en œuvre une bibliothèque I2CP dans quelque chose d’autre que Java nécessite une quantité significative de code à écrire (des routines de chiffrement, rassemblement d’objet, traitement de message asynchrone, etc). Tandis que quelqu’un pourrait écrire une bibliothèque I2CP en C ou en quelque chose d’autre, au lieu de cela il serait très probablement plus utile d’utiliser la bibliothèque C de SAM.

source: Web Applications
fr: Applications Web
