Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: fr

source: To improve I2P's usage and to be independent of routers online status we want a datastorage as a extension to I2P. Like in Freenet the datastorage should be distributed and every participating node should be able to configure his options. The files should be saved in chunks and at least 2-3 times to obtain redundancy. Usage of storage space should be auto balanced. As it is a extra application, it should work flawless within I2P and cooperate nice with the I2P router. Maybe a integration within the webpage/router could be done.
fr: Pour améliorer l’utilisation d’I2P et être indépendants de l’état de connexions des routeurs, nous voulons un stockage de données comme extension d’I2P. Comme dans Freenet, le stockage de données devrait être distribué et chaque nœud participant devrait pouvoir configurer ses options. Les fichiers devraient être enregistrés en morceaux et au moins 2 à 3 fois pour obtenir une redondance. L’utilisation de l’espace de stockage devrait être équilibrée automatiquement. En tant qu’application supplémentaire, elle devrait fonctionner parfaitement dans I2P et bien coopérer avec le routeur I2P. Une intégration dans la page Web ou le routeur pourrait être effectuée.

source: This bounty cooperates with the 2 other bounties "frost for I2P" and "eepsites in datastorage".
fr: Cette prime coopère avec les 2 autres primes "frost pour I2P" et "sites eep dans datastorage".

source: The frost for I2P datastorage bounty is paid for a frost like program with which files/messages are stored into database and got from database. It needs to work with a GUI.
fr: La prime frost pour datastorage I2P est payée pour un logiciel comme frost avec lequel les fichiers/messages sont stockés dans une base de données et obtenus depuis la base de données. Il doit marcher avec un GUI.

source: The eepsite served out of I2P datastorage extends a I2P router to send out eepsites out of the I2P datastorage. All files for eepsites need to be saved inside of datastorage and are taken from it. Extension: For better integration all datastorage participants could serve that eepsite.
fr: Le site eep servi à partir du magasin de données d’I2P épaule un routeur I2P pour envoyer des sites eep à partir du magasin de données d’I2P. Tous les fichiers des sites eep doivent être enregistrés dans un magasin de données et y sont récupérés. Extension : Pour une meilleure intégration, tous les participants au magasin de données pourraient servir ce site eep.

source: For bounties to be declared done and paid, we need the program AND the source. Source and code need to be licensed under a free license (free to change and free to distribute).
fr: Pour que les primes soient déclarées faites et soient payées, nous avons besoin du programme ET du source. Le source et le code doivent être accordés sous une licence libre (libre à modifier et gratuit à distribuer).

source: Bounty I2P package in Debian and Ubuntu mirrors
fr: Prime paquet I2P dans les miroirs Debian et Ubuntu

source: I2P Ubuntu/Debian package
fr: Paquet I2P pour Ubuntu/Debian

source: For the future of I2P and in order to attract more people to I2P, this bounty was set for including an I2P package into the Ubuntu and Debian archive mirrors. To claim this bounty, the I2P router package needs to be available from Ubuntu and Debian archive mirrors and Debian bug <a href="http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=448638">448638</a> needs to be closed successfully. Done in 2017 by mhatta.
fr: Pour l’avenir d’I2P et afin d’attirer plus d’utilisateurs vers I2P, cette prime a été mise en place pour inclure un paquet I2P dans les miroirs d’archives d’Ubuntu et de Debian. Pour réclamer cette prime, le paquet de routeur I2P doit être proposé sur les miroirs d’archives d’Ubuntu et de Debian, et le bogue Debian <a href="http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=448638">448638</a> doit être fermé avec succès. Effectué en 2017 par mhatta.

source: Bounty I2PHex code implementation
fr: Prime pour mise en œuvre du code d’I2PHex

source: i2phex code implementation
fr: Mise en œuvre du code d’I2Phex

source: To improve I2P usage and attract more people into I2PHex P2P ArneBab setout the bounty for implementing actual Phex code onto I2PHex.
fr: Pour augmenter l’utilisation d’I2P et afin d’attirer plus d’utilisateurs vers I2PHex P2P, ArneBab a établi une prime pour mettre en œuvre le code Phex dans I2PHex.

source: Bounties for I2P
fr: Primes pour I2P

source: While we always gratefully accept any contributions of code, documentation, and the like, there are other ways to help I2P move forward. As with any open source project, our goals would be achieved more rapidly if we were able to support all of our contributors to work on I2P full time. However, as with any open source project, that's not a possibility. Instead, we are making use of a bounty system, whereby anyone can get support for working on something that people want implemented, and people who want to contribute to I2P can be assured that their support goes to what they care about.
fr: Tandis que nous acceptons toujours avec reconnaissance toutes contributions de code, documentation, et ainsi de suite, il y a d’autres façons d’aider à ce que I2P avance. Comme avec n’importe quel projet open source, nos buts seraient réalisés plus rapidement si nous pouvions soutenir tous nos collaborateurs afin qu’ils travaillent sur I2P à plein temps. Cependant, comme avec n’importe quel projet open source, ce n’est pas une possibilité. Au lieu de cela, nous nous servons d’un système de prime, par lequel chacun peut obtenir du soutien pour travailler sur quelque chose que des gens veulent qu’il soit implémenté, ainsi les gens qui veulent contribuer à I2P peuvent être assurés que leur soutien va à ce dont ils se soucient.

source: We are also keeping open the ability for people who want to support I2P but don't have strong feelings about the bounties available. Those people can simply put their trust in the I2P team to do what we feel is best by donating to a catch-all general fund that will be used as deemed necessary - allocated to various bounties, covering incidentals (hosting, etc), and the like.
fr: Nous gardons aussi ouverte la capacité pour les gens qui veulent soutenir I2P mais qui n’ont pas de sentiments fort concernant les primes disponibles. Ces gens peuvent simplement faire confiance à l’équipe d’I2P pour faire ce que nous sentons être le mieux par donation à un fonds général fourre-tout qui sera utilisé à ce qui est considéré nécessaire - répartir à diverses primes, couvrir des faux frais (hébergement, etc), et d’autres de ce genre.

source: Name
fr: Nom

source: Status
fr: État

source: Claimed bounties
fr: Primes réclamées

source: Dev team
fr: Équipe dév

source: I2P package in Debian and Ubuntu mirrors
fr: Paquet I2P dans les miroirs Debian et Ubuntu

source: Make I2P IPv6 native
fr: Rendre I2P natif IPv6

source: Setting up a SILC server
fr: Mettre en œuvre un serveur SILC

source: Datastore over I2P
fr: Système de fichiers distribués sur I2P

source: Russian translation
fr: Traduction en Russe

source: Swarming file transfer
fr: Transfert de fichier segmenté

source: Streaming library window size
fr: Taille de fenêtre de la bibliothèque streaming

source: IRC connect time monitor
fr: Moniteur de temps de connexion IRC

source: Unit tests (part 1)
fr: Tests unitaires (partie 1)

source: Dev lists anyone who may already be working on the bounty - collaboration is preferred, so if you're interested in working on it, please contact one of the people listed!
fr: Dev liste quiconque qui pourrait déjà travailler sur cette prime - la collaboration est préférée, donc si vous êtes intéressés par travailler dessus, veuillez prendre contact avec une des personnes listées !

source: Bounty I2P IPv6 native
fr: Prime I2P IPv6 natif

source: native IPv6 I2P
fr: I2P IPv6 natif

source: For a future of I2P and attract more people into I2P I withdrawal the vuze bounty and offer a IPv6 bounty. To claim this bounty, the I2P router needs to run full on native IPv6 connections like it does on IPv4.
fr: Pour l’avenir d’I2P et afin d’attirer plus d’utilisateurs vers I2P, je retire la prime vuze et offre une prime IPv6. Pour réclamer cette prime, le routeur I2P doit fonctionner complètement sur des connexions IPv6 natives, comme c’est le cas sur IPv4.

source: For bounties to be declared done and paid, we need the plugin AND the source. Source and code need to be licensed under a free license (free to change and free to distribute).
fr: Pour que les primes soient déclarées faites et payées, il nous faudra le greffon ET la source. La source et le code doivent être sous une licence libre (liberté de modification et distribution).

source: NetDB Backend
fr: Dorsale de la BDréseau

source: netDB backend
fr: Dorsale de la BDréseau

source: The current NetDB implementation (namely the FloodFill system) needs to be extended with another backend to improve reliability, reduce attack surface and solve the scalability issue for the coming years.
fr: La mise en oeuvre actuelle de BDréseau (à savoir le système de remplissage par diffusion) doit être augmentée d’une autre dorsale pour améliorer la fiabilité, réduire la surface d’attaque et résoudre la question d’extensibilité pour les années à venir.

source: A solution likely based on a DHT will be investigated and finally implemented.
fr: Une solution probablement basée sur un DHT sera examinée et finalement mise en œuvre.

source: Bounty russian translation of webpage and router console
fr: Prime traduction en russe de la page web et de la console de routeur

source: To improve I2P usage and attract more people into I2P a anonymous donator set out the bounty for translation of the I2P web page and I2P router console into russian language.
fr: Pour augmenter l’utilisation d’I2P et afin d’attirer plus d’utilisateurs vers I2P, un donateur anonyme a établi une prime pour la traduction de la page Web d’I2P et de la console routeur I2P en russe.

source: For collecting the bounty of $115 USD you need to translate the following pages:
fr: Pour obtenir la prime de 115 $ USD vous devez traduire les pages suivantes :

source: Part 2 is the translation of the router console. The whole router console needs to be translated to collect the bounty of $115 USD.
fr: La partie 2 est la traduction de la console de routeur. Le console de routeur a besoin d’être traduite en entier pour obtenir la prime de 115 $ USD.

source: Judge is the russian donor.
fr: Le juge est le donateur russe.

source: Bounty migrate I2P IRC to SILC
fr: Prime migration de IRC d’I2P vers SILC

source: I2P silc server
fr: Serveur silc I2P

source: For a future of I2P and attract more people into I2P this bounty is to setup and host a I2P SILC server. This will allow people to send files over their messaging servers and have intrinsic security built into the protocol.
fr: Pour l’avenir d’I2P et afin d’attirer plus d’utilisateurs vers I2P, cette prime est pour la mise en place et l’hébergement d’un serveur I2P SILC. Cela permettra aux utilisateurs d’envoyer des fichiers par leurs serveurs de messagerie et une sécurité intrinsèque sera construite dans le protocole.

source: A silc server needs to be set up and run for at least 3 month time to get payed. A second server should be set up, too.
fr: Un serveur silc doit être mis en place et fonctionner durant au moins 3 mois pour obtenir le paiement. Un deuxième serveur devrait être mis en place, aussi.

source: Bounty was withdrawn and money donated to returningnovice and general fund.
fr: La prime a été retirée et l’argent donné à returningnovice et au fond général.

source: Judge is An Anonymous Secret Society, society@mail.i2p.
fr: Le juge est une société secrète anonyme, society@mail.i2p.

source: Syndie development
fr: Développement Syndie

source: Beside of I2P we want to encourage users to care more about anonymity and security. As I2P is a low latency network with its natural limits, the software SYNDIE can overcome some of these limits and provide better anonymity for people who really need it.
fr: À côté d’I2P nous voulons encourager les utilisateurs à se soucier davantage d’anonymat et de sécurité. Comme I2P est un réseau à basse latence avec ses limites naturelles, le logiciel SYNDIE peut surmonter certaines de ces limites et fournir un meilleur anonymat pour les gens qui en ont vraiment besoin.

source: For our bad sake the syndie project was out of development for quite a long time yet (5 years) and has been updated just with small fixes to keep it running. To get a fresh and new built with needed bugfixes we set out this bounty. Also syndie needs some enhancements and a better GUI for users to work with it. Current bounty sum is 3 Bitcoin.
fr: Malheureusement pour nous, le projet Syndie n’était pas développé pendant longtemps (5 ans) et n’a été mis à jour qu’avec de petits correctifs pour en assurer le fonctionnement. Pour obtenir une version actuelle et nouvelle avec les correctifs de bogues requis, nous avons lancé cette prime. Syndie a aussi besoin de quelques améliorations et d’une meilleure IUG pour les utilisateurs. La prime actuelle est de 3 bitcoins.

source: The latest Syndie coding rally did improve the situation of the Syndie package dramatically. A new Syndie package with bugfixes was created and made available on different webpages. As a result of this work, the bounty sum was reduced and the withdrawn money moved to the IPv6 bounty.
fr: Le plus récent rallye de programmation sur Syndie a considérablement amélioré la situation du paquet Syndie. Un nouveau paquet Syndie avec des correctifs de bogues été créé et rendu disponible sur différentes pages Web. À la suite de ce travail, la somme de la prime a été réduite et l’argent déplacé vers la prime IPv6.

source: Bounty unittests
fr: Prime tests unitaires

source: unit test
fr: test unitaire

source: To improve I2P's maintainability, we want to have a solid set of automated unit tests for the critical code. While we do have some unit tests at the moment, they are ad-hoc and partly unfinished. This bounty is for someone to check the existing tests and move over old ones to jUnit, automate their execution, extend them to provide better code coverage, and publish the report online. Its a massive effort, but can be broken down into phases, listed below (phase 2 must occur first, but further phases may happen in any order). As this needs some reading of code, it is the best start point for new devs to get a good overview of I2P code and coding. A good job for college students, interns or anyone who is just interested.
fr: Pour améliorer la maintenance d’I2P, nous voulons avoir pour le code critique un ensemble solide de test unitaires automatisés. Bien que nous avons certains tests unitaires à l’heure actuelle, ils sont ad-hoc et en partie inachevés. Cette prime est pour quelqu’un pour vérifiera les tests existants et les bougera par dessus les ancien vers jUnit, automatisez leur exécution, étendez-les pour mieux fournir la couverture du code, et publier le relevé en ligne. C’est un effort massif, mais il est possible de le décomposer en phases, listées ci-dessous (la phase 2 doit arriver d’abord, mais de nouvelles phases peuvent arriver dans n’importe quel ordre). Comme cela nécessite un peu de lecture de code, c’est le meilleur point de départ pour de nouveaux dévs pour obtenir une bonne vue d’ensemble du code d’I2P et programmer. Un bon travail pour des étudiants universitaires, internes ou quiconque qui est juste intéressé.

source: Take care! Jobs and bounties shuffled a bit! Phase 6,7 and 8 are still open!
fr: Attention ! Travaux et primes sont un peu mélangés ! Les phases 6, 7 et 8 sont toujours ouvertes !

source: CI jenkins and IRC bot
fr: CI jenkins et bot IRC

source: Bounty: %(euro)s &euro;
fr: Prime : %(euro)s &euro;

source: server runs and this section is blocked
fr: le serveur fonctionne et cette section est bloquée

source: To collect this bounty, a continuous integration server (Jenkins, old name was Hudson) must be set up and a connected IRC bot needs to set up in the channel #i2p-dev on IRC2p network to print out results of build tests.<br> The server needs to be run long term.
fr: Pour avoir cette prime, un serveur d’intégration continu (Jenkins, précédemment nommé Hudson) doit être configuré et un robot IRC connecté doit être configuré dans le canal #i2p-dev sur le réseau IRC2P pour afficher les résultats des builds test. Le serveur doit être exécuté durant un long terme.

source: Check existing SDK tests
fr: Vérifier les tests SDK existants

source: paid to str4d
fr: payé à str4d

source: To collect this bounty, the existing SDK tests must be checked and made to work again. The need to be integrated into the ant build scripts ("ant test"), and tied in with a code coverage tool (e.g. <a href="%(clover)s">Clover</a>). The ant script must be capable of generating test status results as a web page, which will be published online.
fr: Pour obtenir cette prime, les tests de SDK existants doivent être vérifiés et rendus fonctionnels à nouveau. Ils doivent être intégrés dans les scripts de construction ant (« ant test ») et reliés avec un outil de couverture de code (p. ex.<a href="%(clover)s">Clover</a>). Le script ant doit pouvoir générer des résultats d’état de test en tant que page Web, qui sera publiée en ligne.

source: SDK test coverage
fr: Couverture de test du SDK

source: paid to unittests dev team
fr: payé à l’équipe de dév des tests unitaires

source: To collect this bounty, the automated unit tests of the SDK (i2p/core/java/src) must work again.
fr: Pour avoir cette prime, les tests unitaires automatisés du SDK (i2p/core/java/src) doivent fonctionner de nouveau.

source: Router test migration
fr: Migration du routeur test

source: As with phase 2, the existing unit tests for the router must be moved over to the automated system.
fr: Comme avec la phase 2, les tests unitaires existants concernant le routeur doivent être déplacés vers le système automatisé.

source: Router test coverage
fr: Couverture du routeur test

source: To collect this bounty, the automated unit tests of the router (i2p/router/java/src) must work again.
fr: Pour avoir cette prime, les tests unitaires automatisés du routeur (i2p/router/java/src) doivent fonctionner de nouveau.

source: Streaming lib tests
fr: Tests lib streaming

source: To collect this bounty, a new set of unit tests must meet a measured code coverage of 90&#37; of the streaming lib (i2p/apps/ministreaming/ and i2p/apps/streaming/).
fr: Pour avoir cette prime, un nouvel ensemble de tests unitaires doit respecter une couverture de code mesurée de 90&#37; de la streaming lib (i2p/apps/ministreaming/ et i2p/apps/streaming/).

source: Unit tests coverage
fr: Couverture tests unitaires

source: To collect this bounty, all above unit tests must meet the 100&#37; coverage marker (except for log statements).
fr: Pour percevoir cette prime, toutes les tests unitaires ci-dessus doivent répondre à 100 &#37; au marqueur de couverture (à l’exception des déclarations de journalisation).

source: MultiRouter simulation
fr: Simulation multi-routeur

source: will be split in more sub-tasks
fr: sera divisé en plusieurs sous-tâches

source: To collect this bounty, the existing in-memory multi-router simulation must be checked, made work again and extend to simulate lots of routers in memory on a single machine. This bounty will be split in more fine grained subworks.
fr: Pour avoir cette prime, la simulation multi-routeur en-mémoire existante doit être vérifiée, être capable de fonctionner de nouveau et étendue pour simuler beaucoup de routeurs en mémoire sur une seule machine. Cette prime sera divisée en de plus fins sous-travaux à granularité.

source: Judge on all these works is the donor and donor decides if a phase is called succesfull done and money can be paid.
fr: Le juge sur tous ces travaux est le donateur et le donateur décide si une phase peut être appelée faite avec succès et si l’argent peut être payé.

source: Bounty I2P vuze plugin
fr: Prime greffon vuze d’I2P

source: vuze plugin
fr: greffon vuze

source: To improve I2P usage and attract more people into I2P torrent P2P I setout the bounty for a working I2P vuze plugin. The plugin needs to be official and submitted to vuze for publication on their webpage/repository for plugins. It should be easy to install and configured, work smooth and flawless. Configuration should be friendly to starters and made easy to be anonymous. It should work with *.b32.i2p destinations as with signed (516++ bits) destinations.
fr: Pour augmenter l’utilisation d’I2P et afin d’attirer plus d’utilisateurs vers I2P torrent P2P, j’établis une prime pour un greffon vuze I2P fonctionnel. Le greffon doit être officiel et envoyé à vuze pour être publié sur leur page Web et leur dépôt de greffons. Il devrait être facile à installer et à configurer, fonctionner de manière fluide et sans faille. La configuration devrait être conviviale pour les débutants et facilement anonyme. Il devrait fonctionner avec des destinations *.b32.i2p comme avec les destinations signées (516++ bits).

source: Application Development
fr: Développement d’application

source: May 2013
fr: Mai 2013

source: Why write I2P-specific code?
fr: Pourquoi écrire du code spécifique à I2P ?

source: Important concepts
fr: Concepts importants

source: Development options
fr: Options de développement

source: Start developing - a simple guide
fr: Commencer à développer — un guide simple

source: There are multiple ways to use applications in I2P. Using <a href="%(i2ptunnel)s">I2PTunnel</a>, you can use regular applications without needing to program explicit I2P support. This is very effective for client-server scenario's, where you need to connect to a single website. You can simply create a tunnel using I2PTunnel to connect to that website, as shown in <a href="#tunnel.serverclient">Figure 1</a>.
fr: Il y a de multiples façons d’utiliser des applications dans I2P. En utilisant <a href="%(i2ptunnel)s">I2PTunnel</a>, vous pouvez utiliser des applications classiques sans avoir besoin de programmer un support explicite à I2P. Ceci est très efficace pour un scénario client-serveur, où vous avez besoin de vous connecter à un simple site web. Vous pouvez simplement créer un tunnel utilisant I2PTunnel pour connecter à ce site Web, comme indiqué dans <a href="#tunnel.serverclient">Figure 1</a>.
