Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: fr

source: Trust and initializing your repository
fr: Confiance et initialisation de votre dépôt

source: Obtaining and deploying developers' keys
fr: Obtention et déploiement de clés de développeurs

source: Setting up trust evaluation hooks
fr: Mettre en place des crochets d’évaluation de confiance

source: Pulling the <code>i2p.i2p</code>, <code>i2p.www</code> and <code>i2p.syndie</code> branches
fr: Tirer les branches <code>i2p.i2p</code>, <code>i2p.www</code> et <code>i2p.syndie</code>

source: Verifying that trust evaluation works
fr: Vérifier que l’évaluation de confiance fonctionne

source: Checking out a working copy of the latest version
fr: Obtenir une copie fonctionnelle de la dernière version

source: Updating your working copy to the latest version
fr: Mise à jour de votre copie de travail vers la dernière version

source: Operating a Monotone Server
fr: Opérer un serveur Monotone

source: Obtaining and deploying developers’ transport keys
fr: Obtention et déploiement des clés de transport des développeurs

source: Granting push and pull access
fr: Octroi des accès en poussée et traction

source: Running Monotone in server mode
fr: Exécuter Monotone en mode serveur

source: Differences under Debian GNU/Linux
fr: Différences sous Debian GNU/Linux

source: This is a revised version of <a href="%(transitionguide)s">Complication's original guide</a> detailing the use of Monotone in I2P development. For basic instructions see the <a href="%(newdevs)s">quick-start guide</a>.
fr: Ceci est une version révisée du <a href="%(transitionguide)s">Guide original de Complication </a> détaillant l’usage de Monotone dans le développement I2P. Pour des instructions basiques voyez le <a href="%(newdevs)s">guide de démarrage rapide</a>.

source: I2P has a distributed development model. The source code is replicated across independently administered <a href="http://www.monotone.ca/">Monotone</a> ("MTN") repositories. Developers with commit rights are able to push their changes to the repository (a <a href="%(licenses)s#commit">license agreement</a> needs to be signed before commit rights are granted).
fr: I2P a un modèle de développement distribué. Le code source est répliqué à travers des dépôts <a href="http://www.monotone.ca/">Monotone</a> ("MTN") administrés indépendamment. Les développeurs ayant des droits d’engagement peuvent pousser leurs changements vers le dépôt (un <a href="%(licenses)s#commit">contrat de licence</a> nécessite d’être signé avant que les droits d’engagement soient attribués).

source: Some of Monotone's noteworthy qualities are: distributed version control, cryptographic authentication, access control, its small size, having few dependencies, storage of projects in a compressed SQLite database file, and having the ability to resume interrupted synchronization attempts.
fr: Certaines des remarquables qualités de Monotone sont : contrôle de version distribué, authentification cryptographique, contrôle d’accès, petite taille, avoir peu de dépendances, stockage de projets dans un fichier de base de données SQLite compressé, et avoir la capacité de reprendre des tentatives de synchronisation interrompues.

source: Operating a Monotone Client
fr: Utiliser un client Monotone

source: A transport key grants you the ability to push your changes to a Monotone repository server. In order to commit code into Monotone (in essence signing your code), a commit key is also needed. None of the public Monotone servers on I2P currently require a key in order to read (or pull) the source code.
fr: Une clé de transport vous accorde la capacité de pousser vos changements vers un serveur de dépôt Monotone. Afin d’engager du code dans Monotone (qui par essence signe votre code), une clé d’engagement est aussi nécessaire. Aucun des serveurs publics Monotone dans I2P n’exigent actuellement de clé pour lire (ou tirer) du code source.

source: Without a transport key, one cannot: <ul> <li>pull code from a server which doesn't allow global read access</li> <li>push code to any server</li> <li>run a Monotone server</li> </ul>
fr: Sans clé de transport, on ne peut pas : <ul> <li>tirer du code depuis un serveur qui ne permet pas l’accès global en lecture</li> <li>pousser du code vers un serveur</li> <li>exécuter un serveur Monotone</li> </ul>

source: Without a commit key, one cannot: <ul> <li>commit any code</li> </ul>
fr: Sans une clé d’engagement, on ne peut pas : <ul> <li>engager du code</li> </ul>

source: If you only intend to retrieve code from MTN, feel free to skip to the <a href="#trust-and-initializing-your-repository">next section</a>. If you want to generate keys, read the following.
fr: Si vous avez seulement l’intention de récupérer le code depuis MTN, n’hésitez pas à sauter jusqu’à la <a href="#trust-and-initializing-your-repository">section suivante</a>. Si vous voulez générer des clés, lisez la suite.

source: By convention keys are named like an e-mail addresses, but a corresponding e-mail address does not need to exist. For example, your keys might be named:
fr: Par convention, les clés sont nommées comme des adresses courriel, mais il n’est pas requis qu’une adresse courriel correspondante existe. Par exemple, vos clés pourraient être nommées :

source: Monotone stores keys under <code><b>$HOME/.monotone/keys</b></code> in text files which are named identically to the keys. For example:
fr: Monotone stocke les clés sous <code><b>$HOME/.monotone/keys</b></code> dans des fichiers textes qui sont nommés identiquement aux clés. Par example :

source: To generate transport and commit keys, enter the following commands at a prompt:
fr: Pour générer des clés de transport et d’engagement, saisissez les commandes suivantes dans une ligne de commande :

source: Monotone will prompt you for a password to protect your keys. You are very strongly encouraged to set a password for the commit key. Many users will leave an empty password for the transport key, especially those running a Monotone server.
fr: Monotone vous demandera un mot de passe pour protéger vos clés. Vous êtes très fortement encouragés à mettre un mot de passe pour la clé d’engagement. Beaucoup d’utilisateurs laisseront un mot de passe vide pour la clé de transport, particulièrement ceux exécutant un serveur Monotone.

source: Trust, and initializing your repository
fr: Confiance, et initialiser votre dépôt

source: Monotone's security model helps to ensure that nobody can easily impersonate a developer without it being noticed. Since developers can make mistakes and become compromised,only manual review can ensure quality of code. Monotone's trust model will ensure that you read the right diffs. It does not replace reading diffs.
fr: Le modèle de sécurité de Monotone aide à assurer que personne ne puisse facilement interpréter le rôle d’un développeur sans être remarqué. Puisque les développeurs peuvent faire des erreurs et devenir compromis, seul l’examen manuel peut assurer la qualité du code. Le modèle de confiance de Monotone assure que vous lisez les bonnes diffs. Il ne remplace pas la lecture des diffs.

source: A Monotone repository is a single file (a compressed SQLite database) which contains all of the project's source code and history.
fr: Un dépôt Monotone est un simple fichier (une base de données SQLite compressée) qui contient le code source de tout le projet et l’historique.

source: After <a href="#obtaining-and-deploying-developers-keys">importing the developers' keys into Monotone</a> and <a href="#setting-up-trust-evaluation-hooks">setting up trust evaluation hooks</a>, Monotone will prevent untrusted code from being checked out into your workspace. There are commands available to clean untrusted code from your workspace but in practice they've not been needed due to the push access policies in place.
fr: Après <a href="#obtaining-and-deploying-developers-keys">importation des clés des développeurs dans Monotone</a> et <a href="#setting-up-trust-evaluation-hooks">mise en place des crochets d’évaluation de confiance</a>, Monotone empêchera le code non fiable d’être approuvé dans votre espace de travail. Il existe des commandes pour nettoyer le code non fiable de votre espace de travail, mais dans la pratique elles n’ont pas été nécessaires, en raison des politiques d’accès en poussée mises en œuvre.

source: A repository can hold many branches. For example, our repository holds the following main branches:
fr: Un dépôt peut retenir beaucoup de branches. Par exemple, notre dépôt retient les branches principales suivantes :

source: The I2P router and associated programs
fr: Le routeur I2P et les programmes associés

source: The I2P project website
fr: Le site Web de projet d’I2P

source: Syndie, a distributed forums tool
fr: Syndie, un outil de forums distribués

source: By convention, the I2P Monotone repository is named <code>i2p.mtn</code>. Before pulling source code from servers, a database for your repository will need to be initialized. To initialize your local repository, change into the directory that you want the <code>i2p.mtn</code> file and branch directories to be stored and issue the following command:
fr: Par convention, le dépôt Monotone de I2P est nommé <code>i2p.mtn</code>. Avant de tirer le code depuis les serveurs, une base de données pour votre dépôt devra être initialisée. Pour initialiser votre dépôt local, allez dans le répertoire dans lequel vous voulez que le fichier <code>i2p.mtn</code> et les répertoires de branche soient stockés (ex: $HOME/.monotone/) et tapez la commande suivante :

source: Keys which developers use to commit code are essential for trust evaluation in Monotone. The other developers' transport keys are only required for Monotone server operators.
fr: Les clés que les développeurs utilisent pour engager du code sont essentielles pour l’évaluation de confiance dans Monotone. Les clés de transport des autres développeurs sont seulement exigées pour les opérateurs de serveurs Monotone.

source: Developers' commit keys are provided GPG-signed <a href="%(signedkeys)s">on another page</a>.
fr: Les clés d’engagement des développeurs sont fournies signées en GPG <a href="%(signedkeys)s">sur une autre page</a>.

source: To import developers' keys after verifying their authenticity, copy <a href="%(devkeys)s">all of the keys</a> into a new file. Create this file (e.g. <code><b>keys.txt</b></code>) in the same directory where <code>i2p.mtn</code> is located. Import the keys with the command:
fr: Pour importer les clés de développeurs après avoir vérifié leur authenticité, copiez <a href="%(devkeys)s">toutes les clés</a> dans un nouveau fichier. Créez ce fichier (ex: <code><b>keys.txt</b></code>) dans le même répertoire dans lequel <code>i2p.mtn</code> est localisé. Importez les clés avec la commande :

source: <b>Note</b>: <i>Never</i> add keys to <code><b>$HOME/.monotone/keys</b></code> manually.
fr: <b>Note</b>: <i>ne jamais</i> ajouter de clés à <code><b>$HOME/.monotone/keys</b></code> manuellement.

source: The default Monotone trust policy is way too lax for our requirements: every committer is trusted by default. That is not acceptable for I2P development.
fr: La politique de confiance de Monotone par défaut est beaucoup trop faible pour nos exigences : chaque contributeur est digne de confiance par défaut. Ceci n’est pas acceptable pour le développement de I2P.

source: Change into the directory <code><b>$HOME/.monotone</b></code> and open the file <code>monotonerc</code> with a text editor. Copy and paste the following two functions into this file:
fr: Allez dans le répertoire <code><b>$HOME/.monotone</b></code> puis ouvrez le fichier <code>monotonerc</code> avec un éditeur de texte. Copiez et collez les deux fonctions suivantes dans ce fichier :

source: The first function determines an intersection between two sets, in our case a revision's signers and trusted signers.
fr: La première fonction détermine une intersection entre deux ensembles, dans notre cas un signataire de révision et un signataire éprouvés.

source: The second function determines trust in a given revision, by calling the first function with "signers" and "trusted" as arguments. If the intersection is null, the revision is not trusted. If the intersection is not empty, the revision is trusted. Otherwise, the revision is not trusted.
fr: La deuxième fonction détermine la confiance en une révision donnée, en appelant le première fonction avec "signataires" et "éprouvé" comme arguments. Si l’intersection est vide, la révision est non digne de confiance. Si l’intersection n’est pas vide, la révision est digne de confiance. Autrement, la révision est non digne de confiance.

source: More information about Trust Evaluation Hooks can be found in the <a href="http://www.monotone.ca/docs/Hooks.html">official Monotone documentation</a>.
fr: Plus d’informations sur les crochets d’évaluation de confiance se trouvent dans la <a href="http://www.monotone.ca/docs/Hooks.html">documentation officielle de Monotone</a>.

source: I2P is shipped with a pre-configured tunnel pointing to the project Monotone server. Ensure that the tunnel has been started within <a href="http://127.0.0.1:7657/i2ptunnel">I2PTunnel</a> before attempting to pull the source code from 127.0.0.1:8998.
fr: I2P est livré avec un tunnel pré-configuré pointant vers le serveur Monotone du projet. Assurez que ce tunnel a été démarré dans <a href="http://127.0.0.1:7657/i2ptunnel">I2PTunnel</a> avant de tenter de tirer le code source depuis 127.0.0.1:8998.

source: Enter the directory where you initialized <code>i2p.mtn</code>. Depending on whether you want only I2P sources, or also sources for the I2P website and Syndie, you can perform the <code>pull</code> operation in different ways.
fr: Saisissez dans le répertoire dans lequel vous avez initialisé le code <code>i2p.mtn</code>. Selon que vous voulez seulement les sources d’I2P, ou aussi les sources du site Web I2P et de Syndie, vous pouvez accomplir l’opération <code>pull</code> de différentes façons.

source: If you only want I2P sources:
fr: Si vous voulez seulement des sources d’I2P :

source: If you want all branches:
fr: Si vous voulez toutes les branches :

source: If the transfer aborts before completing sucessfully, simply repeating the pull command will resume the transfer.
fr: Si le transfert s’arrête avant l’achèvement complet, répétez simplement la commande de traction ce qui reprendra le transfert.

source: Pulling in the above examples is done anonymously by specifying an empty transport key. If everyone pulls anonymously it will be harder for an attacker who gains control of the server to selectively provide some people with tampered data.
fr: Le tirage lors des exemples susdits est fait anonymement en spécifiant une clé de transport vide. Si tout le monde tire anonymement ce sera plus dur pour un attaquant qui prendrait le contrôle du serveur de fournir sélectivement à quelques personnes des données trifouillées.

source: To verify that trust evaluation works:
fr: Pour vérifier que l’évaluation de confiance fonctionne :

source: Make a backup of your <code>monotonerc</code> file.
fr: Faites une sauvegarde de votre fichier <code>monotonerc</code>.

source: Modify <code><b>monotonerc</b></code> by setting the trusted_signers variable in the following way:
fr: Modifiez <code><b>monotonerc</b></code> en modifiant la variable trusted_signers de façon suivante :

source: With <code><b>monotonerc</b></code> configured as above, Monotone will no longer trust any committers. Confirm this by changing into the directory where <code>i2p.mtn</code> was created and attempt a checkout of the I2P branch:
fr: Avec <code><b>monotonerc</b></code> configuré comme ci-dessus, Monotone n’aura plus confiance en aucun des engagés. Confirmez-ceci en allant dans le répertoire où <code>i2p.mtn</code> a été créé, puis tentez d’obtenir la branche I2P :

source: A directory named <code>i2p.i2p</code> should <b>not</b> appear. You should encounter many error messages like:
fr: Un répertoire nommé <code>i2p.i2p</code> ne devrait <b>pas</b> apparaître. Vous devriez rencontrer beaucoup de messages d’erreurs tels que :

source: If you are satisfied with results, restore the backup of <code>monotonerc</code> that was created above. If you didn't create a backup as advised, re-read <a href="#setting-up-trust-evaluation-hooks">Setting up trust evaluation hooks</a>.
fr: Si les résultats vous conviennent, restaurez la sauvegarde de <code>monotonerc</code> qui a été créée à l’étape précédente. Si vous n’avez pas créé de sauvegarde comme conseillé, relisez <a href="#setting-up-trust-evaluation-hooks">Mettre en place des crochets d’évaluation de confiance</a>.

source: If you already have a branch checked out, skip to the <a href="#updating-your-working-copy-to-the-latest-version">next section</a>.
fr: Si vous avez déjà obtenu une branche, passez à la <a href="#updating-your-working-copy-to-the-latest-version">section suivante</a>.

source: Change into the directory where <code>i2p.mtn</code> is located. Over there issue:
fr: Allez dans le répertoire où <code>i2p.mtn</code> est placé. Là-bas envoyez :

source: The checkout should complete without error messages and a directory named <code>i2p.i2p</code> should appear in the current directory. Congratulations! You have successfully checked out the latest I2P sources, ready to be compiled.
fr: L’obtention (checkout) devrait être complète sans messages d’erreur et un répertoire nommé <code>i2p.i2p</code> devrait apparaître dans le répertoire actuel. Félicitations ! vous avez obtenu avec succès les dernières sources d’I2P, prêtes à être compilées.

source: If you haven't done this already, pull fresh code from the server to your local Monotone repository. To accomplish this, change into the directory where <code>i2p.mtn</code> is located and issue:
fr: Si vous n’avez pas déjà fait ceci, tirez le code frais hors du serveur vers votre dépôt Monotone local. Pour accomplir ceci, allez dans le répertoire où <code>i2p.mtn</code> est localisé, puis entrez :

source: Now change into your <code>i2p.i2p</code> directory, and over there issue:
fr: Maintenant allez dans votre répertoire <code>i2p.i2p</code>, et là-bas envoyez :

source: As long as there were no errors&hellip;Congratulations! You have successfully updated to the latest I2P sources. They should be ready to compile.
fr: Si il n’y a pas d’erreurs &hellip;Félicitations ! vous avez réussi à vous mettre à jour aux dernières sources d’I2P. Elles devraient être prêtes à être compilées.

source: Obtaining and deploying developers' transport keys
fr: Obtention et déploiement des clés de transport de développeur

source: As a server operator you may want to grant push access to certain developers.
fr: En tant qu’opérateur de serveur vous pouvez vouloir accorder l’accès en poussée à certains développeurs.

source: By default the Monotone server denies all access.
fr: Par défaut le serveur Monotone refuse tout accès.

source: To grant pull access to all clients, set the following in
fr: Pour accorder l’accès en traction à tous les clients, mettez la chose suivante dans

source: No one will not be able to push code to your server without permission being explicitly granted. To grant push access:
fr: Personne ne pourra pousser du code vers votre serveur sans permission accordée explicitement. Accorder l’accès en poussée :

source: Add the name of the user's transport key to <code>$HOME/.monotone/write-permissions</code>, such as <code><pre> zzz-transport@mail.i2p complication-transport@mail.i2p </pre></code> with one key per line.
fr: Ajoutez le nom de l’utilisateur de clé de transport à <code>$HOME/.monotone/write-permissions</code>, tel que <code><pre> zzz-transport@mail.i2p complication-transport@mail.i2p </pre></code> avec une clé par ligne.

source: Import the transport key(s) into your database. The procedure for importing transport keys is the same as for importing commit keys, which is described in the section <a href="#obtaining-and-deploying-developers-keys">Obtaining and deploying developers' keys</a>.
fr: Importez la/les clé(s) de transport dans votre base de données. La procédure pour importer des clés de transport est la même que pour importer des clés d’engagement, qui est décrite dans la section <a href="#obtaining-and-deploying-developers-keys">Obtention et déploiement des clés de transport de développeur</a>.

source: A separate database should be used for your Monotone server because monotone will lock the database while it is served to others. Make a copy of your development database, then start the server with:
fr: Une base de données séparée devrait être utilisée pour votre serveur Monotone, car Monotone verrouillera la base de données si elle est servie à d’autres. Faites une copie de votre base de données de développement, puis lancez le serveur avec :

source: If your key is protected with a passphrase, Monotone may request the passphrase when the first client connects. You can work around this by connecting making the first client connection to your server (or by clearing the password for your transport key).
fr: Si votre clé est protégée par une phrase de passe, Monotone pourrait demander la phrase de passe quand le premier client se connecte. Vous pouvez contourner cela en établissant la première connexion client vers votre serveur (ou en effaçant la phrase de passe de votre clé de transport).

source: For your server to be accessible for others over I2P, you will need to create a server tunnel for it. Use the "Standard" tunnel type and "Bulk" profile.
fr: Pour que votre serveur puisse être accessible à d’autres via I2P, vous devrez créer un tunnel de serveur pour cela. Utilisez le type de tunnel "Standard" et le profil "Bulk".

source: Debian (amongst other distributions) has integrated Monotone into their framework of daemons/services. Although Monotone servers can still be run "the ordinary way" on Debian systems, doing it the "Debian way" may be more straightforward.
fr: Debian (parmi d’autres distributions) a intégré Monotone dans leur framework de démons/services. Bien que les serveurs Monotone puissent toujours être exécutés de la "façon ordinaire" sur des systèmes Debian, le faire à la "façon Debian" peut être plus direct.

source: Permissions are granted by editing the files <code>/etc/monotone/read-permissions</code> and <code>/etc/monotone/write-permissions</code>. You'll also need to edit <code>/etc/default/monotone</code> to enable monotone to start at boot or to customize the host, port, or database location.
fr: Les droits sont donnés en éditant les fichiers <code>/etc/monotone/read-permissions</code> et <code>/etc/monotone/write-permissions</code>. Vous devrez aussi éditer <code>/etc/default/monotone</code> pour activer le lancement de Monotone lors de l’amorçage ou pour personnaliser l’hôte, le port ou l’emplacement de la base de données.

source: New Developer's Guide
fr: Guide du nouveau développeur

source: July 2018
fr: Juillet 2018

source: Basic study
fr: Étude basique

source: Getting the I2P code
fr: Obtenir le code de I2P

source: The easy way: Git
fr: La manière facile : Git

source: The proper way: Monotone
fr: La manière appropriée : Monotone

source: Building I2P
fr: Construire I2P

source: Development ideas
fr: Idées de développement

source: Making the results available
fr: Rendre disponibles les résultats

source: Get to know us!
fr: Apprenez à nous connaître !

source: Translations
fr: Traductions

source: Tools
fr: Outils
