Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: fr

source: Installing and using monotone is not that difficult. Several of the translators and other contributors to I2P are non-programmers, and they use monotone regularly. Monotone is simply a source control system, it is not about "coding".
fr: L’installation et l’utilisation de Monotone ne sont pas si difficiles. Plusieurs des traducteurs et d’autres collaborateurs de I2P ne sont pas des programmeurs et ils utilisent Monotone régulièrement. Monotone est simplement un système de contrôle de source, ce n’est pas du "codage".

source: Our items to translate are not "documents". They are html files and po files, with a specific format and character encoding (UTF-8) that must be maintained, and not corrupted by email programs or other methods of transfer.
fr: Nos éléments à traduire ne sont pas des «&nbsp;documents&nbsp;». Ce sont des fichiers HTML et po, ayant un format particulier et un codage de caractère (UTF-8) qui doivent être maintenus sans être corrompu par des logiciels de courriel ou autres méthodes de transfert.

source: We looked at 'pootle' as a front-end for translators. It didn't work well, needed an administrator, and a pootle-based process would suffer from a number of the above flaws.
fr: Nous avons regardé 'pootle' comme un frontal pour les traducteurs. Il n’a pas bien marché, avait besoin d’un administrateur, et un processus basé sur pootle souffrait d’un certain nombre des défauts susdits.

source: <b>In summary:</b> Yes, we know it is somewhat of a hurdle to get started. It's really the only possible way we can do it. Give it a try, it really isn't that hard.
fr: <b>En résumé :</b> Oui, nous savons que c’est un peu un obstacle pour commencer. C’est vraiment la seule façon possible que nous pouvons faire. Faites un essai, ce n’est vraiment pas si difficile.

source: More Information
fr: Plus de renseignements

source: The #i2p-dev channel on IRC, or the <a href="http://%(zzz)s/forums/14">translation forum on %(zzz)s</a>.
fr: Le canal IRC #i2p-dev, ou le <a href="http://%(zzz)s/forums/14">forum translation sur %(zzz)s</a>.

source: How to Set up a Reseed Server
fr: Comment configurer un serveur de réamorçage

source: February 2017
fr: Février 2017

source: Overview
fr: Vue d’ensemble

source: Thank you for volunteering to run an I2P reseed server. "Reseeding" is our term for bootstrapping new routers into the network. New routers fetch a bundle of peer references, or "router infos", from one or more of a hardcoded list of HTTPS URLs.
fr: Nous vous remercions de vous porter volontaire pour exploiter un serveur de réensemencement I2P. « Réensemencement » est notre terme pour amorcer les nouveaux routeurs dans le réseau. Les nouveaux routeurs récupèrent un ensemble de références de pairs, ou « infos de routeurs » d’une ou plusieurs listes d’URL HTTPS figées dans le code.

source: Requirements
fr: Besoins

source: At its simplest, a reseed server consists of a Java I2P router, an HTTPS web server, and some scripts that periodically gather router infos from the router, bundle and sign them into a custom file format, and deliver these files over HTTPS. In practice, it's a bit more complex, and a reseed operator must be fairly competent and attentive. A reseed server is not appropriate for a residential internet connection. The complexities include:
fr: Dans sa forme la plus simple, un serveur de réamorçage consiste en un routeur I2P Java, un serveur web HTTP, et quelques scripts qui collectent périodiquement des infos de routeurs à partir du routeur, les groupant et les signant dans un format de fichier personnalisé et livrant ces fichiers via HTTPS. En pratique, c’est un peu plus complexe et un opérateur de réamorçage se doit d’être assez compétent et attentif. Un serveur de réamorçage n’est pas approprié à une connexion résidentielle à Internet. Les complexités incluent :

source: You must have a secure SSL setup with either a self-signed certificate or a cert that chains up to a standard CA
fr: Vous devez avoir une configuration SSL sécurisée avec un certificat auto-signé ou avec un ceritificat qui enchaîne vers un CA standard

source: The SSL configuration must conform to current best practices on allowed ciphers and protocols, and the CN/SAN host name must match the URL
fr: La configuration SSL doit se conformer aux meilleures pratiques actuelles concernant les chiffres et protocoles autorisés. Le nom d’hôte CN/SAN doit correspondre à l’URL

source: The scripts are designed to deliver different router info bundles to different requestors for network diversity
fr: Les scripts sont conçus pour fournir différents paquets d’info routeur aux différents demandeurs pour diversifier le réseau.

source: The scripts are designed to deliver the same bundle to the same repeated requestor to prevent scraping
fr: Les scripts sont conçus pour livrer le même paquet au même demandeur répété, afin d’empêcher du grattement (scraping)

source: The reseed servers are under periodic attacks and DDoS attempts, and from other buggy I2P implementations and botnets. This necessitates that you run fail2ban or an equivalent solution.
fr: Les serveurs de réensemencement subissent des attaques régulières et des tentatives d’attaques par saturation, et d’autres mises en oeuvre boguées d’I2P et de réseaux de zombies. C’est pourquoi vous devez exécuter fail2ban ou une solution équivalente.

source: Information Required
fr: Informations requises

source: When your setup is complete and ready for testing, we will need the HTTPS URL, the SSL public key certificate, and the "su3" bundle public key. After testing is complete, these will be added to the hardcoded entries in the Java and C++ routers in the next release, and you will start seeing traffic. We also will need your email address so we may continue to contact you about reseed administration issues. The email will not be made public but will be known to the other reseed operators. You should expect that your nick or name and its association with that URL or IP will become public.
fr: Une fois l’installation terminée et prête a être testée, nous avons besoin de l’URL HTTPS, la clé publique du certificat SSL et la clé publique du paquet "su3". Dès que les tests ont été effectués, ils seront ajoutés, dans la prochaine version, aux entrées hard-codées dans les routeurs Java et C++, vous verrez alors le traffic débuter. Nous avons besoin de votre courriel afin de vous contacter pour les problèmes d’administration des 'reseed'. Il ne sera pas rendu public mais sera connus des autres opérateurs 'reseed'. Vous devez vous attendre à ce que votre surnom ou nom et son association avec cet URL ou IP deviennent publiques.

source: Privacy Policy
fr: Politique de confidentialité

source: A reseed operator is a trusted role in the network. While we do not yet have a formal privacy policy, you must ensure the privacy of our users by not publicizing logs or IPs found in those logs, except as necessary to discuss administration issues with the I2P reseed team.
fr: Un opérateur de réensemencement est un rôle de confiance dans le réseau. Bien que nous n’ayons pas encore de politique de confidentialité officielle, vous devez garantir la protection des données personnelles de nos utilisateurs en ne rendant pas publics les journaux ou adresses IP trouvées dans ces journaux, sauf si nécessaire pour discuter de problèmes d’administration avec l’équipe de réensemencement d’I2P.

source: Financial Support
fr: Soutien financier

source: Modest financial support may be available to those running reseed servers. This support would be in partial reimbursement for your server costs. Support will not be paid in advance and will probably not cover all your expenses. Support is only available to those who have been running reseed servers in good standing for several months, and is based on actual need.
fr: Un soutien financier modeste peut être disponible pour ceux faisant fonctionner des serveurs de réamorçage. Ce soutien correspondrait au remboursement partiel de vos coûts de serveur. Le soutien ne sera pas payé à l’avance et ne couvrira probablement pas toutes vos dépenses. Le soutien est seulement disponible pour ceux qui ont fait fonctionner des serveurs de réamorçage de façon fiable pendant plusieurs mois, et il est basé sur le besoin réel.

source: If you would like to discuss support, please contact echelon and CC: backup.
fr: Si vous souhaitez discuter du soutien, veuillez contacter echelon et Cc : backup.

source: Getting Started
fr: Commencer

source: Our reseed coordinator is "backup" and he may be contacted at backup at mail.i2p or backup at i2pmail.org. Unfortunately, he is not generally on IRC. The reseed setup is somewhat specialized, and you should direct most questions to him.
fr: Notre coordinateur de réensemencement est «&nbsp;backup&nbsp;» et l’on peut le contacter sur backup à mail.i2p ou backup à i2pmail.org . Il n’est malheureusement habituellement pas sur IRC. La configuration du réensemencement est plutôt spécialisée et vous devriez lui adresser la plupart des questions.

source: For actual implementation, details below. We have one recommended reseed solution:
fr: Concernant la mise en œuvre effective, des détails se trouvent ci-dessous. Nous avons une solution recommandée de réensemencement :

source: A Go implementation that includes the web server and all the scripts. This is the recommended solution.
fr: Une implémentation Go qui inclut le serveur Web et tous les scripts. Ceci est la solution recommandée.

source: For further information, read the information at the following links, and then contact backup. Thank you!
fr: Pour plus de précisions, veuillez consulter les renseignements situés aux liens suivants, puis contacter backup. Merci !

source: Detailed Instructions
fr: Instructions détaillées
