Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: fr

source: <b>Tip:</b> To find welterde's GPG key, on public keyservers locate the key `0x62E011A1`, with the name `welterde@arcor.de` and the fingerprint `6720 FD81 3872 6DFC 6016 64D1 EBBC 0374 62E0 11A1`.
fr: <b>Astuce :</b> pour trouver la clé GPG de welterde, sur les serveurs publics de clés localisez la clé `0x62E011A1`, avec le nom `welterde@arcor.de` et l’empreinte `6720 FD81 3872 6DFC 6016 64D1 EBBC 0374 62E0 11A1`.

source: <b>Tip:</b> To find Complication's GPG key, on his eepsite locate the key `0x79FCCE33`, with the name `complication@mail.i2p` and the fingerprint `73CF 2862 87A7 E7D2 19FF DB66 FA1D FC6B 79FC CE33`.
fr: <b>Astuce :</b> pour trouver la clé GPG de Complication’s, sur son site eep localisez la clé `0x79FCCE33`, avec le nom `complication@mail.i2p` et l’empreinte `73CF 2862 87A7 E7D2 19FF DB66 FA1D FC6B 79FC CE33`.

source: <b>Tip:</b> To find jrandom's GPG key for Syndie releases, on public keyservers locate the key `0x393F2DF9`, with the name `syndie-dist-key@i2p.net` and the fingerprint `AE89 D080 0E85 72F0 B777 B2ED C2FA 68C0 393F 2DF9`.
fr: <b>Astuce :</b> pour trouver la clé GPG de jrandom pour les versions de Syndie, sur les serveurs publics de clés localisez l’empreinte `0x393F2DF9`, avec le nom `syndie-dist-key@i2p.net` et l’empreinte `AE89 D080 0E85 72F0 B777 B2ED C2FA 68C0 393F 2DF9`.

source: Jrandom had to leave unexpectedly in the end of 2007. His commit key was deployed in the Syndie Monotone repository, in a file named `mtn-committers`. That file also had a GPG signature, `mtn-committers.sig`, but it was a binary detached signature. I am going to supply both files in GPG ASCII-armoured form below.
fr: Jrandom a dû partir inopinément à la fin de 2007. Sa clé de commit était déployée dans le dépôt Monotone de Syndie, dans un fichier nommé 'mtn-committers'. Ce fichier avait aussi une signature GPG, 'mtn-committers.sig', mais c’était une signature binaire détachée. Je vais devoir fournir les deux fichiers sous forme GPG blindée-ASCII ci-dessous.

source: First, the file `mtn-committers` containing jrandom's Monotone key. Save as `mtn-committers.asc` and unpack it using `gpg --output mtn-committers --dearmor mtn-committers.asc`:
fr: D’abord, le fichier « mtn-committers » contenant la clé Monotone de jrandom. Enregistrez-le sous « mtn-committers.asc » et décompressez-le en utilisant « gpg --output mtn-committers --dearmor mtn-committers.asc » :

source: Now the file `mtn-committers.sig`, containing the GPG signature. Save as `mtn-committers.sig.asc` and unpack it using `gpg --output mtn-committers.sig --dearmor mtn-committers.sig.asc`. Use it to verify the above supplied `mtn-committers` file:
fr: Maintenant, le fichier « mtn-committers.sig », contenant la signature GPG. Enregistrez-le sous « mtn-committers.sig.asc » et décompressez-le en utilisant « gpg --output mtn-committers.sig --dearmor mtn-committers.sig.asc ». Utilisez-la pour vérifier le fichier « mtn-committers » fourni ci-dessus :

source: Some of the developers have included their Monotone keys in their <a href="%(licenseagreements)s">signed license agreement</a>.
fr: Certains des développeurs ont inclus leurs clés Monotone dans leur <a href="%(licenseagreements)s">contrat de licence signé</a>.

source: Developer Guidelines and Coding Style
fr: Directives pour développeurs style de codage

source: Read the <a href="%(newdevs)s">new developers guide</a> first.
fr: Veuillez lire le <a href="%(newdevs)s">guide pour nouveaux développeurs</a> d’abord.

source: Basic Guidelines and Coding Style
fr: Directives de base et style de programmation

source: Most of the following should be common sense for anybody who has worked on open source or in a commercial programming envrionment. The following applies mostly to the main development branch i2p.i2p. Guidelines for other branches, plugins, and external apps may be substantially different; check with the appropriate developer for guidance.
fr: La plupart des points suivants devraient être évident pour quelqu’un qui a travaillé sur du code source libre ou dans une environnement commercial de programmation. Les points suivants s’appliquent surtout à la branche de développement principale i2p.i2p. Les directives pour d’autres branches, plug-ins et applications externes peuvent être considérablement différentes, vérifiez avec le développeur approprié pour des conseils.

source: Community
fr: Communauté

source: Please don't just "write code". If you can, participate in other development activities, including: development discussions and support on IRC, zzz.i2p, and forum.i2p; testing; bug reporting and responses; documentation; code reviews; etc.
fr: Veuillez ne pas « juste écrire du code ». Si vous le pouvez, participez aux activités de développement, dont : discussions de développement et assistance sur IRC, zzz.i2p, forum.i2p ; faire des tests ; signaler des bogues et répondre aux relevés de bogues ; documentation ; revues de code ; etc.

source: Active devs should be available periodically on IRC #i2p-dev. Be aware of the current release cycle. Adhere to release milestones such as feature freeze, tag freeze, and the checkin deadline for a release.
fr: Les dévs actif devrait être disponible périodiquement sur IRC #i2p-dev. Soyez au courant du cycle de sortie actuel. Adhérez pour relâcher - release - des jalons - milestones - tel que gel de caractéristiques, gel d’étiquette et le délai limite pour une sortie.

source: Release Cycle
fr: Cycle de sortie

source: Our normal release cycle is 6-10 weeks. Following are the approximate deadlines within a typical 8-week cycle. Actual deadlines for each release are set by the lead developer.
fr: Notre cycle de sortie normal est 6-10 semaines. Ce qui suit sont les délais approximatifs dans un cycle typique de 8 semaines. Les délais réels pour chaque sortie sont définis par le développeur principal.

source: 1-2 days after previous release: Checkins to trunk are allowed.
fr: 1 à 2 jours après la version sortie précédemment : les inclusions (checkins) vers le tronc (trunk) sont permises.

source: 2-3 weeks after previous release: Deadline to propagate major changes from other branches to trunk.
fr: 2-3 semaines après la version sortie précédemment : délai limite pour propager les changements majeurs depuis d’autres branches vers le tronc.

source: 4-5 weeks before release: Deadline to request new home page links.
fr: 4-5 semaines avant la sortie : délai limite concernant les demandes d’ajouts de liens sur la page d’accueil.

source: 3-4 weeks before release: Feature freeze. Deadline for major new features.
fr: 3 à 4 semaines avant la sortie : gel des caractéristiques. Échéance pour les nouvelles fonctions principales.

source: 2-3 weeks before release: Hold project meeting to review new home page link requests, if any.
fr: 2 à 3 semaines avant la sortie : tenue d’une réunion de projet afin de passer en revue les requêtes de mise en page d’accueil, si il y en a.

source: 7-10 days before release: String freeze. No more changes to translated ("tagged") strings. Push strings to Transifex, announce translation deadline on Transifex.
fr: 7-10 jours avant la sortie : gel des chaînes de texte. Il n’y a plus de modification des chaînes de texte ("étiquettées") à traduire. Les chaînes de texte sont poussées vers Transifex, l’annonce de la date limite de traduction est annoncée sur Transifex.

source: 7-10 days before release: Feature deadline. Bug fixes only after this time. No more features, refactoring or cleanup.
fr: 7 à 10 jours avant la parution : date limite pour les fonctions. Passé cette date, il n’y aura que des correctifs de bogues, plus de nouvelles fonctions, de réusinage ou de nettoyage.

source: 3-4 days before release: Translation deadline. Pull translations from Transifex and check in.
fr: 3-4 jours avant la sortie : délai limite de traduction. Tirez les traductions depuis Transifex puis enregistrez les.

source: 2-3 days before release: Checkin deadline. No checkins after this time without the permission of the release builder.
fr: 2-3 jours avant la sortie : délai limite des vérifications. Aucune vérification après cette date sans la permission du constructeur de sortie.

source: Hours before release: Code review deadline.
fr: Heures qui précèdent la sortie : délai limite d’examen du code.

source: Have a basic understanding of distributed source control systems, even if you haven't used monotone before. Ask for help if you need it. Once pushed, checkins are forever, there is no undo. Please be careful. If you have not used monotone before, start with baby steps. Check in some small changes and see how it goes.
fr: Avoir une compréhension de base des systèmes distribués de contrôle de source, même si vous n’avez pas utilisé Monotone auparavant. Demandez de l’aide si vous en avez besoin. Une fois poussé, les checkins sont pour toujours, il n’y a pas d’annulation. Veuillez être prudent. Si vous n’avez pas utilisé Monotone auparavant, commencez pas à pas. Vérifiez quelques petits changements et voyez comment cela marche.

source: Test your changes before checking them in. If you prefer the checkin-before-test development model, use your own development branch (e.g. i2p.i2p.yourname.test) and propagate back to i2p.i2p once it is working well. Do not break the build. Do not cause regressions. In case you do (it happens), please do not vanish for a long period after you push your change.
fr: Testez vos changements avant de les envoyer. Si vous préférez le modèle de développement envoyer-avant-de-tester, utilisez votre propre branche de développement (par exemple i2p.i2p.yourname.test) et une fois que cela marche bien propagez en retour vers i2p.i2p. Ne cassez pas la build. Ne causez pas de régressions. Dans le cas où vous le feriez (cela arrive), veuillez ne pas disparaitre pendant une longue période après avoir poussé vos changements.

source: If your change is non-trivial, or you want people to test it and need good test reports to know whether your change was tested or not, add a checkin comment to history.txt and increment the build revision in RouterVersion.java.
fr: Si votre changement n’est pas insignifiant, ou que vous voulez que les gens le testent et avez besoin de bons rapports de test pour savoir si votre changement a été testé ou pas, ajoutez un commentaire de checkin dans history.txt et incrémentez la révision de build dans RouterVersion.java.

source: Ensure that you have the latest monotonerc file in _MTN. Do not check in on top of untrusted revisions.
fr: Assurez que vous avez le dernier fichier monotonerc dans _MTN. N’envoyez pas par dessus des révisions non éprouvées.

source: Ensure that you 'mtn pull' and 'mtn update' to the latest revision before you check in and push. If you inadvertently diverge, merge and push as soon as possible. Don't routinely make others merge for you. Yes, we know that monotone says you should push and then merge, but in our experience, in-workspace merge works just as well as in-database merge, without creating a merge revision.
fr: Veillez à 'mtn pull' et 'mtn update' à la dernière version avant d’envoyer et de pousser. Si par erreur c’est différent, fusionnez et poussez dès que possible. Ne faites pas régulièrement d’autres fusions pour vous. Oui, nous savons que Monotone dit de pousser puis de fusionner, mais dans l’espace de travail fusionner fonctionne aussi bien que dans une fusion en database, sans créer de révision de fusion.

source: Do not check in major changes into the main i2p.i2p branch late in the release cycle. If a project will take you more than a couple days, create your own branch in monotone and do the development there so you do not block releases.
fr: N’envoyez pas de changements majeurs dans la branche principale i2p.i2p tardivement dans le cycle de sortie. Si un projet va vous prendre davantage que quelques jours, créez votre propre branche dans Monotone et faites le développement là afin de ne pas bloquer les sorties.

source: Coding Style
fr: Style de codage

source: Coding style throughout most of the code is 4-spaces for indentation. Do not use tabs. Do not reformat code. If your IDE or editor wants to reformat everything, get control of it. Yes, we know 4 spaces is a pain, but perhaps you can configure your editor appropriately. In some places, the coding style is different. Use common sense. Emulate the style in the file you are modifying.
fr: Le style de codage partout dans la plupart du code est de 4 espaces pour l’indentation. N’utilisez pas de tabulations. Ne re-formatez pas le code. Si votre IDE ou éditeur veulent tout re-formater, prenez-en le contrôle. Oui, nous savons que 4 espaces est pénible, mais peut-être que vous pouvez configurer votre éditeur convenablement. En quelques endroits, le style de codage est différent. Utilisez le bon sens. Imitez le style dans le fichier que vous modifiez.

source: All new public and package-private classes and methods require Javadocs. Add @since release-number. Javadocs for new private methods are desirable.
fr: Toutes les nouvelles classes et méthodes publiques ou privées des paquets requièrent Javadocs. Ajoutez @since release-number. Javadocs pour les nouvelles méthodes privées est préférable.

source: For any Javadocs added, there must not be any doclint errors or warnings. Run 'ant javadoc' with Oracle Java 8 or higher to check. All params must have @param lines, all non-void methods must have @return lines, all exceptions declared thrown must have @throws lines, and no HTML errors.
fr: Pour tout Javadocs ajouté, il ne doit y avoir aucune erreur doclint ni d’avertissement. Pour le vérifier, exécuter «&nbsp;ant javadoc&nbsp;» avec Oracle Java 8 ou ultérieure. Tous les paramètres doivent avoir des lignes @param, toutes les méthodes non nulles doivent avoir des lignes @return, toutes les exceptions déclarées comme jetées doivent avoir des lignes @throws et aucune erreur HTML.

source: Classes in core/ (i2p.jar) and portions of i2ptunnel are part of our official API. There are several out-of-tree plugins and other applications that rely on this API. Be careful not to make any changes that break compatibility. Don't add methods to the API unless they are of general utility. Javadocs for API methods should be clear and complete. If you add or change the API, also update the documentation on the website (i2p.www branch).
fr: Les classes dans core/ (i2p.jar) et les portions d’i2ptunnel font partie de notre API officielle. Il y a plusieurs plug-ins out-of-tree et d’autres applications qui comptent sur cette API. Soyez prudent de ne pas faire quelconque changement qui casserait cette compatibilité. N’ajoutez pas de méthodes à l’API à moins qu’elles ne soient d’utilité générale. Les Javadocs pour les méthodes d’API devraient être claires et complètes. Si vous ajoutez ou changez l’API, mettez aussi à jour la documentation sur le site Web (branche i2p.www).

source: Tag strings for translation where appropriate. Don't change existing tagged strings unless really necessary, as it will break existing translations. Do not add or change tagged strings after the "tag freeze" in the release cycle so that translators have a chance to update before the release.
fr: Étiquetez des chaînes pour traduction quand c’est nécessaire. Ne changez pas de chaînes étiquetées existantes à moins que ce soit vraiment nécessaire, car cela cassera les traductions existantes. N’ajoutez pas ni ne changez les chaînes étiquetées après le "gel d’étiquette" dans le cycle de sortie afin que les traducteurs aient une chance de mettre à jour avant la sortie.

source: Use generics and concurrent classes where possible. I2P is a highly multi-threaded application.
fr: Utilisez de classes génériques et concurrentes quand cela est possible. I2P est une application grandement multiple.

source: Be familiar with common Java pitfalls that are caught by findbugs. Run 'ant findbugs' to learn more.
fr: Etre habitué des pièges Java communs qui sont attrapés par findbugs. Exécutez 'ant findbugs' pour apprendre davantage.

source: Explicitly convert between primitive types and classes; don't rely on autoboxing/unboxing.
fr: Convertissez explicitement entre types primitifs et classes; ne comptez pas sur l’autoboxing/unboxing.

source: Don't use URL. Use URI.
fr: N’utilisez pas URL. Utilisez URI.

source: Don't catch Exception. Catch RuntimeException and checked exceptions individually.
fr: N’interceptez pas Exception. Interceptez RuntimeException et vérifiez les exceptions individuellement.

source: Don't use String.getBytes() without a UTF-8 charset argument. You may also use DataHelper.getUTF8() or DataHelper.getASCII().
fr: N’utilisez pas String.getBytes() sans un argument jeu de caractères UTF-8. Vous pouvez aussi utiliser DataHelper.getUTF8() ou DataHelper.getASCII().

source: Always specify a UTF-8 charset when reading or writing files. The DataHelper utilities may be helpful.
fr: Spécifiez toujours un jeu de caractères UTF-8 lors de la lecture ou de l’écriture de fichiers. Les utilitaires DataHelper peuvent être utiles.

source: Always specify a locale (for example Locale.US) when using String.toLowerCase() or String.toUpperCase(). Do not use String.equalsIgnoreCase(), as a locale cannot be specified.
fr: Toujours spécifier un local (e.g. Locale.US) avec String.toLowerCase() ou String.toUpperCase(). N’utilisez pas String.equalsIgnoreCase() car on ne peut pas spécifier de local.

source: Don't use String.split(). Use DataHelper.split().
fr: N’utilisez pas String.split(). Utilisez DataHelper.split().

source: Ensure that InputStreams and OutputStreams are closed in finally blocks.
fr: Assurez-vous que InputStreams et OutputStreams sont fermés en blocs finaux (finally blocks).

source: Use {} for all for and while blocks, even if only one line. If you use {} for either the if, else, or if-else block, use it for all blocks. Put "} else {" on a single line.
fr: Utilisez {} pour tous les blocs for et while, même pour une seule ligne. Si vous utilisez {} soit pour un bloc if, else ou if-else, faites-le pour tous les blocs. Placez "} else {" sur une seule ligne.

source: Specify fields as final wherever possible.
fr: Spécifiez les champs en tant que finaux chaque fois que possible.

source: Don't store I2PAppContext, RouterContext, Log, or any other references to router or context items in static fields.
fr: Ne pas stocker dans des champs statiques I2PAppContext, RouterContext, Log ni autres références au routeur ou aux éléments contextuels.

source: Don't start threads in constructors. Use I2PAppThread instead of Thread.
fr: Ne commencez pas de fils (threads) dans des constructeurs (contructors). Utilisez I2PAppThread au lieu de fil.

source: Licenses
fr: Licences

source: Only check in code that you wrote yourself. Before checking in any code or library jars from other sources, justify why it is necessary, verify the license is compatible, and obtain approval from the lead developer.
fr: Vérifiez seulement le code que vous avez écrit vous-même. Avant de vérifier n’importe quel code ou bibliothèque issu d’autres sources, justifiez pourquoi c’est nécessaire, vérifiez que la licence est compatible, et obtenez l’approbation du développeur principal.

source: If you do obtain approval to add external code or jars, and binaries are available in any Debian or Ubuntu package, you must implement build and packaging options to use the external package instead. Checklist of files to modify:
fr: Si vous obtenez vraiment l’approbation d’ajouter du code externe ou des jars, et que les fichiers binaires sont disponibles dans n’importe quelle paquet Debian ou Ubuntu, vous devez mettre en œuvre des options de construction et d’empaquetage afin d’utiliser le paquet externe à la place. Liste de contrôle des fichiers à modifier :

source: For any images checked in from external sources, it is your responsibility to first verify the license is compatible. Include the license and source information in the checkin comment.
fr: Pour n’importe quelles image enregistrée depuis des sources externes c’est votre responsabilité de d’abord vérifier que la licence est compatible. Incluez la licence et sourcez l’information dans le commentaire de checkin.

source: Bugs
fr: Bogues

source: Managing Trac tickets is everybody's job, please help. Monitor %(trac)s for tickets you have been assigned or can help with. Assign, categorize, comment on, fix, or close tickets if you can.
fr: Gérer les tickets Trac est le travail de tout le monde, veuillez aider. Surveillez dans %(trac)s les tickets auxquels vous avez été assigné ou auxquels pouvez aider. Assignez, catégorisez, commentez, réparez, ou fermez des tickets si vous le pouvez.

source: New developers should start by fixing a bug. Search for bugs with the 'easy' keyword on trac. When you have a fix, attach your patch to the ticket and add the keyword 'review-needed'. Do not close the ticket until it's been successfully reviewed and you've checked your changes in. Once you've done this smoothly for a couple of tickets, you may follow the normal procedure below.
fr: Les nouveaux développeurs devraient commencer en corrigeant un bogue. Recherche des bogues dans trac avec le mot-clé 'easy'. Quand vous avez une correction, attachez votre patch au ticket et ajoutez le mot-clé 'review-needed'. Ne fermez pas le ticket avant qu’il n’ait été passé en revue et que vous avez enregistré vos changements avec succès. Une fois que vous ceci avez fait sans à-coups pour deux ou trois tickets, vous pouvez suivre la procédure normale ci-dessous.

source: Close a ticket when you think you've fixed it. We don't have a test department to verify and close tickets. If you arent sure you fixed it, close it and add a note saying "I think I fixed it, please test and reopen if it's still broken". Add a comment with the dev build number or revision and set the milestone to the next release.
fr: Fermez un ticket quand vous pensez que vous l’avez réparé. Nous n’avons pas de département de test pour vérifier et fermer des tickets. Si vous n’êtes pas sûr vous l’avez réparé, fermez le et ajouter une note disant "Je pense que je l’ai réparé, veuillez tester et réouvrir si c’est toujours cassé". Ajoutez un commentaire avec le numéro de build dev ou la révision et mettez le jalon à la prochaine sortie.

source: Using an IDE with I2P
fr: Utiliser un IDE avec I2P

source: The main I2P development branch (<code>i2p.i2p</code>) has been set up to enable developers to easily set up two of the commonly-used IDEs for Java development: Eclipse and NetBeans.
fr: La branche principale de développement de I2P (<code>i2p.i2p</code>) a été mise en place pour permettre aux développeurs de configurer facilement deux des IDE généralement utilisés pour le développement Java : Eclipse et NetBeans.

source: Check out the I2P branch into some directory (e.g. <code>$HOME/dev/i2p.i2p</code>).
fr: Regardez la branche I2P dans un certain répertoire (par exemple <code>$HOME/dev/i2p.i2p</code>).

source: Done! Your workspace should now contain all projects within the I2P branch, and their build dependencies should be correctly set up.
fr: Fait ! Votre espace de travail devrait maintenant contenir tous les projets dans la branche I2P, et leurs dépendances de construction devraient être correctement configurées.

source: The main I2P development branches (<code>i2p.i2p</code> and branches from it) contain NetBeans project files.
fr: Les principales branches de développement d’I2P (<code>i2p.i2p</code> et branches à partir d’elle) contiennent les fichiers projets NetBeans.

source: Monotone Guide
fr: Guide Monotone

source: Operating a Monotone client
fr: Opérer un client Monotone

source: Generating Monotone keys
fr: Génération de clés de Monotone
