Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: fr

source: I2P comes with the Jetty webserver, and configuring to use the Apache server instead is straightforward. Any standard web app technology should work.
fr: I2P arrive avec le serveur web Jetty, et au lieu de cela vous pouvez directement configurer I2P pour utiliser le serveur Apache. N’importe quelle technologie d’application Web standard devrait marcher.

source: Developing using I2P requires a working I2P installation and a development environment of your own choice. If you are using Java, you can start development with the <a href="#start.streaming">streaming library</a> or datagram library. Using another programming language, SAM or BOB can be used.
fr: Développer en utilisant I2P exige de travailler sur une installation d’I2P et un environnement de développement de votre propre choix. Si vous utilisez Java, vous pouvez commencer le développement avec la <a href="#start.streaming">bibliothèque streaming</a> ou la bibliothèque de datagramme. Si vous utilisez un autre language de programmation, vous pouvez utiliser SAM ou BOB.

source: Developing with the streaming library
fr: Développer avec la bibliothèque streaming

source: The following example shows how to create TCP-like client and server applications using the streaming library.
fr: L’exemple suivant montre comment créer des applications client et serveur semblables-TCP en utilisant la bibliothèque streaming.

source: This will require the following libraries in your classpath:
fr: Ceci exigera les bibliothèques suivantes dans votre classpath :

source: The streaming library itself
fr: La bibliothèque streaming elle-même

source: Factory and interfaces for the streaming library
fr: Factory (?) et interfaces pour la bibliothèque streaming

source: Standard I2P classes, data structures, API, and utilities
fr: Classes standard I2P, structures de données, API et utilitaires

source: You can fetch these from an I2P installation, or add the following dependencies from Maven Central:
fr: Vous pouvez les obtenir depuis un installation I2P ou ajouter les dépendances suivantes depuis Maven Central :

source: Network communication requires the usage of I2P network sockets. To demonstrate this, we will create an application where a client can send text messages to a server, who will print the messages and send them back to the client. In other words, the server will function as an echo.
fr: La communication réseau exige l’utilisation de sockets réseau I2P. Pour démontrer ceci, nous créerons une application dans laquelle un client peut envoyer des messages texte à un serveur qui imprimera les messages et les renverra au client. Autrement dit, le serveur fonctionnera comme un écho.

source: We will start by initializing the server application. This requires getting an I2PSocketManager and creating an I2PServerSocket. We will not provide the I2PSocketManagerFactory with the saved keys for an existing Destination, so it will create a new Destination for us. So we will ask the I2PSocketManager for an I2PSession, so we can find out the Destination that was created, as we will need to copy and paste that information later so the client can connect to us.
fr: Nous commencerons par initialiser l’application serveur. Cela exige d’obtenir un I2PSocketManager et de créer une I2PServerSocket. Nous ne fournirons pas les clés enregistrées d’une destination existante à l’I2PSocketManagerFactory, donc elle créera une nouvelle destination pour nous. Nous demanderons alors une I2PSession à l’I2PSocketManager, afin que nous puissions prendre connaissance de la destination qui a été créée, car nous devrons copier-coller ces informations ultérieurement afin que le client puisse se connecter à nous.

source: Code example 1: initializing the server application.
fr: Exemple de code 1 : initialisation de l’application serveur.

source: Once we have an I2PServerSocket, we can create I2PSocket instances to accept connections from clients. In this example, we will create a single I2PSocket instance, that can only handle one client at a time. A real server would have to be able to handle multiple clients. To do this, multiple I2PSocket instances would have to be created, each in separate threads. Once we have created the I2PSocket instance, we read data, print it and send it back to the client. The bold code is the new code we add.
fr: Une fois que nous avons une I2PServerSocket, nous pouvons créer des instances I2PSocket pour accepter des connexions issues de clients. Dans cet exemple, nous créerons une seule instance I2PSocket, qui peut seulement traiter un client à la fois. Un vrai serveur devrait pouvoir traiter de multiples clients. Pour faire ceci, de multiples instances I2PSocket devraient être créés, chacune dans des fils séparés. Une fois que nous avons créé l’instance I2PSocket, nous lisons les données, les imprimons et les renvoyons au client. Le code en gras est le nouveau code que nous ajoutons.

source: Code example 2: accepting connections from clients and handling messages.
fr: Exemple de code 2 : acceptation de connexions issues de clients et traitement de messages.

source: When you run the above server code, it should print something like this (but without the line endings, it should just be one huge block of characters):
fr: Quand vous exécutez le code de serveur ci-dessus, il devrait imprimer quelque chose comme ceci (mais sans les fins de ligne, il devrait juste être un énorme bloc de caractères) :

source: This is the base64-representation of the server Destination. The client will need this string to reach the server.
fr: Ceci est la représentation en Base64 de la destination du serveur. Le client aura besoin de cette chaîne pour atteindre le serveur.

source: Now, we will create the client application. Again, a number of steps are required for initialization. Again, we will need to start by getting an I2PSocketManager. We won't use an I2PSession and an I2PServerSocket this time. Instead, we will use the server Destination string to start our connection. We will ask the user for the Destination string, and create an I2PSocket using this string. Once we have an I2PSocket, we can start sending and receiving data to and from the server.
fr: Nous allons maintenant créer l’application client. Un certain nombre d’étapes sont exigées pour l’initialisation. Nous devrons de nouveau commencer en obtenant un I2PSocketManager. Nous n’utiliserons cette fois pas d’I2PSession ni d’I2PServerSocket. Nous utiliserons plutôt la chaîne de serveur Destination pour commencer notre connexion. Nous demanderons la chaîne Destination à l’utilisateur et créerons une I2PSocket utilisant cette chaîne. Une fois que nous aurons une I2PSocket, nous pourrons commencer à envoyer et à recevoir des données vers et à partir du serveur.

source: Code example 3: starting the client and connecting it to the server application.
fr: Exemple de code 3 : lancer le client et le connecter à l’application serveur.

source: Finally, you can run both the server and the client application. First, start the server application. It will print a Destination string (like shown <a href="#start.streaming.destination">above</a>). Next, start the client application. When it requests a Destination string, you can enter the string printed by the server. The client will then send 'Hello I2P!' (along with a newline) to the server, who will print the message and send it back to the client.
fr: Finalement, vous pouvez exécuter à la fois l’application serveur et client. Lancez l’application serveur en premier. Elle imprimera une chaîne Destination (comme montrer <a href="#start.streaming.destination">ci-dessus</a>). Ensuite, lancez l’application client. Quand elle demandera une chaîne Destination, vous pourrez saisir la chaîne imprimée par le serveur. Le client enverra alors « Hello I2P! » (avec un retour à la ligne) au serveur, qui imprimera le message et le renverra au client.

source: Congratulations, you have successfully communicated over I2P!
fr: Félicitations, vous avez communiqué avec succès au moyen d’I2P !

source: Existing Applications
fr: Applications existantes

source: Contact us if you would like to contribute.
fr: Contactez-nous si vous voudriez contribuer.

source: Application Ideas
fr: Idées d’applications

source: NNTP server - there have been some in the past, none at the moment
fr: Serveur NNTP — il y en a eu par le passé, mais aucun à l’heure actuelle

source: Jabber server - there have been some in the past, and there is one at the moment, with access to the public internet
fr: Serveur Jabber — il y en a eu par le passé, et il y en a un à l’heure actuelle, avec accès à l’Internet public

source: PGP Key server and/or proxy
fr: Serveur de clés PGP ou mandataire

source: Content Distribution / DHT applications - resurrect feedspace, port dijjer, look for alternatives
fr: Applications de diffusion de contenu/de table de hachage distribuée — ressusciter feedspace, porter dijjer, chercher des solutions de remplacements

source: Help out with <a href="http://syndie.i2p2.de/">Syndie</a> development
fr: Donner un coup de main au développement de <a href="http://syndie.i2p2.de/">Syndie</a>

source: Web-based applications - The sky is the limit for hosting web-server-based applications such as blogs, pastebins, storage, tracking, feeds, etc. Any web or CGI technology such as Perl, PHP, Python, or Ruby will work.
fr: Applications Web — Il n’y a pas de limite à l’hébergement d’applications serveur Web telles que blogues, pastebins, stockage, suivi, flux, etc. N’importe quelle technologie Web ou CGI telle que Perl, PHP, Python ou Ruby fonctionnera.

source: Resurrect some old apps, several previously in the i2p source package - bogobot, pants, proxyscript, q, stasher, socks proxy, i2ping, feedspace
fr: Ressusciter quelques vieilles applis, plusieurs qui se trouvaient avant dans le paquet source d’I2P ; bogobot, pants, proxyscript, q, stasher, socks proxy, i2ping, feedspace

source: I2P Developer's MTN Keys
fr: Clés MTN de développeur I2P

source: Monotone servers used by the I2P project require two types of keys to be used.
fr: Les serveurs Monotone utilisés par le projet I2P exigent deux types de clés pour être utilisés.

source: <a href="#commit">Commit Keys</a> to sign changes checked-in to the respository; and
fr: <a href="#commit">Clés d’engagement</a> pour signer des changements vérifiés vers le dépôt; et

source: <a href="#transport">Transport Keys</a> to push changes to remote servers.
fr: <a href="#transport">Clés de transport</a> pour pousser des changements vers les serveurs distants.

source: Everyone that uses Monotone to checkout the I2P codebase will need to <a href="%(monotone)s#obtaining-and-deploying-developers-keys">import</a> the developer commit keys, but only Monotone <a href="%(monotone)s#operating-a-monotone-server"> server operators</a> will need to import the <a href="#transport">transport keys</a>.
fr: Tout ceux qui utilisent Monotone pour contrôler le codebase d’I2P ont besoin d' <a href="%(monotone)s#obtaining-and-deploying-developers-keys">importer</a> la clé d’engagement développeur, mais seuls les <a href="%(monotone)s#operating-a-monotone-server"> operateurs de serveurs</a> Monotone ont besoin d’importer les <a href="#transport">clés de transport</a>.

source: Developer Commit keys
fr: Clés d’engagement développeur

source: Developer Transport Keys
fr: Clés de transport développeur

source: <b>Note:</b> Transport keys are only needed for setting up a <a href="%(monotone)s#operating-a-monotone-server">Monotone server</a>.
fr: <b>Note :</b > les clés de transport sont nécessaires seulement pour mettre en œuvre un <a href="%(monotone)s#operating-a-monotone-server">serveur Monotone</a>.

source: License Agreements
fr: Contrats de licence

source: For more information see <a href="%(licenses)s">the licenses page</a>.
fr: Pour davantage d’informations voir <a href="%(licenses)s">la page licences</a>.

source: Following is a monotonerc file defining the current trust list. Developers must use this file in ~/.monotone/monotonerc or _MTN/montonerc in their i2p.i2p workspace.
fr: La chose suivante est un fichier de monotonerc définissant la liste de confiance actuelle. Les développeurs doivent utiliser ce fichier dans ~/.monotone/monotonerc ou _MTN/montonerc dans leur espace de travail i2p.i2p.

source: Agreements
fr: Accords

source: I2P Software Licenses
fr: Licences des logiciels I2P

source: As required by our <a href="%(threatmodel)s">threat model</a> (among other reasons), the software developed to support the anonymous communication network we call I2P must be freely available, open source, and user modifiable. To meet these criteria, we make use of a variety of legal and software engineering techniques so as to remove as many barriers to entry for those considering making use of or contributing to the I2P effort.
fr: Comme exigé par notre <a href="%(threatmodel)s">modèle de menace</a> (parmi d’autres raisons), le logiciel développé pour soutenir le réseau de communication anonyme que nous appelons I2P doit être librement disponible, open source et modifiable par l’utilisateur. Pour respecter ces critères, nous nous servons d’une variété légale de techniques de génie logiciel, ceci afin d’enlever autant de barrières d’entrée aux personnes considérant faire usage ou contribuer à l’effort I2P.

source: While the information below may be more confusing than just simply stating "I2P is BSD", "I2P is GPL", or "I2P is public domain", the short answer to the question "How is I2P licensed?" is this:
fr: Bien que les informations ci-dessous peuvent prêter davantage à confusion que de simplement déclarer "I2P est sous licence BSD", "I2P est sous licence GPL" ou "I2P est dans le domaine public", la réponse courte à la question "Sous quelle licence est I2P ?" est celle-ci :

source: All software bundled in the I2P distributions will allow:
fr: Tous les logiciels inclus dans les distributions I2P doivent permettre :

source: use without fee
fr: utilisation sans frais

source: use with no restrictions on how, when, where, why, or by whom is running it
fr: utilisation sans restrictions sur comment, quand, où, pourquoi, ou par qui il est exécuté

source: access to the source code without fee
fr: accès au code source sans frais

source: modifications to the source
fr: modifications du code source

source: Most of the software guarantees much more - the ability of <b>anyone</b> to distribute the modified source however they choose. However, not all of the software bundled provides this freedom - the GPL restricts the ability of developers who wish to integrate I2P with their own applications that are not themselves open source applications. While we applaud the noble goals of increasing the resources in the commons, I2P is best served by removing any barriers that stand in the way of its adoption - if a developer considering whether they can integrate I2P with their application has to stop and check with their lawyer, or conduct a code audit to make sure their own source can be released as GPL-compatible, we lose out.
fr: La plupart du logiciel garantit beaucoup plus - la capacité de <b>n’importe qui</b> de distribuer le source modifié cependant ils choisissent. Cependant, tous les logiciels empaquetés ne fournissent pas cette liberté - le GPL limite la capacité des développeurs qui veulent intégrer I2P avec leurs propres applications qui ne sont pas elles-mêmes des applications open source. Tandis que nous applaudissons aux buts nobles d’augmenter les ressources communes, I2P est mieux servi en enlevant chacune des barrières qui bloquent son adoption - si un développeur considérant si il peut intégrer I2P avec son application doit s’arrêter et vérifier avec son avocat, ou conduire un audit de code pour s’assurer que son propre source peut être sorti comme compatible-GPL, nous sommes perdants.

source: Component licenses
fr: Licences des composants

source: The I2P distribution contains several resources, reflecting the partitioning of the source code into components. Each component has its own license, which all developers who contribute to it agree to - either by explicitly declaring the release of code committed under a license compatible with that component, or by implicitly releasing the code committed under the component's primary license. Each of these components has a lead developer who has the final say as to what license is compatible with the component's primary license, and the I2P project manager has the final say as to what licenses meet the above four guarantees for inclusion in the I2P distribution.
fr: La distribution I2P contient plusieurs ressources, reflétant le partitionnement du code source en composants. Chaque composant a sa propre licence, que chaque développeur qui y contribue a accepté - soit en déclarant explicitement la sortie du code engagé conformément à une licence compatible avec ce composant, ou en sortant implicitement le code engagé conformément à la licence principale du composant. Chacun de ces composants a un développeur principal qui a le dernier mot sur quelle licence est compatible avec la licence principale du composant et le chef de projet I2P a le dernier mot sur quelles licences respectent les quatre susdites garanties pour l’inclusion dans la distribution I2P.

source: Component
fr: Composant

source: Source path
fr: Chemin source

source: Resource
fr: Ressource

source: Primary license
fr: Licence primaire

source: Alternate licenses
fr: Autres licences

source: Lead developer
fr: Développeur principal

source: GPL + java exception
fr: Exception GPL + java

source: While it may be redundant, just for clarity the <a href="%(gpl)s">GPL</a>'ed code included within I2PTunnel and other apps must be released under the GPL with an additional "exception" explicitly authorizing the use of Java's standard libraries:
fr: Bien que cela puisse être superflu, juste pour la clarté le code sous <a href="%(gpl)s">GPL</a> inclus dans I2PTunnel et d’autres applications doit être sorti sous GPL avec une "exception" supplémentaire autorisant explicitement l’utilisation des bibliothèques standard de Java :

source: All source code under each component will by default be licensed under the primary license, unless marked otherwise in the code. All of the above is summary of the license terms - please see the specific license for the component or source code in question for authoritative terms. Component source locations and resource packaging may be changed if the repository is reorganized.
fr: Tout code source de chaque composant sera par défaut sujet à des droits d’auteur conformément à la licence principale, sauf mention contraire dans le code. Le résumé des conditions de licence se trouve ci-dessus. Veuillez consulter la licence particulière du composant ou le code source en question au sujet des conditions faisant autorité. Les emplacements des sources des composants et les paquets peuvent changer si le dépôt est réorganisé.

source: Website content
fr: Contenu du site Web

source: Commit privileges
fr: Privilèges d’engagement

source: Developers may push changes to a distributed monotone repository if you receive permission from the person running that repository. See the <a href="%(monotone)s">Monotone Page</a> for details.
fr: Les développeurs peuvent pousser des changements vers un dépôt Monotone distribué si vous recevez la permission de la personne exécutant ce dépôt. Voyez la <a href="%(monotone)s">page Monotone</a> pour plus de précisions.

source: However, to have changes included in a release, developers must be trusted by the release manager (currently zzz). In addition, they must explicitly agree with the above terms to be trusted. That means that they must send one of the release managers a signed message affirming that:
fr: Cependant, pour que ces changements soient inclus dans une sortie, les développeurs doivent être dignes de confiance du directeur de sortie (actuellement zzz). De plus, ils doivent explicitement être d’accord avec les termes susdits pour être dignes de confiance. Cela signifie qu’ils doivent envoyer à l’un des directeurs de sortie un message signé affirmant que :

source: Unless marked otherwise, all code I commit is implicitly licensed under the component's primary license
fr: Sauf indication contraire, tout le code que j’archive est implicitement sujet à des droits d’auteur conformément à la licence principale du composant

source: If specified in the source, the code may be explicitly licensed under one of the component's alternate licenses
fr: Si cela est indiqué dans la source, le code peut être explicitement couvert par une des autres licences du composant

source: I have the right to release the code I commit under the terms I am committing it
fr: J’ai le droit de sortir le code que je soumets sous les conditions sous lesquels je les soumets

source: If anyone is aware of any instances where the above conditions are not met, please contact the component lead and/or an I2P release manager with further information. <a href="%(licenseagreements)s">See developers' license agreements</a>.
fr: Si quelqu’un connaît des cas qui ne répondent pas aux conditions ci-dessus, veuillez contacter, avec plus de renseignements, le responsable du composant ou un gestionnaire de parutions d’I2P. <a href="%(licenseagreements)s">Voir les licences des développeurs</a>.

source: Release Signing Key
fr: Clé de signature de parution

source: Releases 0.7.6 and later are signed by zzz. His current public key is:
fr: Les versions 0.7.6 et suivantes sont signées par zzz. Sa clé publique actuelle est :

source: Releases from 0.9.9 could be signed by str4d. His current public key is:
fr: Les versions sorties à partir de la 0.9.9 pourraient être signées par str4d. Sa clé publique actuelle est :

source: str4d has signed the following releases:
fr: str4d a signé les versions suivantes :

source: Releases 0.7.6 through 0.9.12 were signed by zzz with the following key:
fr: Les versions 0.7.6 jusqu’à 0.9.12 ont été signées par zzz avec la clé suivante :

source: Releases 0.6.1.31 through 0.7.5 were signed by Complication. His public key is:
fr: Les versions 0.6.1.31 jusqu’à 0.7.5 ont étés signées par Complication. Sa clé publique est :

source: Security GPG Key
fr: Clé GPG de sécurité

source: Following is the GPG key for the security _at_ geti2p.net email address:
fr: Ce qui suit est la clé GPG pour la sécurité de l’adresse électronique _at_ geti2p.net :

source: Signed Developer Keys
fr: Clés de développeur signées

source: Keys for zzz, Complication and welterde are provided clearsigned. The key for jrandom must be verified differently, since he's away, and only left a binary detached signature for his key.
fr: Les clés pour zzz, Complication et welterde sont fournies clearsigned. La clé pour jrandom doit être vérifiée différemment, puisqu’il est loin, et a seulement laissé une signature en fichier binaire détaché pour sa clé.

source: Monotone keys for zzz
fr: Clés Monotone pour zzz

source: Monotone keys for welterde
fr: Clés Monotone pour welterde

source: Monotone keys for Complication
fr: Clés Monotone pour Complication

source: Monotone keys for jrandom
fr: Clés Monotone pour jrandom

source: Others
fr: Autres

source: <u>Tip:</u> To find zzz's GPG key, on his eepsite locate the key `0xA76E0BED`, with the name `zzz@mail.i2p` and the fingerprint `4456 EBBE C805 63FE 57E6 B310 4155 76BA A76E 0BED`.
fr: <u>Astuce :</u> pour trouver la clé GPG de zzz, sur son site eep localisez la clé `0xA76E0BED`, avec le nom `zzz@mail.i2p` et l’empreinte `4456 EBBE C805 63FE 57E6 B310 4155 76BA A76E 0BED`.
