Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: ro

source: Blog Category
ro: Categorie blog

source: I2P Blog ATOM Feed for Category: %(category)s
ro: I2P Blog ATOM Feed pentru Categoria: %(category)s

source: Posted %(date)s by %(author)s
ro: Postat %(date)s de %(author)s

source: More blog posts&hellip;
ro: Mai multe posturi blog&hellip;

source: Posted:
ro: Postat:

source: Author:
ro: Autor:

source: Debian I2P Packages
ro: Pachete I2P pentru Debian

source: Debian Buster, Ubuntu Bionic, and later
ro: Debian Buster, Ubuntu Bionic, Și mai târzii

source: I2P is available in the official repositories for Ubuntu Bionic and later, and Debian Buster and Sid. However, Debian Buster and Ubuntu Bionic (LTS) distributions will have older I2P versions. If you are not running Debian Sid or the latest Ubuntu release, use our Debian repo or Launchpad PPA to ensure you're running the latest I2P version.
ro: I2P este disponibil în depozitele oficiale pentru Ubuntu Bionic și ulterior, și Debian Buster și Sid. Cu toate acestea, distribuțiile Debian Buster și Ubuntu Bionic (LTS) vor avea versiuni mai vechi de I2P. Dacă nu executați Debian Sid sau cea mai recentă versiune Ubuntu, folosiți repo Debian sau PPA Launchpad pentru a vă asigura că executați cea mai recentă versiune I2P.

source: Debian or Ubuntu, All Versions
ro: Debian sau Ubuntu, Toate versiunile

source: The Debian packages should work on most platforms running:
ro: Pachetele Debian ar trebui să funcționeze pe majoritatea platformelor care rulează:

source: <a href="#ubuntu">Ubuntu</a> (Precise <em>12.04</em> and newer)
ro: <a href="#ubuntu">Ubuntu</a> (Mai precis <em>12.04</em> si mai nou)

source: <a href="#debian">Debian Linux</a> (Wheezy and newer)
ro: <a href="#debian">Debian Linux</a> (Wheezy si mai recent)

source: The I2P packages <em>may</em> work on systems not listed above. Please report any issues with these packages on <a href="%(trac)s">Trac</a> at <a href="%(trac)s">https://trac.i2p2.de</a>.
ro: Pachetele I2P <em>pot</em> sa lucreze si pe sisteme ce nu sunt enumerate mai sus.Vă rugăm să raportați orice probleme cu aceste pachete pe<a href="%(trac)s">Trac</a>pe <a href="http://%(trac)s">https://%(trac)s</a>.

source: Option 1: <a href="#ubuntu">Recent versions</a> of Ubuntu and its derivatives (<em>Try this if you're not using Debian)</em>
ro: Opțiune 1:<a href="#ubuntu">Versiuni recente</a> ale Ubuntu și derivațiile lui (<em>Încercați acest pachet de instalare dacă nu utilizați Debian)</em>

source: Option 2: <a href="#debian">Debian</a> (including Debian-derivatives)
ro: Opțiune 2: <a href="#debian">Debian</a> (inclusiv derivații-Debian)

source: Instructions for Ubuntu and derivatives like Linux Mint &amp; Trisquel
ro: Instrucțiuni pentru Ubuntu și distribuții derivate precum Linux Mint & amp; Trisquel

source: Adding the PPA via the command line and installing I2P
ro: Adăugați PPA prin linia de comandă și instalați I2P

source: Open a terminal and enter:
ro: Deschideți un terminal și introduceți:

source: This command will add the PPA to /etc/apt/sources.list.d and fetch the gpg key that the repository has been signed with. The GPG key ensures that the packages have not been tampered with since being built.
ro: Această comandă va adăuga PPA la /etc /apt /sources.list.d și va descărca cheia GPG cu care depozitul pentru pachete I2P a fost semnat . Cheia GPG asigură că pachetele nu au fost falsificate de când au fost construite.

source: Notify your package manager of the new PPA by entering:
ro: Notifică managerul tău de pachete despre noul PPA prin introducerea:

source: This command will retrieve the latest list of software from each repository that is enabled on your system, including the I2P PPA that was added with the earlier command.
ro: Această comandă va prelua cea mai recentă listă a software-ului de la fiecare depozit, care este activat pe sistemul dumneavoastră, inclusiv I2P PPA care a fost adăugat cu comanda anterioară.

source: You are now ready to install I2P!
ro: Acum sunteți gata să instalați I2P!

source: Adding the PPA Using Synaptic
ro: Adăugați PPA folosind Synaptic

source: Open Synaptic (System -&gt; Administration -&gt; Synaptic Package Manager).
ro: Deshideți Synaptic (Sistem -&gt; Administration -&gt; Synaptic Package Manager).

source: Once Synaptic opens, select <em>Repositories</em> from the <em>Settings</em> menu.
ro: După ce se deschide Synaptic, selectați <em> Repositories </em> din meniul <em>Settings </em>.

source: Click the <em>Other Sources</em> tab and click <em>Add</em>. Paste <code>ppa:i2p-maintainers/i2p</code> into the APT-line field and click <em>Add Source</em>. Click the <em>Close</em> button then <em>Reload</em>.
ro: Click pe meniul <em>Alte surse</em> apoi click pe <em>Adăugare</em>. Lipește <code>ppa:i2p-maintainers/i2p</code> în cimpul destinat pentru introducerea APT și click pe<em>Adăugare sursă</em>click pe butonul <em>Închide</em> apoi <em>Reîncărcare</em>.

source: In the Quick Filter box, type in <code>i2p</code> and press enter. When <code>i2p</code> is returned in the results list, right click <code>i2p</code> and select <em>Mark for Installation</em>. After doing so you may see a <em>Mark additional required changes?</em> popup. If so, click <em>Mark</em> then <em>Apply</em>.
ro: În caseta Filtru Rapid, tastați <code>i2p</code> și apăsați enter. Cînd<code>i2p</code> va fi returnat în lista de rezultate, faceți click dreapta pe <code>i2p</code>și selectați<em>Marchează pentru instalare</em>. După ce faceți aceasta este posibil să puteți vedea notificarea cu textul: <em>Marcați modificările suplimentare necesare? </em> Dacă este așa click pe <em>Marchează</em> apoi <em>Aplică</em>.

source: After the installation process completes you can move on to the next part of <a href="#Post-install_work">starting I2P</a> and configuring it for your system.
ro: După ce procesul de instalare se încheie puteți trece la următoarea parte <a href="#Post-install_work">de a porni I2P</a> și să îl configurați pentru sistemul dvs.

source: Instructions for Debian
ro: Instrucțiuni pentru Debian

source: Currently supported architectures
ro: Arhitecturi susținute în prezent

source: Note: The steps below should be performed with root access (i.e., switching user to root with <code>su</code> or by prefixing each command with <code>sudo</code>).
ro: Notă: Pașii de mai jos trebuie efectuați cu acces la root (exemplu: schimbând din utilizator normal în utilizator root folosind comanda <code>su</code> sau prin folosirea comenzii su după utilizarea fiecarei comenzi <code>sudo</code>), exemplu: sudo su .

source: Ensure that <code>apt-transport-https</code> and <code>curl</code> are installed.
ro: Asigurați-vă că <code>apt-transport-https</code> și <code>curl</code>sunt instalate.

source: Check which version of Debian you are using on this page at the <a href="https://wiki.debian.org/LTS/" target="_blank">Debian wiki</a> and verify with <code>%(file2)s</code> on your system. Then, add lines like the following to <code>%(file)s</code>.
ro: Verificați ce versiune a Debian utilizați pe această pagină la <a href="https://wiki.debian.org/LTS/" target="_blank">wiki Debian</a> și verificați cu<code>%(file2)s</code> sistemul dvs. Apoi, adăugați linii precum următoarele<code>%(file)s</code>.

source: Note: If you are running Debian Sid (testing), then you can install I2P directly from Debian's main repository
ro: Notă: Dacă folosiți sistemul de operare Debian Sid (testing), atunci puteți instala I2P direct din depozitul principal al Debian

source: Download <a href="%(repokey)s">the key used to sign the repository</a>:
ro: Descărcați <a href="%(repokey)s">cheia folosită pentru semnarea depozitului de pachete la:</a>:

source: Check the fingerprint and owner of the key without importing anything
ro: Verificați amprenta și proprietarul cheii fără a importa nimic

source: Add the key to APT's keyring
ro: Adăugați cheia la depozitul de chei APT

source: Notify your package manager of the new repository by entering
ro: Notifică managerul tău de pachete despre noul depozit de pachete prin introducerea

source: This command will retrieve the latest list of software from every repository enabled on your system, including the I2P repository added in step 1.
ro: Această comandă va prelua cea mai recentă listă a software-ului de la fiecare depozit, care este activat pe sistemul dumneavoastră, inclusiv depozitul I2P adăugat în pasul 1.

source: You are now ready to install I2P! Installing the <code>i2p-keyring</code> package will ensure that you receive updates to the repository's GPG key.
ro: Acum sunteți gata să instalați I2P! Instalarea pachetului <code> I2P-keyring</code> vă asigura că veți primi actualizări semnate cu cheia GPG a depozitului software.

source: After the installation process completes you can move on to the next part of <a href="#Post-install_work">starting I2P</a> and configuring it for your system.
ro: După ce procesul de instalare se încheie puteți trece la următoarea parte de a <a href="#Post-install_work">porni I2P</a> și de a configura I2P pentru sistemul dvs.

source: Post-install work
ro: Muncă post-instalare

source: Using these I2P packages the I2P router can be started in the following three ways:
ro: Folosind aceste pachete I2P router-ul I2P poate fi pornit în următoarele trei moduri:

source: &quot;on demand&quot; using the i2prouter script. Simply run &quot;<code>i2prouter start</code>&quot; from a command prompt. (Note: Do <strong><u>not</u></strong> use sudo or run it as root!)
ro: &quot;la cerere&quot; folosiți scriptul i2prouter. Porniți simplu &quot;<code>start i2prouter</code>&quot; din promptul de comandă. (Notă: <strong><u>nu</u></strong> folosiți sudo și nu îl rulați ca și utilizator root!)

source: &quot;on demand&quot; without the <a href="http://wrapper.tanukisoftware.com/">java service wrapper</a> (needed on non-Linux/non-x86 systems) by running "<code>i2prouter-nowrapper</code>". (Note: Do <strong><u>not</u></strong> use sudo or run it as root!)
ro: &quot;la cerere&quot; fără <a href="http://wrapper.tanukisoftware.com/">java service wrapper</a> (necesar pe sisteme non-Linux/non-x86 ) prin rularea "<code>i2prouter-nowrapper</code>". (Notă: <strong><u>Nu</u></strong> folositi sudo și nu îl rulați ca și utilizator root!)

source: as a service that automatically runs when your system boots, even before logging in. The service can be enabled with "<code>dpkg-reconfigure i2p</code>" as root or using sudo. This is the recommended means of operation.
ro: ca un serviciu care rulează automat la incărcarea sistemului, chiar înainte de a vă autentifica. Serviciul poate fi activat cu "<code>dpkg-reconfigure I2P</code>"ca root sau utilizînd comanda sudo. Acesta este mijlocul recomandat de funcționare.

source: When installing for the first time, please remember to <b>adjust your NAT/firewall</b> if you can. The ports to forward can be found on the <a href="http://127.0.0.1:7657/confignet"> network configuration page</a> in the router console. If guidance with respect to forwarding ports is needed, you may find <a href="http://portforward.com">portforward.com</a> to be helpful.
ro: Când instalați pentru prima dată, vă rugăm să nu uitați <b>să vă setați NAT-ul/firewall-ul</b> dacă puteți. Porturile pentru inaintare pot fi găsite în<a href="http://127.0.0.1:7657/confignet"> pagina de configurare a rețelei</a>din consola router-ului. Dacă este nevoie de îndrumare în ceea ce privește porturile de forwarding, poate găsiți <a href="http://portforward.com">portforward.com</a> ca fiind folositor.

source: Please review and <b>adjust the bandwidth settings</b> on the <a href="http://127.0.0.1:7657/config.jsp">configuration page</a>, as the default settings of 96 KB/s down / 40 KB/s up are fairly conservative.
ro: Vă rugăm să examinați și să <b>adaptați setările de lățime de bandă</b>la <a href="http://127.0.0.1:7657/config.jsp">pagina de configurare</a> deoarece setările implicite de descărcare de / 96 KB/s descărcare și 40 KB/s de încărcare sunt destul de conservatoare.

source: If you want to reach eepsites via your browser, have a look on the <a href="%(browserconfig)s">browser proxy setup</a> page for an easy howto.
ro: Dacă doriți să încărcați pagini eepsites prin intermediul browser-ului dvs, aruncați o privire pe pagina <a href="%(browserconfig)s">configurare proxy a browser-ului</a> pentru un ghid simplu.

source: An eepsite is a website that is hosted anonymously, a hidden service which is accessible through your web browser. It can be accessed by setting your web browser's HTTP proxy to use the I2P web proxy, port 4444, and browsing to the site.
ro: Un eepsit este un site web găzduit în mod anonim, un serviciu ascuns, accesibil prin browserul dvs. web. Poate fi accesat doar prin setarea proxy-ului HTTP al browserului dvs. de a utiliza proxy-ul I2P, portul 4444 pentru a putea naviga pe eepsite.

source: To make that easy, the Firefox browser profile is pre-configured to work with I2P. While you can use any browser to access I2P sites, using a dedicated browser profile keeps your I2P browsing activity separate from your clearnet activity.
ro: Pentru a facilita acest lucru, profilul browserului Firefox este pre-configurat pentru a funcționa cu I2P. În timp ce puteți utiliza orice browser pentru a accesa site-urile I2P, utilizarea unui profil de browser dedicat menține activitatea de navigare I2P separată de activitatea dvs. de clearnet.

source: This profile also includes the NoScript plugin which protects you from malicious Javascript and the HTTPSEverywhere plugin which enforces SSL encryption where available.
ro: Acest profil include, de asemenea, pluginul NoScript care vă protejează de Javascript-ul rău intenționat și de pluginul HTTPSEverywhere care implementează criptarea SSL acolo unde este disponibil.

source: select alternate mirror
ro: Selectati un mirror alternativ

source: Download that file and run it.
ro: Descărca acest fișier și rulează-l.

source: The files are signed by %(signer)s, <a href="%(signingkey)s">whose key is here</a>.
ro: Aceste fișiere sunt semnate de %(signer)s, <a href="%(signingkey)s">a cărui cheie este aici</a>.

source: I2P Laboratory
ro: Laborator I2P

source: Welcome to the I2P Laboratory! This is the home of various experimental projects that are not yet ready to go live. We invite you to look around and give them a try, but we do not offer support for them. Any of these projects may be discontinued at any time.
ro: Bine ați venit la laboratorul I2P! Aceasta este casa diferitelor proiecte experimentale care încă nu sunt pregătite să fie publicate live. Vă invităm să priviți în jur și să le încercați, dar noi nu vă putem oferi suport pentru ele. Oricare dintre aceste proiecte, poate fi întrerupt în orice moment.

source: We welcome your feedback at the <a href="%(forum)s">I2P Forum</a>.
ro: Așteptăm feedback-ul dvs. la <a href="%(forum)s">Forum I2P</a>.

source: Current Projects
ro: Proiecte curente

source: This is an I2P installer for Windows that does not depend on an existing Java installation. It includes all required dependencies. <p>This installer is built using the Java 9+ utility JLink which bundles a minimum JRE and creates an executable. The source code is in the monotone branch "i2p.jlink". After that an NSIS script is used to create the actual installer. The source code for that script is in the monotone "i2p.wininst" branch.</p> <p>You can report bugs in the <a href="%(forum)s">I2P Lab Forum</a>.</p>
ro: Acesta este un instalator I2P pentru Windows care nu depinde de o instalare Java existentă. Include toate dependențele necesare. <p>Acest program de instalare este construit folosind utilitatea Java 9+ JLink care conține un JRE minim și creează un executabil. Codul sursă se află în ramura monotonă "i2p.jlink". După aceea, un script NSIS este utilizat pentru a crea instalatorul propriu-zis. Codul sursă pentru scriptul respectiv se află în ramura monotonă "i2p.wininst".</p> <p>Puteți raporta erori în <a href="%(forum)s">forumul de laborator I2P</a>.</p>

source: <p>Status: Proof-Of-Concept</p> <p>Known Bugs And Limitations: plugins that use pack200 compression do not work.</p>
ro: <p>Stare: Proof-Of-Concept</p> <p>Bug-uri și limitări cunoscute: plugin-urile care folosesc compresia pack200 nu funcționează.</p>

source: I2P Browser
ro: Browser I2P

source: The Invisible Internet browser is a fork of TorBrowser/Mozilla Firefox ESR that comes preconfigured with proxy settings, NoScript and i2pbutton which contains some security/privacy improvements like a drag and drop filter and external app blocker.
ro: Navigatorul de internet invizibil este un fork a TorBrowser / Mozilla Firefox ESR care este preconfigurată cu setările de proxy, NoScript și i2pbutton care conține câteva îmbunătățiri de securitate / confidențialitate, cum ar fi un filtru drag and drop și un blocant extern de aplicații.

source: Builds for Linux, Windows and Mac OS X are available. Currently we provide binaries for 64bit systems. 32bit builds for Linux and Windows are planned.
ro: Sunt disponibile versiuni pentru Linux, Windows și Mac OS X. În prezent oferim executabili binare pentru sisteme pe 64 de biți. Construcțiile pe 32 de biți pentru Linux și Windows sunt planificate.

source: At this time I2P Browser does not ship with its own I2P router. Ensure that you have I2P installed and running before you launch the I2P Browser.
ro: În acest moment, I2P Browser nu este livrat cu propriul router I2P. Asigurați-vă că aveți instalat și rulat I2P înainte de a lansa browserul I2P.

source: Status: Beta-4 <ul> <li><a href="https://github.com/mikalv/test-i2p-browser">Firefox Branch</a></li> <li><a href="https://github.com/mikalv/i2p-browser-build-scripts">Build Scripts</a></li> <li><a href="https://github.com/mikalv/i2pbutton">Browser Extension</a></li> </ul>
ro: Status: Beta-4 <ul> <li><a href="https://github.com/mikalv/test-i2p-browser">Filiala Firefox</a></li> <li><a href="https://github.com/mikalv/i2p-browser-build-scripts">Build Scripts</a></li> <li><a href="https://github.com/mikalv/i2pbutton">Extensia browserului</a></li> </ul>

source: The default is to download the english version, however it's also built for some other languages, please check out the link below if you want to see if we have the browser in your language.
ro: Valoarea implicită este să descărcați versiunea în limba engleză, dar există si pachete de instalare construite și pentru alte limbi, consultați linkul de mai jos dacă doriți să vedeți, dacă există browserul în limba dvs.

source: This is an I2P Docker image for those that prefers containers. It includes all required dependencies.
ro: Aceasta este o imagine I2P Docker pentru cele care preferă containerele. Include toate dependențele necesare.

source: Run the command to pull from docker hub.
ro: Rulați comanda pentru a trage din docker hub.

source: Download
ro: Descarcă

source: Source package
ro: Pachet sursă

source: Automatic updates
ro: Actualizări automate

source: Manual updates
ro: Actualizări manuale

source: If you would like to try the latest experimental I2P projects, visit the <a href = "%(lab)s">I2P Lab</a>
ro: Dacă doriți să încercați cele mai recente proiecte experimentale I2P, vizitați <a href = "%(lab)s">Laboratorul I2P</a>

source: Dependency
ro: Dependență

source: Java Runtime Version 7 or higher. (<a href="%(java)s">Oracle</a>, <a href="%(openjdk)s">OpenJDK</a>, or <a href="%(icedtea)s">IcedTea</a> Java Version 7 or 8 recommended, except Raspberry Pi: <a href="%(arm8)s">OpenJDK 9 for ARM</a>, PowerPC: <a href="%(ibmsdk7)s">IBM Java SE 7 or 8</a>) <br /> <a href="%(detectjre)s">Determine your installed Java version here</a> or type <tt>java -version</tt> at your command prompt.
ro: Java Runtime versiunea 7 sau mai mare. (<a href="%(java)s">Oracle</a>, <a href="%(openjdk)s">OpenJDK</a>, sau <a href="%(icedtea)s">IcedTea</a> Java Version 7 sau 8 recomandat, exceptand Raspberry Pi: <a href="%(arm8)s">OpenJDK 9 pentru ARM</a>, PowerPC: <a href="%(ibmsdk7)s">IBM Java SE 7 sau 8</a>) <br /> <a href="%(detectjre)s">Pentru a verifica ce versiune de Java aveți instalată click aici </a> sau tastează comanda <tt>java -version</tt> în promptul de comandă a sistemului dvs. .

source: Java 9 support is in development and it is not recommended for general use.
ro: Suportul pentru Java 9 este în curs de dezvoltare și nu este recomandat pentru utilizare generală.

source: Release Notes
ro: Note la lansare

source: Change Log
ro: Modifică Jurnal

source: Debian Change Log
ro: Jurnal Modificări Debian

source: Android Change Log
ro: Jurnal Modificări Android

source: Clean installs
ro: Instalări curate

source: Download that file and double-click it (if that works) or type <code>java -jar i2pinstall_%(i2pversion)s.jar</code> in a terminal to run the installer. You may be able to right-click and select &quot;Open with Java&quot;.
ro: Descărca acest fișier și dă dublu-click pe el (în cazul în care funcționează) sau tapați <code>java -jar i2pinstall_%(i2pversion)s.jar</code>în terminal pentru a porni instalatorul. Ați putea de asemenea să faceți click dreapta și să selectați &quot;Deschide cu Java&quot;.

source: Command line (headless) install:
ro: Instalare prin linia de comandă (headless) :

source: Download the %(i2pversion)s OSX graphical installer file above and run <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> from the command line.
ro: Descarcă %(i2pversion)s fișierul de instalare grafica pentru OSX de mai sus și pornește-l prin comanda<code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> în linia de comandă.

source: A drag-and-drop installer that includes a new I2P Launcher utility. Beta.
ro: Un instalator drag-and-drop, care include un nou utilitar I2P la lansare. Beta.

source: Double-click on the file, then drag and drop the launcher into your Applications folder.
ro: Faceți dublu click pe fișier, apoi trageți și aruncați lansatorul în folderul Aplicații.

source: Download that file and double-click it (if that works) or type <code>java -jar i2pinstall_%(i2pversion)s.jar</code> in a terminal to run the installer. On some platforms you may be able to right-click and select &quot;Open with Java&quot;.
ro: Descărca acest fișier și dă dublu-click pe el (în cazul în care funcționează) sau tapați <code>java -jar i2pinstall_%(i2pversion)s.jar</code>in terminal pentru a porni instalatorul. Ați putea să faceți click dreapta și să selectați &quot;Deschide cu Java&quot;.

source: Download the graphical installer file above and run <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> from the command line.
ro: Descarcă fișierul de instalare grafică de mai sus și pornește-l prin executarea comenzii următoare în linia de comandă <code>java -jar i2pinstall_%(i2pversion)s.jar -console</code> .

source: Packages for Debian &amp; Ubuntu are available.
ro: Sunt disponibile pachete pentru Debian &amp;Ubuntu.

source: Requires Android 4.0 (Ice Cream Sandwich) or higher. If you earlier installed I2P, unfortunately this release fixes some IPC issues which will force you to uninstall your current installation before installing this.
ro: Necesită Android 4.0 (Ice Cream Sandwich) sau o versiune ulterioară. Dacă ați instalat anterior I2P, din păcate, această versiune rezolvă unele probleme IPC care vă vor forța să dezinstalați instalarea curentă înainte de instalarea acesteia.

source: 512 MB RAM minimum; 1 GB recommended.
ro: 512 MB RAM minimum; 1 GB recomandat.

source: The release and dev versions of the I2P APK are not compatible, as they are signed by zzz and meeh respectively. Uninstall one before installing the other.
ro: Versiunile stable și dev ale APK-ului I2P nu sunt compatibile, ele sunt semnate de zzz, respectiv de meeh. Dezinstalați pachetul instalat anterior înainte de a instala pachetul nou.
