Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: ro

source: Alternately, you can fetch the source from <a href="%(monotoneurl)s#getting-the-i2p-code">monotone</a> or via Git from <a href="%(gitrepo)s">git.repo.i2p</a> or <a href="%(github)s">Github</a>. <br /> Run <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> then either run the GUI installer or headless install as above.
ro: Alternativ, puteți descărca sursa din <a href="%(monotoneurl)s#getting-the-i2p-code">monotone</a> sau prin Git din <a href="%(gitrepo)s">git.repo.i2p</a> sau <a href="%(github)s">Github</a>. <br /> Rulați <code>(tar xjvf i2psource_%(i2pversion)s.tar.bz2 ; cd i2p-%(i2pversion)s ; ant pkg)</code> atunci poate rulați programul de instalare GUI sau headless ca mai sus.

source: Android source is in <a href="%(monotoneurl)s#getting-the-i2p-code">monotone</a> and on <a href="%(github)s">Github</a>. Android builds require the I2P source. See the documentation in the Android source for additional build requirements and instructions.
ro: Sursa Android este în <a href="%(monotoneurl)s#getting-the-i2p-code">monotone</a> și pe <a href="%(github)s">Github</a>. Pachetele Android necesită pachetul sursă I2P. Vezi documentația din sursa Android pentru cerințe și instrucțiuni suplimentare legate de împachetare a codului sursă.

source: The Windows installer is signed by %(signer)s, <a href="%(signingkey)s">whose key is here</a>.
ro: Programul de instalare Windows este semnat de %(signer)s, a cărui cheie este <a href="%(signingkey)s">aici</a>.

source: The Mac OS X native installer is signed by %(signer)s with his Apple Developer ID certificate, <a href="%(signingkey)s">whose key is here</a>.
ro: Instalatorul nativ Mac OS X este semnat de %(signer)s cu certificatul său de identitate ca dezvoltator Apple, <a href="%(signingkey)s">a cărui cheie este aici</a>.

source: Updates from earlier releases:
ro: Actualizări de la versiunile anterioare:

source: Both automatic and manual upgrades are available for the release.
ro: Ambele upgrade-uri automatic și manual sunt disponibile pentru lansare.

source: If you are running 0.7.5 or later, your router should detect the new release. To upgrade simply click the 'Download Update' button on your router console when it appears.
ro: Dacă rulezi versiunea 0.7.5 sau versiuni mai noi, router-ul dvs ar trebui să detecteze noua versiune lansată. Pentru a face actualizare la cea mai nouă versiune lansată pur și simplu faceți clic pe butonul "Descarcă Actualizarea" în consola router-ului atunci când aceasta apare.

source: Since 0.9.23, some releases are signed by str4d, whose signing key has been in the router since 0.9.9. Routers older than 0.9.9 will fail to verify update files signed by str4d, and will need to be manually updated using the process below.
ro: Începând cu versiunea 0.9.23, unele lansări sunt semnate de str4d, a cărui cheie de semnare a fost în router încă de la momentul lansării versiunii 0.9.9. Routerele mai vechi decât veriunea 0.9.9 nu vor reuși să verifice fișierele actualizate semnate de str4d, și vor trebui să fie actualizate manual folosind procedeul de mai jos.

source: Download that file to your I2P installation directory and <b>rename as i2pupdate.zip</b>. (alternately, you can get the source as above and run "ant updater", then copy the resulting i2pupdate.zip to your I2P installation directory). You do NOT need to unzip that file.
ro: Descărcați fișierul în I2P directorul de instalare și <b>redenumirea ca i2pupdate.zip</b>. (alternativ, puteți obține sursa de mai sus și puteți rula „ant updater”, apoi copiați rezultând i2pupdate.zip în directorul dvs. de instalare I2P). NU trebuie să dezarhivați fișierul respectiv.

source: Click <a href="http://localhost:7657/configservice.jsp">"Restart"</a>
ro: Click pe <a href="http://localhost:7657/configservice.jsp">"Restart"</a>

source: Grab a cup of coffee and come back in 11 minutes
ro: Puteți servi o ceașcă cu cafea și să reveniți în 11 minute

source: The file is signed by %(signer)s, <a href="%(signingkey)s">whose key is here</a>.
ro: Fișierul este semnată de %(signer)s, <a href="%(signingkey)s">a cărui cheie este aici</a>.

source: Previous Releases
ro: Versiuni Anterioare

source: Previous releases are available on <a href="http://code.google.com/p/i2p/downloads/list?can=1">Google Code</a> and <a href="https://launchpad.net/i2p/trunk">Launchpad</a> and within the I2P network on <a href="http://%(echelon)s/">%(echelon)s</a>.
ro: Versiunile anterioare sunt disponibile <a href="http://code.google.com/p/i2p/downloads/list?can=1"> Google Code</a> și pe <a href="https://launchpad.net/i2p/trunk">Launchpad</a> și în rețeua I2P <a href="http://%(echelon)s/">%(echelon)s</a>.

source: After running the installer on windows, simply click on the "Start I2P" button which will bring up the <a href="http://localhost:7657/index.jsp">router console</a>, which has further instructions.
ro: După rularea instalatorului pe Windows, pur și simplu faceți click pe butonul "Start I2P" care vă va aduce la <a href="http://localhost:7657/index.jsp">router console</a>, unde veți găsi instrucțiuni suplimentare.

source: On Unix-like systems, I2P can be started as a service using the "i2prouter" script, located in the directory you selected for I2P. Changing to that directory in a console and issuing "sh i2prouter status" should tell you the router's status. The arguments "start", "stop" and "restart" control the service. The <a href="http://localhost:7657/index.jsp">router console</a> can be accessed at its usual location. For users on OpenSolaris and other systems for which the wrapper (i2psvc) is not supported, start the router with "sh runplain.sh" instead.
ro: Pe sistemele Unix-like, I2P poate fi pornit ca un serviciu de sistem folosind scriptul "i2prouter", situat în directorul selectat pentru I2P. Schimbați la acest director într-o consolă de comandă și tastați "sh i2prouter status" această comandă ar trebui să vă spună statutul router-ului. Argumentele "start", "stop" și "restart" controlează serviciul. <a href="http://localhost:7657/index.jsp">router console</a> poate fi accesat prin metoda obisnuită. Pentru utilizatorii de OpenSolaris dar și de alte sisteme pentru care nu este suportat wrapper-ul (i2psvc), porniți router-ul prin comanda "sh runplain.sh".

source: When installing for the first time, please remember to <b>adjust your NAT/firewall</b> if you can, bearing in mind the Internet-facing ports I2P uses, <a href="%(faq)s#ports">described here</a> among other ports. If you have successfully opened your port to inbound TCP, also enable inbound TCP on the <a href="http://localhost:7657/confignet.jsp">configuration page</a>.
ro: Când instalați pentru prima dată, vă rugăm să nu uitați să ajustați <b> NAT-ul/ firewall-ul dvs </b> dacă reusiti, ținând cont de porturile Internet pe care le utilizează I2P, <a href="%(faq)s#ports">descris aici</a> printre alte porturi. Dacă ați deschis cu succes portul de intrare TCP, permiteti, de asemenea, TCP de intrare pe <a href="http://localhost:7657/confignet.jsp">pagina de configurare</a>.

source: Also, please review and <b>adjust the bandwidth settings</b> on the <a href="http://localhost:7657/config.jsp">configuration page</a>, as the default settings of 96 KBps down / 40 KBps up are fairly slow.
ro: De asemenea, vă rugăm să examinați și să <b>ajustați setările de lățime de bandă</b>pe <a href="http://localhost:7657/config.jsp">pagina de configurare</a>, deoarece setările implicite de descărcare de 96 KBps / și de încărcare de 40 KBps sunt destul de lente.

source: Downloading...
ro: Se descarcă...

source: Your download will begin shortly. If it doesn't start within 5 seconds, click <a href="%(url)s">here</a>.
ro: Descărcarea dvs va începe în curând. Dacă nu începe în urmatoarele 5 secunde, apăsați click <a href="%(url)s">aici</a>.

source: Mirror selection
ro: Alegere server alternativ

source: File:
ro: Fişier:

source: Any mirror
ro: Orice server alternativ

source: Not found
ro: Nu s-a găsit

source: Yep... the resource, you were searching for, is named differently, doesn't exist or was removed.
ro: Da ... resursa, ai căutat după ea, dar este numită în mod diferit, nu există sau a fost eliminată.

source: Server error
ro: Eroare server

source: 500 Server error
ro: 500 Eroare server

source: Umm... the server encountered some sort of error.
ro: Umm... serverul a întâmpinat un fel de erori.

source: Documentation
ro: Documentație

source: Contact us
ro: Contactează-ne

source: Forums
ro: Forumuri

source: Get involved!
ro: Implicaţi-vă!

source: Donate
ro: Donează

source: Skip navigation
ro: Sări peste navigare

source: I2P Logo
ro: Logo I2P

source: The Invisible Internet Project
ro: Proiectul Internet Invizibil

source: This page was last updated in %(lastupdated)s and is accurate for router version %(accuratefor)s.
ro: Această pagină a fost actualizată ultima dată în %(lastupdated)s și deține informații clare pentru versiunea de router %(accuratefor)s.

source: This page was last updated in %(lastupdated)s.
ro: Această pagină a fost actualizată ultima dată în %(lastupdated)s .

source: This page is accurate for router version %(accuratefor)s.
ro: Această pagină deține informații clare pentru versiunea de router %(accuratefor)s.

source: Previous
ro: Anterior

source: Next
ro: Următorul

source: Posted in
ro: Postat în

source: About
ro: Despre

source: Introduction to I2P
ro: Introducere în I2P

source: Help
ro: Ajutor

source: How to browse I2P
ro: Cum să navighezi în I2P

source: References
ro: Referinţe

source: Glossary
ro: Glosar

source: Performance
ro: Performanță

source: Verify I2P
ro: Verifică I2P

source: Release signing keys
ro: Cheile cu care se semneză versiunile lansate a I2P

source: Signed keys
ro: Chei de semnare

source: Developers keys
ro: Chei de semnare ale dezvoltatorilor

source: Comparisons
ro: Comparații

source: Overview of comparisons
ro: Prezentare generală a comparațiilor

source: Other anonymous networks
ro: Alte rețele anonime

source: People
ro: Oameni

source: Team
ro: Echipa

source: Academic papers and peer review
ro: Lucrări academice și evaluarea partenerilor

source: Presentations, tutorials and articles
ro: Prezentări, tutoriale și articole

source: Links
ro: Linkuri

source: Documentation index
ro: Index documentație

source: How does it work?
ro: Cum funcționează?

source: Gentle intro
ro: Introducere gentilă

source: Tech intro
ro: Introducere tehnologie

source: Threat model
ro: Modelul pericolului

source: Network database
ro: Baza de date a rețelei

source: Tunnel routing
ro: Rutarea tunelurilor

source: Peer selection
ro: Selecția partenerului

source: Cryptography
ro: Criptografie

source: Specifications
ro: Specificații

source: Proposals
ro: Propuneri

source: Streaming library
ro: Biblioteca streaming

source: Datagrams
ro: Datagrame

source: Applications
ro: Aplicații

source: Supported applications
ro: Aplicații acceptate

source: Protocols
ro: Protocoale

source: Protocol stack
ro: Stiva de protocoale

source: Transports
ro: Transporturi

source: Transport layer overview
ro: Prezentare generală a stratului de transport

source: Tunnels
ro: Tuneluri

source: Tunnel implementation
ro: Implementarea tunelului

source: Unidirectional tunnels
ro: Tuneluri unidirecționale

source: Old implementation
ro: Implementare veche

source: Naming and addressbook
ro: Denumire și Agenda

source: Reseed
ro: Redonează

source: Research
ro: Cercetare

source: Academic research
ro: Cercetare academică

source: Open research questions
ro: întrebări de cercetare deschise

source: Develop
ro: Dezvoltă

source: Guides
ro: Ghiduri

source: New developers
ro: Dezvoltatori noi

source: Using an IDE with I2P
ro: Folosiți un IDE cu I2P

source: Developer guidelines and coding style
ro: Ghidul dezvoltatorului și stilul de programare

source: New translators
ro: Traducători noi

source: License
ro: Licenţă

source: Licenses
ro: Licențe

source: Task list
ro: Listă de sarcini

source: Language
ro: Limba

source: Logs of past I2P meetings
ro: Jurnalele întâlnirilor I2P trecute

source: I2P Meetings ATOM Feed
ro: Alimentare ATOM pentru întalnirile I2P

source: Regularly scheduled project meetings are held on the first Tuesday of every month at 8 PM UTC. Anyone can schedule and run a meeting, by posting the agenda in <a href="%(mtgforum)s">the meetings forum</a>.
ro: Întâlnirile de proiect sunt programate în mod regulat și sunt organizate în prima zi de marți a fiecărei luni la ora 8 pm UTC. Oricine se poate programa și susține o întalnire, prin afișarea pe ordinea de zi în <a href="%(mtgforum)s">forumul de întalniri</a>.

source: If you have something to discuss, please find the developers on IRC in #i2p-dev. <a href="%(blogindex)s">Status updates</a> from developers are also available.
ro: Dacă aveți ceva de discutat, vă rugăm să căutați dezvoltatorii pe canalul IRC în #i2p-dev. <a href="%(blogindex)s">Actualizări de stare</a> de la dezvoltatori sunt deasemenea disponibile.

source: I2P Development Meeting %(id)s
ro: Întilnirea de dezvoltare a I2P %(id)s

source: Full IRC Log
ro: Jurnal IRC complet

source: By topic
ro: După subiect

source: By date
ro: După dată

source: By author
ro: După autor

source: Please send new or corrected entries to <a name="contact"><span class="email">%(email)s</span></a>.<br /> If you can, please format them as BibTeX; see our <a href="%(bibtex)s">BibTeX source page</a> for examples.<br /> Remember to include URLs if possible: <a href="%(citeseer)s">offline papers are less useful</a>.
ro: Vă rugăm să trimiteți intrări noi sau corectate la <a name="contact"><span class="email">%(email)s</span></a>.<br /> Dacă se poate, vă rugăm să le formatați ca BibTeX; vezi <a href="%(bibtex)s">Pagina sursă BibTeX</a> pentru exemple.<br /> Nu uitați să includeți URL-uri, dacă este posibil: <a href="%(citeseer)s">lucrările offline, sunt mai puțin utile</a>.

source: The source code for this page was adapted from <a href="%(anonbib)s">Free Haven's anonymity bibliography</a>.
ro: Codul sursă pentru această pagină a fost adaptat de pe <a href="%(anonbib)s">Free Haven's anonymity bibliography</a>.

source: Please do not use these email addresses for support requests. These are not public email lists. We do not provide help via email.
ro: Vă rugăm să nu folosiți aceste adrese de e-mail pentru solicitări de suport. Acestea nu sunt listele publice de e-mail. Nu furnizăm suport via email.

source: Our primary IRC network is the Irc2P network within I2P; a default tunnel to this network is set up with new router installs. We are also present on multiple standard networks like <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a> and <a href="http://freenode.net/">Freenode</a>. All I2P-related channels on all these network are linked to the main channels on Irc2P via relay bots.
ro: Rețeaua noastră principala de IRC este rețeaua Irc2P în I2P; un tunel implicit pentru această rețea este configurat automat cu instalarea router-ului. Suntem, de asemenea, prezenți în mai multe rețele standard, cum ar fi <a href="http://www.oftc.net/oftc/OFTC">OFTC</a>, <a href="http://www.einirc.de/">EIN</a>și <a href="http://freenode.net/">Freenode</a>. Toate canalele legate de I2P cu privire la toate aceste rețele sunt legate de principalele canale pe Irc2P prin intermediul roboțiilor releu.

source: Channel list:
ro: Listă de canale:

source: General i2p discussion and help channel
ro: Discuții generale I2P și canal de ajutor.

source: Development talk
ro: Discuții despre dezvoltare

source: Purple I2P (I2Pd) Development talk
ro: Purple 12P (I2Pd) Discuții despre dezvoltare

source: Abscond browser bundle discussion and development
ro: Abscond browser bundle discuții și dezvoltare

source: Please visit our I2P user forum, which is frequented by developers/contributors too -
ro: Vă rugăm să vizitați forumul nostru de utilizatori I2P, care este frecventat și de dezvoltatori / colaboratori -

source: available on clearnet at https://i2pforum.net and on I2P at http://i2pforum.i2p
ro: disponibil pe clearnet la https://i2pforum.net și pe I2P la http://i2pforum.i2p

source: Most of the discussion about I2P's development happens on the <a href="http://%(zzz)s">I2P developer forum</a> (only reachable from within I2P network). This is usually the best place to start with inquiries, if the dev IRC channel is inactive.
ro: Cea mai mare parte a discuțiilor despre dezvoltarea I2P are loc pe <a href="http://%(zzz)s">forumul dezvoltatorilor I2P</a> (accesibil doar din rețeaua I2P). Acesta este de obicei cel mai bun loc pentru a începe anchetele, dacă canalul IRC dev este inactiv.

source: Subscribing
ro: Abonează

source: To subscribe to a mailing list, go to the list information page (linked below) and fill out the form. I2P-internal email addresses (foobar@mail.i2p) can be used.
ro: Pentru a vă abona la o listă de corespondență, mergeți la pagina de lista informații (legate mai jos) și completați formularul. Pot fi utilizate adrese de e-mail I2P-interne (foobar@mail.i2p) .

source: Unsubscribing
ro: Dezabonează

source: To unsubscribe from a mailing list or edit your subscription options, go to the list information page (linked below) and enter your subscription email address.
ro: Pentru a vă dezabona de la o listă de corespondență sau de a modifica opțiunile de abonament, mergi la pagina de listă informații (legate mai jos) și introduceți adresa dumneavoastră de abonare.

source: Lists
ro: Liste

source: Archive
ro: Arhivă

source: I2P developer discussions - anything related to development of I2P
ro: Discuțiile dezvoltatorilor I2P - orice legat de dezvoltarea lui I2P

source: General I2P discussion - anything that doesn't fit in a different list goes here
ro: Discuții generale I2P - orice nu intra într-o altă lista merge aici

source: Frequently Asked Questions
ro: Întrebări frecvente

source: What systems will I2P run on?
ro: Pe ce sisteme va rula I2P?

source: Is installing Java required to use I2P?
ro: Instalarea Java este necesară pentru utilizarea I2P?

source: Whats an "eepsite" and how do I configure my browser so I can use them?
ro: Ce este un "eepsite" și cum pot configura browser-ul meu, pentru ca să-l pot folosi?

source: What do the Active x/y numbers mean in the router console?
ro: Ce înseamnă în consola router numerele active x/y ?

source: Is my router an "exit node"(outproxy) to the regular Internet? I don't want it to be.
ro: Este oare router-ul meu un "nod de ieșire" (outproxy) la Internet obișnuit? Nu vreau să fie.

source: I see IP addresses of all other I2P nodes in the router console. Does that mean my IP address is visible by others?
ro: Văd adrese IP ale tuturor celorlalte noduri I2P în consola routerului. Asta înseamnă că adresa mea IP este vizibilă de alții?

source: I can't access regular Internet sites through I2P.
ro: Nu pot accesa site-uri obișnuite din internet prin I2P.

source: Is using an outproxy safe?
ro: Folosirea unui outproxy este sigură?

source: I am opposed to certain types of content. How do I keep from distributing, storing, or accessing them?
ro: Mă opun la anumite tipuri de conținut. Cum pot evita distribuirea, stocarea, și accesarea lor?

source: Getting Started
ro: Noțiuni de bază

source: How do I configure my browser?
ro: Cum pot configura browser-ul meu?

source: How do I connect to IRC within I2P?
ro: Cum mă pot conecta la IRC în I2P?

source: How do I set up my own eepsite?
ro: Cum pot configura propriul meu eepsite?

source: What ports does I2P use?
ro: Ce porturi folosește I2P?

source: I'm missing lots of hosts in my addressbook. What are some good subscription links?
ro: Îmi lipsește o mulțime de hosturi în Agenda mea. Care sunt link-urile bune de abonament?

source: How can I access the web console from my other machines or password protect it?
ro: Cum pot accesa consola web de la alte mașini sau a o proteja prin parola

source: How can I use applications from my other machines?
ro: Cum pot utiliza aplicații de la alte calculatoare?

source: Is it possible to use I2P as a SOCKS proxy?
ro: Este posibil să utilizez I2P ca un proxy SOCKS?

source: How do I reseed manually?
ro: Cum pot să fac reseed manual?

source: How do I access IRC, BitTorrent, or other services on the regular Internet?
ro: Cum pot accesa IRC, BitTorrent, sau alte servicii de pe Internetul obișnuit?

source: I can't access https:// or ftp:// sites through I2P.
ro: Nu pot accesa site-uri https:// sau ftp:// prin I2P.

source: Troubleshooting
ro: Depanare

source: My router is using too much CPU?!?
ro: Router-ul meu utilizează prea mult CPU?!?

source: My router has been up for several minutes and has zero or very few connections
ro: Router-ul meu a fost pornit pentru câteva minute și are conexiuni zero sau foarte puține

source: My router has very few active peers, is this OK?
ro: Router-ul meu are foarte puțini parteneri activi, este asta bine?

source: My active peers / known peers / participating tunnels / connections / bandwidth vary dramatically over time! Is anything wrong?
ro: Partenerii mei activi / Partenerii cunoscuți / Tunele la care particip / Conexiuni / lățimea de bandă variază peste timp! Este ceva în neregulă?

source: What makes downloads, torrents, web browsing, and everything else slower on I2P as compared to the regular internet?
ro: Ce face descărcările, torentele, navigarea web și orice altceva mai lent pe I2P în comparație cu internetul obișnuit?

source: In <code>wrapper.log</code> I see an error stating <code>Protocol family unavailable</code> when I2P is loading
ro: În <code>wrapper.log</code> văd o eroare <code>Protocol family unavailable</code> când se încarcă I2P

source: Most of the eepsites within I2P are down?
ro: Cele mai multe dintre eepsites în I2P nu sunt disponibile?

source: Why is I2P listening for connections on port 32000?
ro: De ce I2P ascultă pentru conexiuni pe portul 32000?

source: I think I found a bug, where can I report it?
ro: Cred că am găsit un bug, unde îl pot raporta?

source: I have a question!
ro: Am o intrebare!

source: I2P is written in the <a href="%(java)s">Java programming language</a>. It has been tested on Windows, Linux, FreeBSD and OSX. An <a href="%(android)s">Android port</a> is also available.
ro: I2P este scris în <a href="%(java)s">limbajul de programare Java</a>. A fost testat pe Windows, Linux, FreeBSD și OSX. Un <a href="%(android)s">port Android</a> este de asemenea disponibil.

source: In terms of memory usage, I2P is configured to use 128 MB of RAM by default. This is sufficient for browsing and IRC usage. However, other activities may require greater memory allocation. For example, if one wishes to run a high-bandwidth router, participate in I2P torrents or serve high-traffic hidden services, a higher amount of memory is required.
ro: În ceea ce privește utilizarea memoriei, I2P este configurat pentru a utiliza 128 MB RAM în mod implicit. Acest lucru este suficient pentru navigare și utilizarea IRC. Cu toate acestea, alte activități pot necesita o alocare mai mare a memoriei. De exemplu, dacă doriți să rulați un router cu lățime mare de bandă, participați la torrente I2P sau serviți servicii ascunse de trafic mare, este necesară o cantitate mai mare de memorie.
