Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: ro

source: Participating tunnels
ro: Tunele participante

source: If your native jbigi library is working fine, the biggest user of CPU may be routing traffic for participating tunnels. This uses CPU because at each hop a layer of encryption must be decoded. You can limit participating traffic in two ways - by reducing the share bandwidth on the <a href="http://localhost:7657/confignet.jsp">confignet</a> page, or by setting <tt>router.maxParticipatingTunnels=nnn</tt> on the <a href="http://localhost:7657/configadvanced.jsp">configadvanced</a> page.
ro: Dacă biblioteca ta jbigi nativă funcționează bine, cel mai mare utilizator al procesorului poate dirija traficul pentru tunelurile participante. Aceasta folosește procesorul, deoarece la fiecare hop, trebuie să fie decodat un strat de criptare. Puteți limita traficul participant în două moduri - prin reducerea lățimii de bandă a partajării pe pagina <a href="http://localhost:7657/confignet.jsp">confignet</a>, sau setând <tt>router.maxParticipatingTunnels = nnn</tt> pe pagina <a href="http://localhost:7657/configadvanced.jsp">configurării avansate</a>.

source: New installations of I2P carry out the reseeding process automatically, as well as when the number of known peers falls to a drastically low value. If you need to carry out a reseed of your router, please see the <a href="#manual_reseed">reseed instructions</a>.
ro: Noile instalații ale I2P desfășoară automat procesul de reseed, precum și atunci când numărul de colegi cunoscuți scade la o valoare drastic scăzută. Dacă aveți nevoie pentru a efectua o reseed a routerului dvs., consultați <a href="#manual_reseed">instrucțiunile analizate</a>.

source: If your router has 10 or more active peers, everything is fine. The router should maintain connections to a few peers at all times. The best way to stay "better-connected" to the network is to share more bandwidth. The amount of bandwidth that is shared by the router can be changed on the configuration page: <a href="http://localhost:7657/config">http://localhost:7657/config</a>
ro: Dacă routerul dvs. are 10 sau mai mulți colegi activi, totul este în regulă. Routerul trebuie să mențină conexiunile la câțiva colegi în orice moment. Cel mai bun mod de a rămâne „mai bine conectat” la rețea este de a partaja mai multă lățime de bandă. Cantitatea de lățime de bandă care este partajată de router poate fi modificată pe pagina de configurare: <a href="http://localhost:7657/config">http://localhost:7657/config</a>

source: No, there isn't anything wrong. This is normal behavior. All routers adjust dynamically to changing network conditions and demands. Routers come online and go offline depending on whether the system it is installed on is operational or not, as well as whether there is an available network connection. Your router is constantly updating its local Network Database. Tunnels which your router is participating in expire every 10 minutes and may or may not be rebuilt through your router.
ro: Nu, nu este nimic rău. Acesta este un comportament normal. Toate routerele se adaptează dinamic la schimbarea condițiilor și cerințelor rețelei. Routerele vin online și deconectează în funcție de dacă sistemul pe care este instalat este funcțional sau nu, precum și dacă există o conexiune de rețea disponibilă. Routerul dvs. își actualizează constant baza de date de rețea locală. Tunelurile la care routerul participă expiră la fiecare 10 minute și pot fi sau nu reconstruite prin intermediul routerului.

source: The encryption and routing within the I2P network adds a substantial amount of overhead and limits bandwidth. We can try to clarify this with the aid of a diagram:
ro: Criptarea și rutarea în rețeaua I2P adaugă o cantitate substanțială de aer și limitează lățimea de bandă. Putem încerca să clarificăm acest lucru cu ajutorul unei diagrame:

source: In this diagram, the path that some I2P traffic takes as it travels through the network is traced. A user's I2P router is denoted by the box labeled 'A' and an I2P Hidden Service (for example, the http://stats.i2p website) is labelled as 'B'. Both the client and the server are using 3-hop tunnels, these hops are represented by the boxes labelled 'P', 'Q', 'R', 'X', 'Y', 'Z', 'P_1', 'Q_1', 'R'_1, 'X_1', 'Y_1' and 'Z_1'.
ro: În această diagramă, calea pe care o ia o parte din traficul I2P pe măsură ce circulă prin rețea este urmărită. Routerul I2P al unui utilizator este notat de căsuța etichetată „A” și un serviciu ascuns I2P (de exemplu, site-ul http://stats.i2p) este etichetat drept „B”. Atât clientul cât și serverul folosesc tuneluri 3 hop, aceste hamei sunt reprezentate de casetele etichetate „P”, „Q”, „R”, „X”, „Y”, „Z”, „P_1”, ” Q_1 ',' R'_1, 'X_1', 'Y_1' și 'Z_1'.

source: The boxes labelled 'P', 'Q' and 'R' represent an outbound tunnel for A while the boxes labelled 'X_1', 'Y_1', 'Z_1' represent an outbound tunnel for 'B'. Similarly, the boxes labelled 'X', 'Y' and 'Z' represent and inbound tunnel for 'B' while the boxes labelled 'P_1', 'Q_1' and 'R_1' represent an inbound tunnel for 'A'. The arrows in between the boxes show the direction of traffic. The text above and below the arrows detail some example bandwidth between a pair of hops as well as example latencies.
ro: Casetele etichetate „P”, „Q” și „R” reprezintă un tunel de ieșire pentru A în timp ce casetele etichetate „X_1”, „Y_1”, „Z_1” reprezintă un tunel de ieșire pentru „B”. În mod similar, casetele etichetate „X”, „Y” și „Z” reprezintă și tunelul de intrare pentru „B”, în timp ce casetele etichetate „P_1”, „Q_1” și „R_1” reprezintă un tunel de intrare pentru „A”. Săgețile dintre căsuțe indică direcția de circulație. Textul de deasupra și de sub săgeți detaliază o lățime de bandă de exemplu între o pereche de salturi, precum și latențe de exemplu.

source: When both client and server are using 3-hop tunnels throughout, a total of 12 other I2P routers are involved in relaying traffic. 6 peers relay traffic from the client to the server which is split into a 3-hop outbound tunnel from 'A' ('P', 'Q', 'R') and a 3-hop inbound tunnel to 'B' ('X', 'Y', 'Z'). Similarly, 6 peers relay traffic from the server to back to the client.
ro: Când atât clientul cât și serverul folosesc tuneluri 3 hop în întreaga perioadă, un număr total de 12 alte routere I2P sunt implicate în transmisia traficului. 6 colegi transmit traficul de la client la server, care este împărțit într-un tunel de ieșire cu 3 hop din „A” („P”, „Q”, „R”) și un tunel de intrare în 3 hop la „B” („ X ',' Y ',' Z '). În mod similar, 6 colegi transmit traficul de pe server pentru a-l înapoia clientului.

source: First, we can consider latency - the time that it takes for a request from a client to traverse the I2P network, reach the the server and traverse back to the client. Adding up all latencies we see that:
ro: În primul rând, putem lua în considerare latența - timpul necesar unei solicitări de la un client pentru a traversa rețeaua I2P, a ajunge la server și a traversa înapoi către client. Adăugând toate latențele, vedem că:

source: The total round-trip time in our example adds up to 740 ms - certainly much higher than what one would normally see while browsing regular internet websites.
ro: Timpul total dus-întors din exemplul nostru se ridică la 740 ms - cu siguranță mult mai mare decât ceea ce se vedea în mod normal în timp ce navighezi pe site-urile de internet obișnuite.

source: Second, we can consider available bandwidth. This is determined through the slowest link between hops from the client and server as well as when traffic is being transmitted by the server to the client. For traffic going from the client to the server, we see that the available bandwidth in our example between hops 'R' &amp; 'X' as well as hops 'X' &amp; 'Y' is 32 KB/s. Despite higher available bandwidth between the other hops, these hops will act as a bottleneck and will limit the maximum available bandwidth for traffic from 'A' to 'B' at 32 KB/s. Similarly, tracing the path from server to client shows that there is maximum bandwidth of 64 KB/s - between hops 'Z_1' &amp; 'Y_1, 'Y_1' &amp; 'X_1' and 'Q_1' &amp; 'P_1'.
ro: În al doilea rând, putem lua în considerare lățimea de bandă disponibilă. Acest lucru este determinat prin legătura cea mai lentă între saltul de la client și server, precum și când traficul este transmis de server către client. Pentru traficul care merge de la client la server, vedem că lățimea de bandă disponibilă în exemplul nostru între saltul „R” și „X”, precum și saltul „X” și „Y” este de 32 KB / s. În ciuda lățimii de bandă disponibile mai mare între celelalte hamei, aceste hamei vor acționa ca un blocaj și vor limita lățimea maximă de bandă disponibilă pentru traficul de la „A” la „B” la 32 KB / s. În mod similar, urmărirea traseului de la server la client arată că există o lățime de bandă maximă de 64 KB / s - între hamei „Z_1” și „Y_1,„ Y_1 ”și„ X_1 ”și„ Q_1 ”și„ P_1 ”.

source: We recommend increasing your bandwidth limits. This helps the network by increasing the amount of available bandwidth which will in turn improve your I2P experience. Bandwidth settings are located on the <a href="http://localhost:7657/config">http://localhost:7657/config</a> page. Please be aware of your internet connection's limits as determined by your ISP, and adjust your settings accordingly.
ro: Vă recomandăm să vă măriți limitele de lățime de bandă. Acest lucru ajută rețeaua prin creșterea numărului de lățime de bandă disponibilă, care la rândul său va îmbunătăți experiența dvs. I2P. Setările pentru lățimea de bandă sunt localizate pe pagina <a href="http://localhost:7657/config">http://localhost:7657/config</a>. Vă rugăm să fiți conștienți de limitele conexiunii dvs. de internet, așa cum sunt stabilite de ISP-ul dvs. și reglați-vă setările în consecință.

source: We also recommend setting a sufficient amount of shared bandwidth - this allows for participating tunnels to be routed through your I2P router. Allowing participating traffic keeps your router well-integrated in the network and improves your transfer speeds.
ro: De asemenea, vă recomandăm să setați o cantitate suficientă de lățime de bandă partajată - acest lucru permite ca tunelurile participante să fie direcționate prin routerul dvs. I2P. Permiterea traficului participant menține routerul bine integrat în rețea și îmbunătățește viteza de transfer.

source: I2P is a work in progress. Lots of improvements and fixes are being implemented, and, generally speaking, running the latest release will help your performance. If you haven't, <a href="%(downloadslist)s">install the latest release</a>.
ro: I2P este o lucrare în derulare. Sunt implementate o mulțime de îmbunătățiri și corecții și, în general, executarea celei mai recente versiuni vă va ajuta performanța. Dacă nu aveți, <a href="%(downloadslist)s">instalați cea mai recentă versiune</a>.

source: In <code>wrapper.log</code> I see an error that states "<code>Protocol family unavailable</code>" when loading the Router Console
ro: În <code> wrapper.log </code> văd o eroare <code> Protocol family unavailable </code> când se încarcă Consola router

source: Often this error will occur with any network enabled java software on some systems that are configured to use IPv6 by default. There are a few ways to solve this:
ro: Adesea, această eroare va avea loc cu orice software java cu rețea activata pe unele sisteme care sunt configurate pentru a utiliza IPv6 în mod implicit. Există câteva moduri de a rezolva acest lucru:

source: On Linux based systems, you can <code>echo 0 > /proc/sys/net/ipv6/bindv6only</code>
ro: Pe sistemele bazate pe Linux, puteți <code> echo 0> / proc/sys/net/ipv6/bindv6only </code>

source: Look for the following lines in <code>wrapper.config</code>.
ro: Uita-te la următoarele linii în <code> wrapper.config </code>.

source: If the lines are there, uncomment them by removing the "#"s. If the lines are not there, add them without the "#"s.
ro: În cazul în care liniile sunt acolo, le decomentați prin eliminarea "#". În cazul în care liniile nu sunt acolo, adăugați-le fără "#".

source: Another option would be to remove the <strong>::1</strong> from <code>~/.i2p/clients.config</code>
ro: O altă opțiune ar fi pentru a elimina <strong>::1</strong> de la <code> ~ /.i2p/clients.config </code>

source: <strong>WARNING</strong>: For any changes to <code>wrapper.config</code> to take effect, you must completely stop the router and the wrapper. Clicking <em>Restart</em> on your router console will NOT reread this file! You must click <em>Shutdown</em>, wait 11 minutes, then start I2P.
ro: <strong> AVERTISMENT </strong>: Pentru orice modificare a <code> wrapper.config </code> să aibă efect, trebuie să opriți complet router-ul și ambalajul. Clic <em> Restart </em> pe consola ta router-ul nu va reciti acest fisier! Trebuie să faceți clic <em> Shutdown </em>, si sa asteaptati 11 minute, apoi porniti I2P.

source: If you consider every eepsite that has ever been created, yes, most of them are down. People and eepsites come and go. A good way to get started in I2P is check out a list of eepsites that are currently up. <a href="%(eepstatus)s">%(eepstatus)s</a> tracks active eepsites.
ro: Dacă luați în considerare fiecare eepsite care a fost vreodată creat, da, cele mai multe dintre ele sunt inaccesibile. Oamenii și eepsites vin și pleacă. O modalitate buna de a începe în I2P este să verificați o listă de eepsites care sunt în prezent accesibile. <a href="%(eepstatus)s">%(eepstatus)s</a> eepsite-uri active.

source: Why is I2P listening on port 32000?
ro: De ce I2P asculta pe portul 32000?

source: The Tanuki java service wrapper that we use opens this port &mdash;bound to localhost&mdash; in order to communicate with software running inside the JVM. When the JVM is launched it is given a key so it can connect to the wrapper. After the JVM establishes its connection to the wrapper, the wrapper refuses any additional connections.
ro: Învelișul serviciului Java Tanuki pe care îl utilizăm deschide acest port - legat de localhost - pentru a comunica cu software-ul care rulează în JVM. Când JVM este lansat, i se oferă o cheie, astfel încât să se poată conecta la înveliș. După ce JVM își stabilește conexiunea cu ambalajul, învelișul refuză conexiunile suplimentare.

source: More information can be found in the <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper documentation</a>.
ro: Mai multe informații pot fi găsite în <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentația învelișului</a>.

source: You may report any bugs/issues that you encounter on our bugtracker, which is available over both clearnet and I2P. We have a discussion forum, also available on I2P and clearnet. You can join our IRC channel as well: either through our IRC network, IRC2P, or on Freenode.
ro: Puteți raporta eventualele erori / probleme pe care le întâmpinați pe tracktracker-ul nostru, care este disponibil atât pentru clauzet cât și pentru I2P. Avem un forum de discuții, disponibil și pe I2P și clararnet. Vă puteți alătura și canalului nostru IRC: fie prin intermediul rețelei noastre IRC, IRC2P, fie pe Freenode.

source: Our Bugtracker:
ro: Bugtracker-ul nostru:

source: On I2P:
ro: Pe I2P:

source: Our forums:
ro: Forumurile noastre:

source: You may paste any interesting logs to a paste service such as the clearnet services listed on the <a href="https://github.com/PrivateBin/PrivateBin/wiki/PrivateBin-Directory">PrivateBin Wiki</a>, or an I2P paste service such as this <a href="http://paste.crypthost.i2p">PrivateBin instance</a> or this <a href="http://pasta-nojs.i2p">Javascript-free paste service</a> and follow up on IRC in #i2p<
ro: Puteți lipa orice jurnal interesant într-un serviciu de inserare, cum ar fi serviciile de clarificare enumerate în <a href="https://github.com/PrivateBin/PrivateBin/wiki/PrivateBin-Directory">Wiki PrivateBin</a> sau un serviciu de paste I2P, cum ar fi acesta <a href="http://paste.crypthost.i2p">Instanță PrivateBin</a> sau aceasta <a href="http://pasta-nojs.i2p">Serviciu de paste fără Javascript și urmărire IRC în # i2p <

source: Join #i2p-dev Discuss with the developers on IRC
ro: Alăturați-vă #i2p-dev Discutați cu dezvoltatorii de la IRC

source: Please include relevant information from the router logs page which is available at: <a href="http://127.0.0.1:7657/logs">http://127.0.0.1:7657/logs</a>. We request that you share all of the text under the 'I2P Version and Running Environment' section as well as any errors or warnings displayed in the various logs displayed on the page.
ro: Vă rugăm să includeți informații relevante din pagina jurnalelor de router, care sunt disponibile la: <a href="http://127.0.0.1:7657/logs">http://127.0.0.1:7657/logs</a>. Vă rugăm să partajați tot textul în secțiunea „Versiunea I2P și mediul de rulare” , precum și orice erori sau avertismente afișate în diferitele jurnale afișate pe pagină.

source: Great! Find us on IRC: <ul> <li>on <code>irc.freenode.net</code> channel <code>#i2p</code></li> <li>on <code>IRC2P</code> channel <code>#i2p</code></li> </ul> or post to <a href="http://%(forum)s/">the forum</a> and we'll post it here (with the answer, hopefully).
ro: Grozav! Ne găsiți pe IRC: <ul> <li>pe canalul <code>irc.freenode.net</code> <code>#i2p</code></li> <li>pe canalul <code>IRC2P</code> <code>#i2p</code></li> </ul> sau postează <a href="http://%(forum)s/">pe forum</a> și îl vom posta aici (cu răspunsul, sperăm).

source: German laws
ro: legile germane

source: I2P Anonymous Network
ro: I2P rețea anonima

source: Anonymous peer-to-peer distributed communication layer built with open source tools and designed to run any traditional Internet service such as email, IRC or web hosting.
ro: Strat anonim de comunicare peer-to-peer distribuit construit cu instrumente open source și proiectat pentru a rula orice serviciu tradițional de Internet, cum ar fi e-mail, IRC sau web hosting.

source: What does I2P do for you?
ro: Ce face I2P pentru tine?

source: The I2P network provides strong privacy protections for communication over the Internet. Many activities that would risk your privacy on the public Internet can be conducted anonymously inside I2P.
ro: Rețeaua I2P oferă protecții de confidențialitate puternice pentru comunicare prin Internet. Multe activități care ți-ar risca confidențialitatea pe internetul public poate fi realizată anonim în interiorul I2P.

source: Get I2P %(version)s
ro: Ia I2P %(version)s

source: What is I2P?
ro: Ce este I2P?

source: Aside from anonymizing traffic within the network, I2P functions with the same capabilities as the Internet, however its design and decentralization create a censorship resistant environment for the free-flow of information.
ro: Pe lângă anonimizarea traficului în rețea, I2P funcționează cu aceleași capacități ca Internetul, cu toate acestea design-ul său și descentralizarea creează un mediu rezistent la cenzură flux liber de informații.

source: Mirrored sites hosted on the network allow access to news outlets and other resources in areas where information is being filtered or denied. Online communities wishing to organize in restrictive environments can do so anonymously to mitigate political threat and protect each other.
ro: Site-urile oglindite găzduite în rețea permit accesul la știri puncte de desfacere și alte resurse din zonele în care informațiile sunt filtrate sau negat. Comunitățile online care doresc să se organizeze mediile restrictive pot face acest lucru anonim pentru a atenua politicile amenintați-vă și protejați-vă reciproc.

source: Read more&hellip;
ro: Citește mai mult&hellip;

source: News &amp; Updates
ro: Noutăți &amp; Actualizări

source: Conferences Calendar 2019
ro: Calendar conferințe 2019

source: Recommended Links & Resources
ro: Link-uri & Resurse recomandate

source: See also the page with <a href="%(media)s">links to presentations, videos, and tutorials about I2P</a>.
ro: A se vedea, de asemenea, pagina cu link-uri <a href="%(media)s"> la prezentari, clipuri video, și tutoriale despre I2P </a>.

source: I2P on the web
ro: I2P pe web

source: Friends of I2P
ro: Prietenii I2P

source: More Projects and Documentation
ro: Mai multe proiecte și Documentatie

source: Press
ro: Apasă

source: Boards, newssite, others
ro: Panouri, saituri cu noutati, altele

source: Very Old Stuff
ro: Chestii foarte vechi
