Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: ro

source: In terms of CPU usage, I2P has been tested to run on modest systems such as the <a href="%(rpi)s">Raspberry Pi</a> range of single-board computers. As I2P makes heavy use of cryptographic techniques, a stronger CPU will be better suited to handle the workload generated by I2P as well as tasks related to the rest of the system (i.e. Operating System, GUI, Other processes e.g. Web Browsing).
ro: În ceea ce privește utilizarea procesorului, I2P a fost testat pentru a rula pe sisteme modeste, cum ar fi gama <a href="%(rpi)s">Raspberry Pi</a> a calculatoarelor cu o singură placă. Deoarece I2P utilizează intens tehnicile criptografice, un procesor mai puternic va fi mai potrivit pentru a gestiona volumul de lucru generat de I2P, precum și sarcinile. în legătură cu restul sistemului (adică Sistem de operare, GUI, Alte procese, de ex. Navigare Web).

source: A comparison of some of the available Java Runtime Environments (JRE) is available here: <a href="%(chart)s">%(chart)s</a>. Using Sun/Oracle Java or OpenJDK is recommended.
ro: O comparație a câtorva dintre dispozitivele Java Runtime Environments (JRE) disponibile este disponibilă aici: <a href="%(chart)s">%(chart)s</a>. Utilizarea Sun / Oracle Java sau OpenJDK este recomandată.

source: While the main I2P client implementation requires Java, there are several <a href="%(alt)s">alternative clients</a> which don't require Java.
ro: În timp ce principalul client I2P necesită implementarea Java, există mai multe <a href="%(alt)s">clienți alternativi</a> care nu necesită Java.

source: Whats an "eepsite"?
ro: Ce este un "eepsite"?

source: An eepsite is a website that is hosted anonymously, a hidden service which is accessible through your web browser. It can be accessed by setting your web browser's HTTP proxy to use the I2P web proxy (typically it listens on localhost port 4444), and browsing to the site.
ro: Un eepsit este un site web găzduit în mod anonim, un serviciu ascuns, accesibil prin browserul dvs. web. Poate fi accesat prin setarea proxy-ului HTTP al browserului tău pentru a utiliza proxy-ul web I2P (de obicei ascultă pe portul localhost 4444) și navigând pe site.

source: x is the number of peers you've sent or received a message from successfully in the last minute, y is the number of peers seen in the last hour or so. Try hovering your cursor over the other lines of information for a brief description.
ro: x este numărul colegilor pe care i-ați trimis sau ați primit un mesaj de la, cu succes în ultimul minut, y este numărul de colegi observați în ultima oră sau cam așa ceva. Încercați să plasați cursorul peste celelalte linii de informații pentru o scurtă descriere.

source: Is my router an "exit node" to the regular Internet? I don't want it to be.
ro: Este oare router-ul meu un "nod de ieșire" la Internetul obișnuit? Nu vreau să fie.

source: No. Unlike <a href="https://www.torproject.org/">Tor</a>, "exit nodes" - or "outproxies" as they are referred to on the I2P network - are not an inherent part of the network. Only volunteers who specifically set up and run separate applications will relay traffic to the regular Internet. There are very, very few of these. By default, I2P's HTTP Proxy (configured to run on port 4444) includes a single outproxy: false.i2p. This is run on a voluntary basis by Meeh. There is an <a href="%(outproxy)s">outproxy guide</a> available on our forums, if you would like to learn more about running an outproxy.
ro: Nu. Spre deosebire de <a href="https://www.torproject.org/">Tor</a>, „nodurile de ieșire” - sau „rezultatele” așa cum sunt menționate în rețeaua I2P - nu sunt o parte inerentă a rețelei. Doar voluntarii care configurează și rulează în mod specific aplicații separate vor transmite traficul pe Internetul obișnuit. Există foarte, foarte puține dintre acestea. În mod implicit, proxy-ul HTTP al I2P (configurat să funcționeze pe portul 4444) include o singură ieșire: false.i2p. Acest lucru este condus în mod voluntar de Meeh. Există un <a href="%(outproxy)s">ghid outproxy</a> disponibil pe forumurile noastre, dacă doriți să aflați mai multe despre rularea unui proces.

source: Yes, and this is how a fully distributed peer-to-peer network works. Every node participates in routing packets for others, so your IP address must be known to establish connections.
ro: Da, și așa funcționează o rețea complet distribuită peer-to-peer. Fiecare nod participă la rutarea pachetelor pentru alții, astfel încât adresa dvs. IP trebuie să fie cunoscută pentru a stabili conexiuni.

source: While the fact that your computer runs I2P is public, nobody can see your activities in it. You can't say if a user behind this IP address is sharing files, hosting a website, doing research or just running a node to contribute bandwidth to the project.
ro: Deși faptul că computerul rulează I2P este public, nimeni nu vă poate vedea activitățile. Nu puteți spune dacă un utilizator din spatele acestei adrese IP distribuie fișiere, găzduiește un site web, face cercetări sau rulează doar un nod pentru a contribui la lățimea de bandă la proiect.

source: I2P is primarily not intended, nor designed, to be used as a proxy to the regular internet. With that said, there are services which are provided by volunteers that act as proxies to clearnet based content - these are referred to as "outproxies" on the I2P network. There is an outproxy configured by default in I2P's HTTP client tunnel - false.i2p. While this service does currently exist, there is no guarantee that it will always be there as it is not an official service provided by the I2P project. If your main requirement from an anonymous network is the ability to access clearnet resources, we would recommend using <a href="https://www.torproject.org/">Tor</a>.
ro: I2P nu este destinat în primul rând, și nici nu este conceput, pentru a fi folosit ca un proxy pentru internetul obișnuit. În acest sens, există servicii furnizate de voluntari care acționează ca reprezentanți pentru conținutul bazat pe clarificări - acestea sunt denumite „outproxies” în rețeaua I2P. Există un outproxy configurat în mod implicit în tunelul client HTTP al I2P - false.i2p. Deși acest serviciu există în prezent, nu există nicio garanție că acesta va fi întotdeauna acolo, deoarece nu este un serviciu oficial furnizat de proiectul I2P. Dacă principala dvs. cerință dintr-o rețea anonimă este capacitatea de a accesa resurse clearnet, vă recomandăm să folosiți Tor.

source: I2P does not encrypt the Internet, neither does Tor - for example, through <a href="https://en.wikipedia.org/wiki/Transport_Layer_Security">Transport Layer Security (TLS)</a>. I2P and Tor both aim to transport your traffic as-is securely and anonymously over the corresponding network, to its destination. Any unencrypted traffic generated at your system will arrive at the outproxy (on I2P) or the exit node (on Tor) as unencrypted traffic. This means that you are vulnerable to snooping by the outproxy operators. One way to protect your outproxy traffic against this is to ensure that any traffic that will be handled by the outproxy is encrypted with TLS.
ro: I2P nu criptează Internetul, nici Tor - de exemplu, prin <a href="https://en.wikipedia.org/wiki/Transport_Layer_Security">Transport Layer Security (TLS)</a>. I2P și Tor au scopul de a transporta traficul dvs. în mod sigur și anonim prin rețeaua corespunzătoare, la destinația sa. Orice trafic necriptat generat în sistemul dvs. va ajunge la ieșirea de pe proxy (pe I2P) sau la nodul de ieșire (pe Tor) ca trafic necriptat. Acest lucru înseamnă că sunteți vulnerabil la suspiciune de către operatorii outproxy O modalitate de a vă proteja traficul de probabilitate împotriva acestuia este să vă asigurați că orice trafic care va fi gestionat de către acea procesare este criptat cu TLS.

source: For more information, you may read the Tor FAQ's answer to this question: <a href="https://www.torproject.org/docs/faq#CanExitNodesEavesdrop">https://www.torproject.org/docs/faq#CanExitNodesEavesdrop</a>
ro: Pentru mai multe informații, puteți citi răspunsul la întrebările frecvente ale Tor la această întrebare: <a href="https://www.torproject.org/docs/faq#CanExitNodesEavesdrop">https://www.torproject.org/docs/faq#CanExitNodesEavesdrop</a>

source: In addition, you may be vulnerable to collusion between the outproxy operator and operators of other I2P services, if you use the same tunnels ("shared clients"). There is additional discussion about this on <a href="http://%(zzz)s/topics/217">%(zzz)s</a>. This discussion has been <a href="%(i2pforum)s">mirrored on our forums</a> as well.
ro: În plus, este posibil să fiți vulnerabil la coluzia dintre operatorul de procesare externă și operatorii altor servicii I2P, dacă utilizați aceleași tuneluri („clienți partajați”). Există discuții suplimentare despre acest lucru<a href="http://%(zzz)s/topics/217">%(zzz)s</a>. Această discuție a fost <a href="%(i2pforum)s">oglindită</a> și pe forumurile noastre.

source: Ultimately, this is a question that only you can answer because the correct answer depends on your browsing behaviour, your <a href="%(threatmodel)s">threat model</a>, and how much you choose to trust the outproxy operator.
ro: În cele din urmă, aceasta este o întrebare la care numai tu poți răspunde, deoarece răspunsul corect depinde de comportamentul de navigare, <a href="%(threatmodel)s">modelul dvs. de amenințare</a> și cât de mult alegeți să aveți încredere în operatorul de procesare.

source: I2P is an anonymous network - it is designed to withstand attempts at blocking or censoring of content, thus providing a means for communication that anyone can use. I2P traffic that transits through your router is encrypted with several layers of encryption. Except in the case of a serious security vulnerability (of which none are currently known), it is not possible to know what the contents of the traffic are and thus not possible to distinguish between traffic which one is opposed to or not opposed to. We consider the 3 parts of the question:
ro: I2P este o rețea anonimă - este concepută pentru a rezista încercărilor de blocare sau cenzurare a conținutului, oferind astfel un mijloc de comunicare pe care oricine îl poate folosi. Traficul I2P care tranzitează routerul este criptat cu mai multe straturi de criptare. Cu excepția cazului unei vulnerabilități grave de securitate (despre care nu se cunoaște în prezent nimic), nu este posibil să știm care este conținutul traficului și, prin urmare, nu este posibil să distingem între trafic căruia i se opune sau nu. Avem în vedere cele 3 părți ale întrebării:

source: <b>Distribution</b><br> All traffic on I2P is encrypted in multiple layers. You don't know a message's contents, source, or destination. All traffic you route is internal to the I2P network, you are not an <a href="#exit">exit node</a> (referred to as an outproxy in our documentation). Your only alternative is to refuse to route <i>any</i> traffic, by setting your share bandwidth or maximum participating tunnels to 0 (see above). It would be nice if you didn't do this, you should help the network by routing traffic for others. Over 95&#37; of users route traffic for others.
ro: <b>distribuire</b><br> Tot traficul pe I2P este criptat în mai multe straturi. Nu știți conținutul, sursa sau destinația unui mesaj. Tot traficul pe care îl rotați este intern în rețeaua I2P, nu sunteți <a href="#exit">un nod de ieșire</a> (menționat ca un proces extern în documentația noastră). Singura dvs. alternativă este să refuzați să direcționați <i>orice</i> trafic, prin setarea lățimii de bandă sau a tunelurilor participante maxime la 0 (a se vedea mai sus). Ar fi bine dacă nu ați face acest lucru, ar trebui să ajutați rețeaua dirijând traficul pentru alții. Peste 95&#37; dintre utilizatori direcționează traficul pentru alții.

source: <b>Storage</b><br> I2P does not do distributed storage of content, this has to be specifically installed and configured by the user (with Tahoe-LAFS, for example). That is a feature of a different anonymous network, <a href="http://freenetproject.org/">Freenet</a>. By running I2P, you are not storing content for anyone.
ro: <b>Depozitare</b><br> I2P nu face stocarea distribuită a conținutului, aceasta trebuie să fie instalată și configurată în mod specific de către utilizator (cu Tahoe-LAFS, de exemplu). Aceasta este o caracteristică a unei rețele anonime diferite, <a href="http://freenetproject.org/">Freenet</a>. Prin rularea I2P, nu stocați conținut pentru nimeni.

source: <b>Access</b><br> If there are hidden services which you dislike, you may refrain from visiting them. Your router will not request any content without your specific instruction to do so.
ro: <b>Acces</b><br> Dacă există servicii ascunse care nu vă plac, vă puteți abține să le vizitați. Routerul dvs. nu va solicita niciun conținut fără instrucțiunile dvs. specifice pentru a face acest lucru.

source: The proxy config for different browsers is on a <a href="%(browserconfig)s"> separate page</a> with screenshots. More advanced configs with external tools, such as the browser plug-in FoxyProxy or the proxy server Privoxy, are possible but could introduce leaks in your setup.
ro: Configurarea proxy pentru diferite browsere se află pe o <a href="%(browserconfig)s">pagină separată</a> cu capturi de ecran. Sunt posibile configurații mai avansate cu instrumente externe, cum ar fi plug-in-ul browserului FoxyProxy sau serverul proxy Privoxy, dar ar putea introduce scurgeri în configurarea dvs.

source: A tunnel to the main IRC server within I2P, Irc2P, is created when I2P is installed (see the <a href="http://localhost:7657/i2ptunnel/index.jsp">I2PTunnel configuration page</a>), and is automatically started when the I2P router starts. To connect to it, tell your IRC client to connect to <code>localhost 6668</code>. HexChat-like client users can create a new network with the server <code>localhost/6668</code> (remember to tick "Bypass proxy server" if you have a proxy server configured). Weechat users can use the following command to add a new network:
ro: Un tunel către serverul principal IRC din I2P, Irc2P, este creat atunci când este instalat I2P (consultați <a href="http://localhost:7657/i2ptunnel/index.jsp">pagina de configurare I2PTunnel</a>) și este pornit automat la pornirea routerului I2P. Pentru a vă conecta la acesta, spuneți clientului dvs. IRC să se conecteze la <code>localhost:6668</code>. Utilizatorii client HexChat-like pot crea o nouă rețea cu serverul <code>localhost / 6668</code> (nu uitați să bifați „Bypass proxy server” dacă aveți configurat un server proxy). Utilizatorii Weechat pot folosi următoarea comandă pentru a adăuga o nouă rețea:

source: Click on the <a href="http://localhost:7658/">Website</a> link at the top of your router console for instructions.
ro: Faceți clic pe <a href="http://localhost:7658/">link site-ului Web</a> din partea de sus a consolei routerului pentru instrucțiuni.

source: The ports that are used by I2P can be divided into 2 sections:
ro: Porturile utilizate de I2P pot fi împărțite în 2 secțiuni:

source: Internet-facing ports, which are used for communication with other I2P routers
ro: Porturi orientate către Internet, care sunt utilizate pentru comunicarea cu alte routere I2P

source: Local ports, for local connections
ro: Porturi locale, pentru conexiuni locale

source: These are described in detail below.
ro: Acestea sunt descrise în detaliu mai jos.

source: Internet-facing ports<br> Note: Since release 0.7.8, new installs do not use port 8887; a random port between 9000 and 31000 is selected when the program is run for the first time. The selected port is shown on the router <a href="http://127.0.0.1:7657/confignet">configuration page</a>.
ro: Porturi orientate către Internet <br>Notă: De la lansarea 0.7.8, noile instalări nu utilizează portul 8887; un port aleatoriu între 9000 și 31000 este selectat atunci când programul este rulat pentru prima dată. Portul selectat este afișat pe <a href="http://127.0.0.1:7657/confignet">pagina de configurare</a> a routerului.

source: UDP from the random port listed on the <a href="http://127.0.0.1:7657/confignet">configuration page</a> to arbitrary remote UDP ports, allowing for replies
ro: UDP din portul aleatoriu listat pe <a href="http://127.0.0.1:7657/confignet">pagina de configurare</a> până la porturile UDP la distanță arbitrare, permițând răspunsuri

source: TCP from random high ports to arbitrary remote TCP ports
ro: TCP de la porturile înalte aleatorii la porturile TCP la distanță arbitrare

source: Outbound UDP on port 123, allowing for replies. This is necessary for I2P's internal time sync (via SNTP - querying a random SNTP host in pool.ntp.org or another server you specify)
ro: UDP în ieșire pe portul 123, permițând răspunsuri. Acest lucru este necesar pentru sincronizarea internă a timpului I2P (prin SNTP - interogarea unei gazde SNTP aleatorii în pool.ntp.org sau un alt server specificat)

source: (Optional, recommended) UDP to the port noted on the <a href="http://127.0.0.1:7657/confignet">configuration page</a> from arbitrary locations
ro: (Opțional, recomandat) UDP către portul notat pe <a href="http://127.0.0.1:7657/confignet">pagina de configurare</a> din locații arbitrare

source: (Optional, recommended) TCP to the port noted on <a href="http://127.0.0.1:7657/confignet">configuration page</a> from arbitrary locations
ro: (Opțional, recomandat) TCP la portul notat pe <a href="http://127.0.0.1:7657/confignet">pagina de configurare</a> din locații arbitrare

source: Inbound TCP can be disabled on the <a href="http://127.0.0.1:7657/confignet">configuration page</a>
ro: TCP de intrare poate fi dezactivat pe <a href="http://127.0.0.1:7657/confignet">pagina de configurare</a>

source: Local I2P ports, listening only to local connections by default, except where noted:
ro: Porturi I2P locale, care ascultă în mod implicit conexiunile locale, cu excepția cazului în care este menționat:

source: PURPOSE
ro: SCOP

source: DESCRIPTION
ro: DESCRIERE

source: Cannot be changed. Binds to all interfaces. May be disabled on <a href="http://127.0.0.1:7657/confignet">confignet</a>.
ro: Nu se poate schimba. Se leagă la toate interfețele. Poate fi dezactivat pe <a href="http://127.0.0.1:7657/confignet">confignet</a>.

source: A higher level socket API for clients. Disabled by default. May be enabled/disabled on <a href="http://127.0.0.1:7657/configclients">configclients</a>. May be changed in the bob.config file.
ro: O API de socket la nivel superior pentru clienți. Dezactivat implicit. Poate fi activat / dezactivat pe pagina <a href="http://127.0.0.1:7657/configclients">configclients</a>. Poate fi modificat în fișierul bob.config.

source: May be disabled or changed on the i2ptunnel page in the router console. May also be configured to be bound to a specific interface or all interfaces.
ro: Poate fi dezactivat sau schimbat pe pagina i2ptunnel din consola routerului. Poate fi, de asemenea, configurat pentru a fi conectat la o anumită interfață sau la toate interfețele.

source: Binds to the LAN address. May be changed with advanced config <code>i2np.upnp.HTTPPort=nnnn</code>. May be disabled on <a href="http://127.0.0.1:7657/confignet">confignet</a>.
ro: Se leagă la adresa LAN. Poate fi modificat cu configurația avansată <code>i2np.upnp.HTTPPort = nnnn</code>. Poate fi dezactivat pe pagina <a href="http://127.0.0.1:7657/confignet">confignet</a>.

source: Binds to the LAN address. May be changed with advanced config <code>i2np.upnp.SSDPPort=nnnn</code>. May be disabled on <a href="http://127.0.0.1:7657/confignet">confignet</a>.
ro: Se leagă la adresa LAN. Poate fi modificat cu configurația avansată <code>i2np.upnp.SSDPPort = nnnn</code>. Poate fi dezactivat pe pagina <a href="http://127.0.0.1:7657/confignet">confignet</a>.

source: Used by client apps. May be changed to a different port on <a href="http://127.0.0.1:7657/configclients">configclients</a> but this is not recommended. May be to bind to a different interface or all interfaces, or disabled, on <a href="http://127.0.0.1:7657/configclients">configclients</a>.
ro: Folosit de aplicațiile client. Poate fi schimbat într-un port diferit pe <a href="http://127.0.0.1:7657/configclients">pagina de configurații</a>, dar acest lucru nu este recomandat. Poate fi legarea la o altă interfață sau la toate interfețele, sau dezactivate, pe pagina <a href="http://127.0.0.1:7657/configclients">configclients</a>.

source: A higher level socket API for clients Only opened when a SAM V3 client requests a UDP session. May be enabled/disabled on <a href="http://127.0.0.1:7657/configclients">configclients</a>. May be changed in the <code>clients.config</code> file with the SAM command line option <code>sam.udp.port=nnnn</code>.
ro: O API de socket la nivel superior pentru clienți Deschisă numai atunci când un client SAM V3 solicită o sesiune UDP. Poate fi activat / dezactivat pe <a href="http://127.0.0.1:7657/configclients">pagina configclients</a>. Poate fi modificat în fișierul <code>clients.config</code> cu opțiunea linie de comandă SAM <code>sam.udp.port = nnnn</code>.

source: A higher level socket API for clients Disabled by default for new installs as of release 0.6.5. May be enabled/disabled on <a href="http://127.0.0.1:7657/configclients">configclients</a>. May be changed in the <code>clients.config</code> file.
ro: O API-ul socket-ului de nivel superior pentru clienți Dezactivat implicit pentru noile instalări începând cu versiunea 0.6.5. Poate fi activat / dezactivat pe <a href="http://127.0.0.1:7657/configclients">pagina configclients</a>. Poate fi modificat în fișierul <code>clients.config</code>.

source: May be disabled in the <code>clients.config</code>file. May also be configured to be bound to a specific interface or all interfaces in that file.
ro: Poate fi dezactivat în fisier <code>client.config</code>. Poate fi, de asemenea, configurat pentru a fi legat la o anumită interfață sau la toate interfețele din acel fișier.

source: May be disabled in the <code>clients.config</code> file. May also be configured to be bound to a specific interface or all interfaces in the <code>jetty.xml</code> file.
ro: Poate fi dezactivat în fișierul <code>clients.config</code>. Poate fi, de asemenea, configurat pentru a fi conectat la o anumită interfață sau la toate interfețele din fișierul <code>jetty.xml</code>.

source: May be disabled or changed on the i2ptunnel page in the router console. May also be configured to be bound to a specific interface or all interfaces.
ro: Poate fi dezactivat sau schimbat pe pagina i2ptunnel din consola routerului. Poate fi, de asemenea, configurat pentru a fi conectat la o anumită interfață sau la toate interfețele.

source: Outbound to 32000 only, does not listen on this port. Starts at 31000 and will increment until 31999 looking for a free port. To change, see the <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper documentation</a>. For more information see <a href="#port32000">below</a>.
ro: În ieșire numai la 32000, nu ascultă acest port. Începe la 31000 și va crește până la 31999 în căutarea unui port liber. Pentru a schimba, consultați <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentația de înveliș</a>. Pentru mai multe informații, vedeți </a>mai jos</a>.

source: To change, see the <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">wrapper documentation</a>. For more information see <a href="#port32000">below</a>.
ro: Pentru a schimba, consultați <a href="http://wrapper.tanukisoftware.com/doc/english/prop-port.html">documentația de înveliș</a>. Pentru mai multe informații, vedeți <a href="#port32000">mai jos</a>.
