Repository: ChristopherBilg/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/priority.po
Languages: ro

source: The local I2P ports and the I2PTunnel ports do not need to be reachable from remote machines, but *should* be reachable locally. You can also create additional ports for I2PTunnel instances via http://localhost:7657/i2ptunnel/ (and in turn, would need to get your firewall to allow you local access, but not remote access, unless desired).
ro: Porturile locale I2P și porturile I2PTunnel nu trebuie să fie accesibile de la mașini la distanță, dar *ar trebui să fie accesibile* la nivel local. Puteți crea, de asemenea, porturi suplimentare pentru procese I2PTunnel prin http://localhost:7657/i2ptunnel/ (și, la rândul său, ar trebui sa aveti permisiunea sa obțineti accesul prin firewall de a accesa adresa locala, dar nu si acces de la distanță, decat dacă se dorește).

source: So, to summarize, nothing needs to be reachable by unsolicited remote peers, but if you can configure your NAT/firewall to allow inbound UDP and TCP the <a href="http://localhost:7657/config">outbound facing port</a>, you'll get better performance. You will also need to be able to send outbound UDP packets to arbitrary remote peers (blocking IPs randomly with something like PeerGuardian only hurts you - don't do it).
ro: Deci, pentru a rezuma, nimic nu trebuie să fie accesibil de parteneri îndepărtate nesolicitate, dar dacă puteți configura NAT / firewall pentru a permite intrarea UDP și TCP outbound <a href="http://localhost:7657/config">port de iesire </a>, veți obține o performanță mai bună. Veți avea nevoie, de asemenea, să fiti în măsură de a trimite pachete UDP de ieșire cu colegii îndepărtate arbitrare (blocarea IP-uri la intamplare cu ceva de genul PeerGuardian numai tu doare - nu fa).

source: This question can be answered in 3 parts:
ro: La această întrebare puteți răspunde în 3 părți:

source: My router often displays a message saying "Website Not Found In Addressbook", why do I see this message?
ro: Routerul meu afișează adesea un mesaj care spune „Website-ul care nu este găsit în agenda”, de ce văd acest mesaj?

source: Human-readable addresses such as <i>http://website.i2p</i> are references to a long, random string known as a <b>destination</b>. These references are registered and stored at addressbook services such as stats.i2p, which is run by zzz. You will often encounter a "b32" address. A "b32" is a hash (specifically, a <a href="https://en.wikipedia.org/wiki/SHA-2">SHA256</a> hash) of the destination. This hash is appended with ".b32.i2p" and serves as a convenient way to link to your hidden service, without requiring any registration on an addressbook service.
ro: Adresele care pot fi citite de oameni, cum ar fi <i>http://website.i2p</i>, sunt referiri la un șir lung, aleatoriu, cunoscut drept <b>destinație</b>. Aceste referințe sunt înregistrate și stocate la serviciile de adrese, cum ar fi stats.i2p, care este condus de zzz. Adesea veți întâlni o adresă „b32”. Un "b32" este un hash (în mod special, un hash <a href="https://en.wikipedia.org/wiki/SHA-2">SHA256</a>) al destinaţiei. Acest hash este anexat cu „.b32.i2p” și servește ca o modalitate convenabilă de conectare la serviciul tău ascuns, fără a fi necesară nicio înregistrare pe un serviciu din agenda de adrese.

source: It is possible to add subscriptions to your router's configuration which may reduce the frequency of these messages.
ro: Este posibil să adăugați abonamente la configurația routerului dvs. care ar putea reduce frecvența acestor mesaje.

source: What is an addressbook subscription?
ro: Ce este un abonament la agenda de adrese?

source: This is a list of files hosted on various I2P websites each of which contain a list of I2P hosts and their associated destinations.
ro: Aceasta este o listă de fișiere găzduite pe diverse site-uri web I2P, fiecare conținând o listă de gazde I2P și destinațiile asociate.

source: The addressbook is located at <a href="http://localhost:7657/dns">http://localhost:7657/dns</a> where further information can be found.
ro: Carnetul de adrese se află la adresa<a href="http://localhost:7657/dns">http://localhost:7657/dns</a> unde se pot găsi informații suplimentare.

source: What are some good addressbook subscription links?
ro: Care sunt câteva link-uri bune de abonament la agenda de adrese?

source: You may try the following:
ro: Puteți încerca următoarele:

source: For security purposes, the router's admin console by default only listens for connections on the local interface. There are two methods for accessing the console remotely:
ro: În scopuri de securitate, în mod implicit, consola de administrare a routerului ascultă numai conexiunile din interfața locală. Există două metode pentru accesarea consolei de la distanță:

source: SSH Tunnel
ro: Tunelul SSH

source: Configuring your console to be available on a Public IP address with a username &amp; password
ro: Configurarea consolei pentru a fi disponibilă pe o adresă IP publică cu un nume de utilizator și o parolă

source: These are detailed below:
ro: Acestea sunt detaliate mai jos:

source: If you are running a Unix-like Operating System, this is the easiest method for remotely accessing your I2P console. (Note: SSH server software is available for systems running Windows, for example <a href="https://github.com/PowerShell/Win32-OpenSSH">https://github.com/PowerShell/Win32-OpenSSH</a>)
ro: Dacă executați un sistem de operare similar Unix, aceasta este cea mai ușoară metodă pentru accesarea de la distanță a consolei I2P. (Notă: software-ul serverului SSH este disponibil pentru sistemele care rulează Windows, de exemplu <a href="https://github.com/PowerShell/Win32-OpenSSH">https://github.com/PowerShell/Win32-OpenSSH</a>)

source: Once you have configured SSH access to your system, the '-L' flag is passed to SSH with appropriate arguments - for example:
ro: După ce ați configurat accesul SSH la sistemul dvs., steagul „-L” este trecut la SSH cu argumente adecvate - de exemplu:

source: Open <code>~/.i2p/clients.config</code> and replace
ro: Deschide <code>~/.i2p/clients.config</code> și înlocuiește

source: Go to <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> and add a console username and password if desired - Adding a username &amp; password is highly recommended to secure your I2P console from tampering, which could lead to de-anonymization.
ro: Accesați <a href="http://localhost:7657/configui">http://localhost:7657/configui</a> și adăugați un nume de utilizator și o parolă, dacă doriți - Adăugarea unui nume de utilizator și a unei parole este foarte recomandat pentru a vă proteja consola I2P de la alterarea, ceea ce ar putea duce la de-anonimizare.

source: Go to <a href="http://localhost:7657/index">http://localhost:7657/index</a> and hit "Graceful restart", which restarts the JVM and reloads the client applications
ro: Accesați <a href="http://localhost:7657/index">http://localhost:7657/index</a> și atingeți „Graceful restart”, care repornește JVM și reîncarcă aplicațiile client

source: After that fires up, you should now be able to reach your console remotely. Load the router console at <code>http://(System_IP):7657</code> and you will be prompted for the username and password you specified in step 2 above if your browser supports the authentication popup.
ro: După ce se declanșează, acum ar trebui să poți ajunge la consola de la distanță. Încărcați consola routerului la <code>http://(System_IP):7657 </code>și vi se va solicita numele de utilizator și parola pe care le-ați specificat la pasul 2 de mai sus dacă browser-ul dvs. acceptă fereastra pop-up de autentificare.

source: NOTE: You can specify 0.0.0.0 in the above configuration. This specifies an interface, not a network or netmask. 0.0.0.0 means "bind to all interfaces", so it can be reachable on 127.0.0.1:7657 as well as any LAN/WAN IP. Be careful when using this option as the console will be available on ALL addresses configured on your system.
ro: NOTĂ: Puteți specifica 0.0.0.0 în configurația de mai sus. Aceasta specifică o interfață, nu o rețea sau o mască net. 0.0.0.0 înseamnă „legare la toate interfețele”, astfel încât acesta poate fi accesat pe 127.0.0.1:7657, precum și orice IP LAN / WAN. Aveți grijă când utilizați această opțiune, deoarece consola va fi disponibilă la TOATE adresele configurate pe sistemul dvs.

source: Please see the previous answer for instructions on using SSH Port Forwarding, and also see this page in your console: <a href="http://localhost:7657/configi2cp">http://localhost:7657/configi2cp</a>
ro: Vă rugăm să consultați răspunsul anterior pentru instrucțiuni despre utilizarea SSH Port Forwarding și, de asemenea, consultați această pagină în consola dvs.: <a href="http://localhost:7657/configi2cp">http://localhost: 7657/configi2cp</a>

source: The SOCKS proxy has been functional since release 0.7.1. SOCKS 4/4a/5 are supported. I2P does not have a SOCKS outproxy so it is limited to use within I2P only.
ro: Proxy-ul SOCKS a fost funcțional de la versiunea 0.7.1. SOCKS 4 / 4a / 5 sunt acceptate. I2P nu are o ieșire de tip SOCKS, deci este limitat să fie utilizat doar în I2P.

source: Many applications leak sensitive information that could identify you on the Internet and this is a risk that one should be aware of when using the I2P SOCKS proxy. I2P only filters connection data, but if the program you intend to run sends this information as content, I2P has no way to protect your anonymity. For example, some mail applications will send the IP address of the machine they are running on to a mail server. There is no way for I2P to filter this, thus using I2P to 'socksify' existing applications is possible, but extremely dangerous.
ro: Multe aplicații scurg informații sensibile care v-ar putea identifica pe Internet și acesta este un risc de care cineva ar trebui să fie conștient atunci când utilizați proxy-ul I2P SOCKS. I2P filtrează doar datele conexiunii, dar dacă programul pe care intenționați să-l executați trimite aceste informații ca conținut, I2P nu are cum să vă protejeze anonimatul. De exemplu, unele aplicații de mail vor trimite adresa IP a mașinii pe care o rulează pe un server de mail. Nu există nicio cale pentru I2P să filtreze acest lucru, folosind astfel I2P pentru a „socksifica” aplicațiile existente este posibil, dar extrem de periculos.

source: If you would like more information on the socks proxy application anyway, there are some helpful hints on the <a href="%(socks)s">socks page</a>.
ro: Dacă doriți mai multe informații cu privire la aplicarea proxy socks, oricum, există câteva sfaturi utile pe <a href="%(socks)s">pagina socks</a>.

source: An I2P router only needs to be seeded once, to join the network for the first time. Reseeding involves fetching multiple "RouterInfo" files (bundled into a signed zip-file) from at least two predefined server URLs picked from a volunteer-run group of clearnet HTTPS servers.
ro: Un router I2P trebuie să fie însămânțat o singură dată, pentru a se alătura rețelei pentru prima dată. Reconsiderarea presupune preluarea mai multor fișiere „RouterInfo” (înglobate într-un fișier zip semnat) din cel puțin două adrese URL predefinite ale serverului ales de la un grup de voluntari de servere HTTPS clearnet.

source: A typical symptom of a failed reseed is the "Known" indicator (on the left sidebar of the router console) displaying a very small value (often less than 5) which does not increase. This can occur, among other things, if your local firewall limits outbound traffic or if the reseed request is blocked entirely.
ro: Un simptom tipic al unei analize eșuate este indicatorul „Cunoscut” (din stânga) bara laterală a consolei routerului) afișând o valoare foarte mică (adesea mai mică decât 5) care nu crește. Acest lucru poate apărea, printre altele, dacă este local firewallul limitează traficul de ieșire sau dacă solicitarea solicitată este blocată în întregime.

source: If you are stuck behind an ISP firewall or filter, you can use the following manual method (non-automated technical solution) to join the I2P network.
ro: Dacă sunteți blocat în spatele unui firewall sau filtru ISP, puteți utiliza următoarele metoda manuală (soluție tehnică neautomatizată) pentru a se alătura rețelei I2P.

source: As of release 0.9.33, you may also configure your router to reseed through a proxy. Go to <a href="%(url)s">%(url)s</a> and configure the proxy type, hostname, and port.
ro: Începând cu versiunea 0.9.33, puteți configura, de asemenea, routerul dvs. pentru a fi conectat printr-un proxy. Accesați <a href="%(url)s">%(url)s</a> și configurați tipul de proxy, numele de gazdă și portul.

source: Joining the I2P Network using a reseed file
ro: Alăturarea rețelei I2P folosind un fișier analizat

source: Please contact a known trustworthy friend who has a running I2P router, and ask them for help with reseeding your I2P router. Request that they send you a reseed file exported from their running I2P router. It is vital that the file is exchanged over a secure channel, e.g. encrypted to avoid external tampering (PGP Sign, Encrypt and Verified with a trusted public key). The file itself is unsigned, so please accept files only from known trusted friends. Never import a reseed file if you can not verify its source.
ro: Vă rugăm să contactați un prieten de încredere cunoscut, care are un router I2P rulant și întrebați pentru ajutor cu redirecționarea routerului dvs. I2P. Solicitați să vă trimită un fișier reseed exportat de la routerul lor I2P rulant. Este vital ca fișierul să fie schimbate pe un canal securizat, de ex. criptat pentru a evita manipularea externă (PGP) Semnează, criptează și verifică cu o cheie publică de încredere). Fișierul în sine este nesemnat, deci vă rugăm să acceptați fișierele numai de la prieteni de încredere cunoscuți. Nu importați niciodată un fișier analizat dacă nu puteți verifica sursa acestuia.

source: To import the received %(filename)s file into your local I2P router:
ro: Pentru a importa fișierul %(filename)s primit în routerul dvs. I2P local:

source: Go to <a href="%(url)s">%(url)s</a>
ro: Mergi la <a href="%(url)s">%(url)s</a>

source: Under "Manual Reseed from File" click "Browse..."
ro: La „Manual reseed din fișier” faceți clic pe „Browse ...”

source: Select the %(filename)s file
ro: Selectați fișierul %(filename)s

source: Click "Reseed from File"
ro: Faceți clic pe „Reseed from File”

source: Check the <a href="%(url)s">log</a> for the following message:
ro: Verificați <a href="%(url)s">jurnalul</a> pentru următorul mesaj:

source: Sharing a reseed file
ro: Partajarea unui fișier reseed

source: For trusted friends you can use your local I2P router to give them a jump start:
ro: Pentru prietenii de încredere, puteți folosi routerul I2P local pentru a le da startul:

source: Under "Create Reseed File" click "Create reseed file"
ro: În secțiunea „Creare fișier reseed” faceți clic pe „Creați fișier reseed”

source: Securely send the %(filename)s file to your friend
ro: Trimiteți în siguranță fișierul %(filename)sprietenului tău

source: Do not reveal this file in any case to unknown users, since it contains sensitive private data (100 RouterInfo) from your own I2P router! In order to protect your anonymity: you may wait a few random hours/days before you share the file with your trusted friend. It is also advisable to use this procedure sparingly (< 2 per week).
ro: Nu dezvăluiți acest fișier în niciun caz utilizatorilor necunoscuți, deoarece conține date private sensibile (100 RouterInfo) de pe propriul router I2P! Pentru a protejați-vă anonimatul: este posibil să așteptați câteva ore / zile aleatorii înainte de partajare fișierul cu prietenul tău de încredere. De asemenea, este recomandabil să utilizați această procedură puțin (<2 pe săptămână).

source: General guidelines for manual reseeding of I2P
ro: linii directoare generale pentru reînvierea manuală a I2P

source: Do not publicly publish the reseed file or share these files with a friend of a friend!
ro: Nu publicați public fișierul cercetat și nu împărtășiți aceste fișiere cu un prieten al unui prieten!

source: This file should be used only for a very limited number of friends (< 3)!
ro: Acest fișier ar trebui utilizat doar pentru un număr foarte limitat de prieteni (<3)!

source: The file is valid only a few days (< 20)!
ro: Fișierul este valabil doar câteva zile (<20)!

source: Unless an outproxy has been specifically set up for the service you want to connect to, this cannot be done. There are only three types of outproxies running right now: HTTP, HTTPS, and email. Note that there is no SOCKS outproxy. If this type of service is required, we recommend that you use Tor. Please be aware that the Tor project <a href="https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea">recommends against using BitTorrent over Tor</a>, as there are serious anonymity-related issues associated with doing so.
ro: Dacă nu a fost configurată în mod specific o ieșire de probă pentru serviciul la care doriți să vă conectați, acest lucru nu poate fi realizat. Există doar trei tipuri de rezultate care funcționează acum: HTTP, HTTPS și e-mail. Rețineți că nu există o procesare SOCKS. Dacă este necesar acest tip de serviciu, vă recomandăm să folosiți Tor. Rețineți că proiectul Tor recomandă <a href="https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea">utilizarea BitTorrent peste Tor</a>, întrucât există probleme serioase legate de anonimat asociate cu acest lucru.

source: Within I2P, there is no requirement to use HTTPS. All traffic is encrypted end-to-end, any further encryption, e.g. with the use of HTTPS, doesn't create any further anonymity-related benefits. However, if one would like to use HTTPS or has a requirement to do so, the existing default I2P HTTP Proxy has support for HTTPS traffic. Any hidden service operator would have to specifically set up and enable HTTPS access.
ro: În cadrul I2P, nu există nicio cerință de a utiliza HTTPS. Tot traficul este criptat de la capăt la capăt, orice criptare suplimentară, de ex. cu utilizarea HTTPS, nu creează alte avantaje legate de anonimat. Cu toate acestea, dacă cineva dorește să utilizeze HTTPS sau are o cerință în acest sens, proxy-ul HTTP I2P implicit existent are suport pentru traficul HTTPS. Orice operator de servicii ascuns ar trebui să configureze și să permită accesul HTTPS în mod specific.

source: FTP is not supported for technical reasons. There are no FTP "outproxies" to the Internet—it may not even be possible to set up one. Any other kind of outproxy may work if it's set up with a standard tunnel. If you would like to set up some type of outproxy, carefully research the potential risks. The I2P community may or may not be able to help with the technical aspects, feel free to ask. As explained several times above, any existing outproxy isn't a core part of the network. They are services run by individuals and they may or may not be operational at any given time.
ro: FTP nu este acceptat din motive tehnice. Nu există „outproxies” FTP pe Internet - este posibil să nu fie chiar setat unul. Orice alt tip de proces poate funcționa dacă este configurat cu un tunel standard. Dacă doriți să configurați un tip de outproxy, cercetați cu atenție riscurile potențiale. Comunitatea I2P poate sau nu să poată ajuta cu aspectele tehnice, nu ezitați să întrebați. Așa cum s-a explicat de mai multe ori mai sus, orice rezultat extern nu este o parte centrală a rețelei. Sunt servicii administrate de persoane și pot fi sau nu funcționale la un moment dat.

source: My router is using a large amount of CPU, what can I do about this?
ro: Routerul meu folosește o cantitate mare de procesor, ce pot face despre asta?

source: There are many possible causes of high CPU usage. Here is a checklist:
ro: Există mai multe cauze posibile de utilizare majoră a procesorului. Aici este o listă:

source: Java Runtime Environment
ro: Mediu Runtime Java

source: Try to use either OpenJDK or Sun/Oracle Java if it's available for your system. You can check which version of java you have installed by typing <code>java -version</code> at a command/shell prompt. Performance tends to suffer with other implementations of java.
ro: Încercați să utilizați OpenJDK sau Sun / Oracle Java dacă este disponibil pentru sistemul dvs. Puteți verifica ce versiune de java ați instalat tastând <code>java -version</code> la un prompt de comandă / shell. Performanța tinde să sufere cu alte implementări ale java.

source: File sharing applications, e.g. BitTorrent
ro: Aplicații de partajare a fișierelor, de ex. BitTorrent

source: Are you running a BitTorrent client over I2P? Try reducing the number of torrents, the bandwidth limits, or try turning it off completely to see if that helps.
ro: Rulezi un client BitTorrent in rețeaua I2P? Încercați să reduceți numărul de torente, limitele lățimi de bandă, sau încercați să îl opriți complet pentru a vedea dacă asta ajută.

source: High bandwidth settings
ro: Setări de lățime de bandă ridicate

source: Are your bandwidth limits set too high? It is possible that too much traffic is going through your I2P router and it is overloaded. Try reducing the setting for <em>share bandwidth percentage</em> on the <a href="http://localhost:7657/config">configuration</a> page.
ro: Limitele dvs. de lățime de bandă sunt setate prea mari? Este posibil să treacă prea mult trafic prin routerul dvs. I2P și să fie supraîncărcat. Încercați să reduceți setarea pentru <em>rocentul de lățime de bandă partajată</em> pe <a href="http://localhost:7657/config">pagina de configurare</a>.

source: I2P Version
ro: Versiunea I2P

source: Make sure that you're running the latest version of I2P to get the benefits of increased performance and bug fixes.
ro: Asigurați-vă că rulați cea mai recentă versiune a I2P pentru a obține beneficii de performanță crescută și remedierea bug-urilor.

source: Memory allocation
ro: Alocare de memorie

source: Has enough memory been set aside for use by I2P? Look at the memory graph on <a href="http://localhost:7657/graphs">the graphs page</a> to see if the memory usage is "pegged"&mdash;the JVM is spending most of its time in garbage collection. Increase the setting <code>wrapper.java.maxmemory</code> in the file <code>wrapper.config</code>.
ro: A fost destinsă memorie suficientă pentru utilizarea de către I2P? Uită-te la graficul de memorie din <a href="http://localhost:7657/graphs">pagina cu grafice</a> pentru a vedea dacă memoria este „fixată” - JVM își petrece cea mai mare parte a timpului în colectarea gunoiului. Măriți setarea <code>wrapper.java.maxmemory</code> în fișierul <code>wrapper.config</code>.

source: Bursts of high-usage vs. constant 100% usage
ro: Explozie de utilizare mare față de consum constant de 100%

source: Is the CPU usage simply higher than you would like, or is it pegged at 100&#37; for a long time? If it is pegged, this could be a bug. Look in the logs for clues.
ro: Utilizarea procesorului este pur și simplu mai mare decât v-ați dori sau este legată de 100% pentru o lungă perioadă de timp? În cazul în care este atașat, acesta ar putea fi un bug. Căutați în jurnalele pentru indicii.

source: Java-related
ro: Java legate

source: You may be using the Java-based BigInteger library instead of the native version, especially if you are running on a new or unusual OS or hardware (OpenSolaris, mipsel, etc.). See the <a href="%(jbigi)s">jbigi page</a> for instructions on diagnosing, building, and testing methods.
ro: Este posibil să utilizați biblioteca BigInteger bazată pe Java în loc de versiunea nativă, mai ales dacă folosiți un sistem de operare sau hardware nou sau neobișnuit (OpenSolaris, mipsel, etc.). Consultați <a href="%(jbigi)s">pagina jbigi</a> pentru instrucțiuni privind diagnosticarea, construirea și metodele de testare.
